[
    {
        "cveId": "CVE-2003-0011",
        "datePublished": "2003-03-21T05:00:00",
        "description": {
            "lang": "en",
            "value": "Unknown vulnerability in the DNS intrusion detection application filter for Microsoft Internet Security and Acceleration (ISA) Server 2000 allows remote attackers to cause a denial of service (blocked traffic to DNS servers) via a certain type of incoming DNS request that is not properly handled."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-0230",
        "datePublished": "2003-07-25T04:00:00",
        "description": {
            "lang": "en",
            "value": "Microsoft SQL Server 7, 2000, and MSDE allows local users to gain privileges by hijacking a named pipe during the authentication of another user, aka the \"Named Pipe Hijacking\" vulnerability."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2003-0237",
        "datePublished": "2003-05-07T04:00:00",
        "description": {
            "lang": "en",
            "value": "The \"ICQ Features on Demand\" functionality for Mirabilis ICQ Pro 2003a does not properly verify the authenticity of software upgrades, which allows remote attackers to install arbitrary software via a spoofing attack."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2003-0238",
        "datePublished": "2003-05-07T04:00:00",
        "description": {
            "lang": "en",
            "value": "The Message Session window in Mirabilis ICQ Pro 2003a allows remote attackers to cause a denial of service (CPU consumption) by spoofing the address of an ADS server and sending HTML with a -1 width in a table tag."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2003-0292",
        "datePublished": "2003-05-15T04:00:00",
        "description": {
            "lang": "en",
            "value": "Cross-site scripting (XSS) vulnerability in Inktomi Traffic-Server 5.5.1 allows remote attackers to insert arbitrary web script or HTML into an error page that appears to come from the domain that the client is visiting, aka \"Man-in-the-Middle\" XSS."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2003-0370",
        "datePublished": "2003-06-05T04:00:00",
        "description": {
            "lang": "en",
            "value": "Konqueror Embedded and KDE 2.2.2 and earlier does not validate the Common Name (CN) field for X.509 Certificates, which could allow remote attackers to spoof certificates via a man-in-the-middle attack."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2003-0386",
        "datePublished": "2003-06-10T04:00:00",
        "description": {
            "lang": "en",
            "value": "OpenSSH 3.6.1 and earlier, when restricting host access by numeric IP addresses and with VerifyReverseMapping disabled, allows remote attackers to bypass \"from=\" and \"user@host\" address restrictions by connecting to a host from a system whose reverse DNS hostname contains the numeric IP address."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-0432",
        "datePublished": "2003-06-18T04:00:00",
        "description": {
            "lang": "en",
            "value": "Ethereal 0.9.12 and earlier does not handle certain strings properly, with unknown consequences, in the (1) BGP, (2) WTP, (3) DNS, (4) 802.11, (5) ISAKMP, (6) WSP, (7) CLNP, (8) ISIS, and (9) RMI dissectors."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-0468",
        "datePublished": "2003-08-05T04:00:00",
        "description": {
            "lang": "en",
            "value": "Postfix 1.1.11 and earlier allows remote attackers to use Postfix to conduct \"bounce scans\" or DDos attacks of other hosts via an email address to the local host containing the target IP address and service name followed by a \"!\" string, which causes Postfix to attempt to use SMTP to communicate with the target on the associated port."
        },
        "metrics": [],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2003-0573",
        "datePublished": "2003-08-18T04:00:00Z",
        "description": {
            "lang": "en",
            "value": "The DNS callbacks in nsd in SGI IRIX 6.5.x through 6.5.20f, and possibly earlier versions, do not perform sufficient sanity checking, with unknown impact."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-0636",
        "datePublished": "2003-08-02T04:00:00",
        "description": {
            "lang": "en",
            "value": "Novell iChain 2.2 before Support Pack 1 does not properly verify that URL redirects match the DNS name of an accelerator, which allows attackers to redirect URLs to malicious web sites."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-0688",
        "datePublished": "2003-09-03T04:00:00",
        "description": {
            "lang": "en",
            "value": "The DNS map code in Sendmail 8.12.8 and earlier, when using the \"enhdnsbl\" feature, does not properly initialize certain data structures, which allows remote attackers to cause a denial of service (process crash) via an invalid DNS response that causes Sendmail to free incorrect data."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-0980",
        "datePublished": "2003-12-11T05:00:00",
        "description": {
            "lang": "en",
            "value": "Cross-site scripting (XSS) vulnerability in FreeScripts VisitorBook LE (visitorbook.pl) allows remote attackers to inject arbitrary HTML or web script via (1) the \"do\" parameter, (2) via the \"user\" parameter from a host with a malicious reverse DNS name, (3) via quote marks or ampersands in other parameters."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-0981",
        "datePublished": "2003-12-11T05:00:00",
        "description": {
            "lang": "en",
            "value": "FreeScripts VisitorBook LE (visitorbook.pl) logs the reverse DNS name of a visiting host, which allows remote attackers to spoof the origin of their incoming requests and facilitate cross-site scripting (XSS) attacks."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-1116",
        "datePublished": "2005-03-12T05:00:00",
        "description": {
            "lang": "en",
            "value": "The communications protocol for the Report Review Agent (RRA), aka FND File Server (FNDFS) program, in Oracle E-Business Suite 10.7, 11.0, and 11.5.1 to 11.5.8 allows remote attackers to bypass authentication and obtain sensitive information from the Oracle Applications Concurrent Manager by spoofing requests to the TNS Listener."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2003-1132",
        "datePublished": "2005-04-21T04:00:00Z",
        "description": {
            "lang": "en",
            "value": "The DNS server for Cisco Content Service Switch (CSS) 11000 and 11500, when prompted for a nonexistent AAAA record, responds with response code 3 (NXDOMAIN or \"Name Error\") instead of response code 0 (\"No Error\"), which allows remote attackers to cause a denial of service (inaccessible domain) by forcing other DNS servers to send and cache a request for a AAAA record to the vulnerable server."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-1354",
        "datePublished": "2007-10-14T19:00:00",
        "description": {
            "lang": "en",
            "value": "Multiple GameSpy 3D 2.62 compatible gaming servers generate very large UDP responses to small requests, which allows remote attackers to use the servers as an amplifier in DDoS attacks with spoofed UDP query packets, as demonstrated using Battlefield 1942."
        },
        "metrics": [],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2003-1377",
        "datePublished": "2007-10-19T10:00:00",
        "description": {
            "lang": "en",
            "value": "Buffer overflow in the reverse DNS lookup of Smart IRC Daemon (SIRCD) 0.4.0 and 0.4.4 allows remote attackers to execute arbitrary code via a client with a long hostname."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-1441",
        "datePublished": "2007-10-23T01:00:00",
        "description": {
            "lang": "en",
            "value": "Posadis 0.50.4 through 0.50.8 allows remote attackers to cause a denial of service (crash) via a DNS message without a question section, which triggers null dereference."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-1491",
        "datePublished": "2007-10-24T23:00:00",
        "description": {
            "lang": "en",
            "value": "Kerio Personal Firewall (KPF) 2.1.4 has a default rule to accept incoming packets from DNS (UDP port 53), which allows remote attackers to bypass the firewall filters via packets with a source port of 53."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-1577",
        "datePublished": "2010-02-05T22:13:00",
        "description": {
            "lang": "en",
            "value": "Sun ONE (aka iPlanet) Web Server 4.1 through SP12 and 6.0 through SP5, when DNS resolution is enabled for client IP addresses, allows remote attackers to inject arbitrary text into log files, and conduct cross-site scripting (XSS) attacks involving the iPlanet Log Analyzer, via an HTTP request in conjunction with a crafted DNS response, related to an \"Inverse Lookup Log Corruption (ILLC)\" issue, a different vulnerability than CVE-2002-1315 and CVE-2002-1316."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-1578",
        "datePublished": "2010-02-05T22:13:00",
        "description": {
            "lang": "en",
            "value": "Sun ONE (aka iPlanet) Web Server 4.1 through SP12 and 6.0 through SP5, when DNS resolution is enabled for client IP addresses, allows remote attackers to hide HTTP requests from the log-preview functionality by accompanying the requests with crafted DNS responses specifying a domain name beginning with a \"format=\" substring, related to an \"Inverse Lookup Log Corruption (ILLC)\" issue."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-1579",
        "datePublished": "2010-02-05T22:13:00Z",
        "description": {
            "lang": "en",
            "value": "Sun ONE (aka iPlanet) Web Server 6 on Windows, when DNS resolution is enabled for client IP addresses, uses a logging format that does not identify whether a dotted quad represents an unresolved IP address, which allows remote attackers to spoof IP addresses via crafted DNS responses containing numerical top-level domains, as demonstrated by a forged 123.123.123.123 domain name, related to an \"Inverse Lookup Log Corruption (ILLC)\" issue."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-1580",
        "datePublished": "2010-02-05T22:13:00Z",
        "description": {
            "lang": "en",
            "value": "The Apache HTTP Server 2.0.44, when DNS resolution is enabled for client IP addresses, uses a logging format that does not identify whether a dotted quad represents an unresolved IP address, which allows remote attackers to spoof IP addresses via crafted DNS responses containing numerical top-level domains, as demonstrated by a forged 123.123.123.123 domain name, related to an \"Inverse Lookup Log Corruption (ILLC)\" issue."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-1581",
        "datePublished": "2010-02-05T22:13:00Z",
        "description": {
            "lang": "en",
            "value": "The Apache HTTP Server 2.0.44, when DNS resolution is enabled for client IP addresses, allows remote attackers to inject arbitrary text into log files via an HTTP request in conjunction with a crafted DNS response, as demonstrated by injecting XSS sequences, related to an \"Inverse Lookup Log Corruption (ILLC)\" issue."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2003-1582",
        "datePublished": "2010-02-05T22:13:00Z",
        "description": {
            "lang": "en",
            "value": "Microsoft Internet Information Services (IIS) 6.0, when DNS resolution is enabled for client IP addresses, allows remote attackers to inject arbitrary text into log files via an HTTP request in conjunction with a crafted DNS response, as demonstrated by injecting XSS sequences, related to an \"Inverse Lookup Log Corruption (ILLC)\" issue."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    }
]