[
    {
        "cveId": "CVE-2005-0021",
        "datePublished": "2005-01-06T05:00:00",
        "description": {
            "lang": "en",
            "value": "Multiple buffer overflows in Exim before 4.43 may allow attackers to execute arbitrary code via (1) an IPv6 address with more than 8 components, as demonstrated using the -be command line option, which triggers an overflow in the host_aton function, or (2) the -bh command line option or dnsdb PTR lookup, which triggers an overflow in the dns_build_reverse function."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-0033",
        "datePublished": "2005-01-29T05:00:00",
        "description": {
            "lang": "en",
            "value": "Buffer overflow in the code for recursion and glue fetching in BIND 8.4.4 and 8.4.5 allows remote attackers to cause a denial of service (crash) via queries that trigger the overflow in the q_usedns array that tracks nameservers and addresses."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-0034",
        "datePublished": "2005-01-29T05:00:00",
        "description": {
            "lang": "en",
            "value": "An \"incorrect assumption\" in the authvalidated validator function in BIND 9.3.0, when DNSSEC is enabled, allows remote attackers to cause a denial of service (named server exit) via crafted DNS packets that cause an internal consistency test (self-check) to fail."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2005-0036",
        "datePublished": "2006-04-28T01:00:00",
        "description": {
            "lang": "en",
            "value": "The DNS implementation in DeleGate 8.10.2 and earlier allows remote attackers to cause a denial of service via a compressed DNS packet with a label length byte with an incorrect offset, which could trigger an infinite loop."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-0037",
        "datePublished": "2006-04-28T01:00:00",
        "description": {
            "lang": "en",
            "value": "The DNS implementation of DNRD before 2.10 allows remote attackers to cause a denial of service via a compressed DNS packet with a label length byte with an incorrect offset, which could trigger an infinite loop."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-0038",
        "datePublished": "2006-04-28T01:00:00",
        "description": {
            "lang": "en",
            "value": "The DNS implementation of PowerDNS 2.9.16 and earlier allows remote attackers to cause a denial of service via a compressed DNS packet with a label length byte with an incorrect offset, which could trigger an infinite loop."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-0054",
        "datePublished": "2005-02-08T05:00:00",
        "description": {
            "lang": "en",
            "value": "Internet Explorer 5.01, 5.5, and 6 allows remote attackers to spoof a less restrictive security zone and execute arbitrary code via an HTML page containing URLs that contain hostnames that have been double hex encoded, which are decoded twice to generate a malicious hostname, aka the \"URL Decoding Zone Spoofing Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-0205",
        "datePublished": "2005-02-28T05:00:00",
        "description": {
            "lang": "en",
            "value": "KPPP 2.1.2 in KDE 3.1.5 and earlier, when setuid root without certain wrappers, does not properly close a privileged file descriptor for a domain socket, which allows local users to read and write to /etc/hosts and /etc/resolv.conf and gain control over DNS name resolution by opening a number of file descriptors before executing kppp."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-0357",
        "datePublished": "2005-08-20T04:00:00",
        "description": {
            "lang": "en",
            "value": "EMC Legato NetWorker, Sun Solstice Backup 6.0 and 6.1, and StorEdge Enterprise Backup 7.0 through 7.2 rely on AUTH_UNIX authentication, which relies on user ID for authentication and allows remote attackers to bypass authentication and gain privileges by spoofing a username or UID."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-0401",
        "datePublished": "2005-03-24T05:00:00",
        "description": {
            "lang": "en",
            "value": "FireFox 1.0.1 and Mozilla before 1.7.6 do not sufficiently address all attack vectors for loading chrome files and hijacking drag and drop events, which allows remote attackers to execute arbitrary XUL code by tricking a user into dragging a scrollbar, a variant of CVE-2005-0527, aka \"Firescrolling 2.\""
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2005-0428",
        "datePublished": "2005-02-15T05:00:00",
        "description": {
            "lang": "en",
            "value": "The DNSPacket::expand method in dnspacket.cc in PowerDNS before 2.9.17 allows remote attackers to cause a denial of service by sending a random stream of bytes."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-0446",
        "datePublished": "2005-02-15T05:00:00",
        "description": {
            "lang": "en",
            "value": "Squid 2.5.STABLE8 and earlier allows remote attackers to cause a denial of service (crash) via certain DNS responses regarding (1) Fully Qualified Domain Names (FQDN) in fqdncache.c or (2) IP addresses in ipcache.c, which trigger an assertion failure."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-0499",
        "datePublished": "2005-02-21T05:00:00",
        "description": {
            "lang": "en",
            "value": "Gigafast router (aka CompUSA router) with the DNS proxy option enabled allows remote attackers to cause a denial of service via malformed DNS queries."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-0584",
        "datePublished": "2005-02-28T05:00:00",
        "description": {
            "lang": "en",
            "value": "Firefox before 1.0.1 and Mozilla before 1.7.6, when displaying the HTTP Authentication dialog, do not change the focus to the tab that generated the prompt, which could facilitate spoofing and phishing attacks."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-0591",
        "datePublished": "2005-02-28T05:00:00",
        "description": {
            "lang": "en",
            "value": "Firefox before 1.0.1 allows remote attackers to spoof the (1) security and (2) download modal dialog boxes, which could be used to trick users into executing script or downloading and executing a file, aka \"Firespoofing.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-0817",
        "datePublished": "2005-03-20T05:00:00",
        "description": {
            "lang": "en",
            "value": "Unknown vulnerability in the DNSd proxy, as used in Symantec Gateway Security 5400 2.x and 5300 1.x, Enterprise Firewall 7.0.x and 8.x, and VelociRaptor 1100/1200/1300 1.5, allows remote attackers to poison the DNS cache and redirect users to malicious sites."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-0830",
        "datePublished": "2005-03-22T05:00:00",
        "description": {
            "lang": "en",
            "value": "Multiple buffer overflows in Xzabite DYNDNSUpdate 0.6.15 and earlier, including the ipcheck function in dyndnsupdate.c, allow remote attackers who spoof a dyndns.org server to execute arbitrary code via unknown vectors."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-0876",
        "datePublished": "2005-03-26T05:00:00",
        "description": {
            "lang": "en",
            "value": "Off-by-one buffer overflow in Dnsmasq before 2.21 may allow attackers to execute arbitrary code via the DHCP lease file."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-0877",
        "datePublished": "2005-03-26T05:00:00",
        "description": {
            "lang": "en",
            "value": "Dnsmasq before 2.21 allows remote attackers to poison the DNS cache via answers to queries that were not made by Dnsmasq."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-1519",
        "datePublished": "2005-05-11T04:00:00",
        "description": {
            "lang": "en",
            "value": "Squid 2.5 STABLE9 and earlier, when the DNS client port is unfiltered and the environment does not prevent IP spoofing, allows remote attackers to spoof DNS lookups."
        },
        "metrics": [],
        "tags": [
            "dns",
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-1794",
        "datePublished": "2005-06-01T04:00:00",
        "description": {
            "lang": "en",
            "value": "Microsoft Terminal Server using Remote Desktop Protocol (RDP) 5.2 stores an RSA private key in mstlsapi.dll and uses it to sign a certificate, which allows remote attackers to spoof public keys of legitimate servers and conduct man-in-the-middle attacks."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2005-1932",
        "datePublished": "2005-06-30T04:00:00Z",
        "description": {
            "lang": "en",
            "value": "Lpanel 1.59 and earlier, and other versions before 1.597, allows remote authenticated users to modify certain critical variables and (1) modify DNS settings for arbitrary domains via the domain parameter to diagnose.php, (2) close, open, or respond to arbitrary support tickets via the close, open, or pid parameter to view_ticket.php, (3) obtain sensitive information on arbitrary invoices via the inv parameter to viewreceipt.php, or (4) modify domain information for arbitrary domains via the editdomain parameter to domains.php."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-1937",
        "datePublished": "2005-06-13T04:00:00",
        "description": {
            "lang": "en",
            "value": "A regression error in Firefox 1.0.3 and Mozilla 1.7.7 allows remote attackers to inject arbitrary Javascript from one page into the frameset of another site, aka the frame injection spoofing vulnerability, a re-introduction of a vulnerability that was originally identified and addressed by CVE-2004-0718."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-1982",
        "datePublished": "2005-08-10T04:00:00",
        "description": {
            "lang": "en",
            "value": "Unknown vulnerability in the PKINIT Protocol for Microsoft Windows 2000, Windows XP, and Windows Server 2003 could allow a local user to obtain information and spoof a server via a man-in-the-middle (MITM) attack between a client and a domain controller when PKINIT smart card authentication is being used."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2005-2151",
        "datePublished": "2005-07-06T04:00:00",
        "description": {
            "lang": "en",
            "value": "spf.c in Courier Mail Server does not properly handle DNS failures when looking up Sender Policy Framework (SPF) records, which could allow attackers to cause memory corruption."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-2159",
        "datePublished": "2005-07-06T04:00:00",
        "description": {
            "lang": "en",
            "value": "mshftp.dll in PlanetDNS PlanetFileServer 2.0.1.3 allows remote attackers to cause a denial of service (application crash) via a long request."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-2268",
        "datePublished": "2005-07-13T04:00:00",
        "description": {
            "lang": "en",
            "value": "Firefox before 1.0.5 and Mozilla before 1.7.9 does not clearly associate a Javascript dialog box with the web page that generated it, which allows remote attackers to spoof a dialog box from a trusted site and facilitates phishing attacks, aka the \"Dialog Origin Spoofing Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-2269",
        "datePublished": "2005-07-13T04:00:00",
        "description": {
            "lang": "en",
            "value": "Firefox before 1.0.5, Mozilla before 1.7.9, and Netscape 8.0.2 does not properly verify the associated types of DOM node names within the context of their namespaces, which allows remote attackers to modify certain tag properties, possibly leading to execution of arbitrary script or code, as demonstrated using an XHTML document with IMG tags with custom properties (\"XHTML node spoofing\")."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-2271",
        "datePublished": "2005-07-13T04:00:00Z",
        "description": {
            "lang": "en",
            "value": "iCab 2.9.8 does not clearly associate a Javascript dialog box with the web page that generated it, which allows remote attackers to spoof a dialog box from a trusted site and facilitates phishing attacks, aka the \"Dialog Origin Spoofing Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-2272",
        "datePublished": "2005-07-13T04:00:00",
        "description": {
            "lang": "en",
            "value": "Safari version 2.0 (412) does not clearly associate a Javascript dialog box with the web page that generated it, which allows remote attackers to spoof a dialog box from a trusted site and facilitates phishing attacks, aka the \"Dialog Origin Spoofing Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-2273",
        "datePublished": "2005-07-13T04:00:00",
        "description": {
            "lang": "en",
            "value": "Opera 7.x and 8 before 8.01 does not clearly associate a Javascript dialog box with the web page that generated it, which allows remote attackers to spoof a dialog box from a trusted site and facilitates phishing attacks, aka the \"Dialog Origin Spoofing Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-2274",
        "datePublished": "2005-07-13T04:00:00Z",
        "description": {
            "lang": "en",
            "value": "Microsoft Internet Explorer 6.0 does not clearly associate a Javascript dialog box with the web page that generated it, which allows remote attackers to spoof a dialog box from a trusted site and facilitates phishing attacks, aka the \"Dialog Origin Spoofing Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-2301",
        "datePublished": "2005-07-19T04:00:00",
        "description": {
            "lang": "en",
            "value": "PowerDNS before 2.9.18, when running with an LDAP backend, does not properly escape LDAP queries, which allows remote attackers to cause a denial of service (failure to answer ldap questions) and possibly conduct an LDAP injection attack."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-2302",
        "datePublished": "2005-07-19T04:00:00",
        "description": {
            "lang": "en",
            "value": "PowerDNS before 2.9.18, when allowing recursion to a restricted range of IP addresses, does not properly handle questions from clients that are denied recursion, which could cause a \"blank out\" of answers to those clients that are allowed to use recursion."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-2315",
        "datePublished": "2006-04-28T10:00:00",
        "description": {
            "lang": "en",
            "value": "Buffer overflow in Domain Name Relay Daemon (DNRD) before 2.19.1 allows remote attackers to execute arbitrary code via a large number of large DNS packets with the Z and QR flags cleared."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-2316",
        "datePublished": "2006-04-28T10:00:00Z",
        "description": {
            "lang": "en",
            "value": "Domain Name Relay Daemon (DNRD) before 2.19.1 allows remote attackers to cause a denial of service (infinite recursion) via a DNS packet that uses message compression in the QNAME and two pointers that point to each other (circular buffer)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-2387",
        "datePublished": "2005-07-27T04:00:00",
        "description": {
            "lang": "en",
            "value": "Multiple stack-based buffer overflows in GoodTech SMTP server 5.16 allow remote attackers to execute arbitrary code via (1) a RCPT TO command with a long DNS name, or (2) a large number of RCPT TO commands with a long e-mail name arugment in the last command."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-2407",
        "datePublished": "2005-07-28T04:00:00",
        "description": {
            "lang": "en",
            "value": "A design error in Opera 8.01 and earlier allows user-assisted attackers to execute arbitrary code by overlaying a malicious new window above a file download dialog box, then tricking the user into double-clicking on the \"Run\" button, aka \"link hijacking\"."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2005-2609",
        "datePublished": "2005-08-17T04:00:00",
        "description": {
            "lang": "en",
            "value": "index.php in VegaDNS 0.8.1, 0.9.8, and possibly other versions, allows remote attackers to obtain the full server path via an invalid VDNS_Sessid parameter."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-2610",
        "datePublished": "2005-08-17T04:00:00",
        "description": {
            "lang": "en",
            "value": "Cross-site scripting (XSS) vulnerability in index.php in VegaDNS 0.8.1, 0.9.8, and possibly other versions, allows remote attackers to inject arbitrary web script or HTML via the message parameter."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-2707",
        "datePublished": "2005-09-23T04:00:00",
        "description": {
            "lang": "en",
            "value": "Firefox before 1.0.7 and Mozilla Suite before 1.7.12 allows remote attackers to spawn windows without user interface components such as the address and status bar, which could be used to conduct spoofing or phishing attacks."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-2777",
        "datePublished": "2005-09-02T04:00:00",
        "description": {
            "lang": "en",
            "value": "Looking Glass 20040427 allows remote attackers to execute arbitrary commands via shell metacharacters in the DNS lookup query field."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-2779",
        "datePublished": "2005-09-02T04:00:00",
        "description": {
            "lang": "en",
            "value": "The iTAN Online-Banking Security System allows remote attackers to obtain TAN numbers via a man-in-the-middle (MITM) attack while the transaction is taking place, which facilitates a \"phishing\" attack."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2005-2969",
        "datePublished": "2005-10-18T04:00:00",
        "description": {
            "lang": "en",
            "value": "The SSL/TLS server implementation in OpenSSL 0.9.7 before 0.9.7h and 0.9.8 before 0.9.8a, when using the SSL_OP_MSIE_SSLV2_RSA_PADDING option, disables a verification step that is required for preventing protocol version rollback attacks, which allows remote attackers to force a client and server to use a weaker protocol than needed via a man-in-the-middle attack."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2005-3042",
        "datePublished": "2005-09-22T04:00:00",
        "description": {
            "lang": "en",
            "value": "miniserv.pl in Webmin before 1.230 and Usermin before 1.160, when \"full PAM conversations\" is enabled, allows remote attackers to bypass authentication by spoofing session IDs via certain metacharacters (line feed or carriage return)."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-3341",
        "datePublished": "2005-12-27T23:00:00",
        "description": {
            "lang": "en",
            "value": "DHIS tools DNS package (dhis-tools-dns) before 5.0 allows local users to overwrite arbitrary files via a symlink attack on temporary files created by (1) register-q.sh and (2) register-p.sh."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-3402",
        "datePublished": "2005-11-01T11:00:00",
        "description": {
            "lang": "en",
            "value": "The SMTP client in Mozilla Thunderbird 1.0.5 BETA, 1.0.7, and possibly other versions, does not notify users when it cannot establish a secure channel with the server, which allows remote attackers to obtain authentication information without detection via a man-in-the-middle (MITM) attack that bypasses TLS authentication or downgrades CRAM-MD5 authentication to plain authentication."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2005-3725",
        "datePublished": "2005-11-21T11:00:00",
        "description": {
            "lang": "en",
            "value": "Zyxel P2000W Version 1 VOIP WIFI Phone Wj.00.10 uses hardcoded IP addresses for its DNS servers, which could allow remote attackers to cause a denial of service or hijack Zyxel phones by attacking or spoofing the hardcoded DNS servers.  NOTE: it could be argued that this issue reflects an inherent limitation of DNS itself, so perhaps it should not be included in CVE."
        },
        "metrics": [],
        "tags": [
            "dns",
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-3899",
        "datePublished": "2005-11-29T21:00:00",
        "description": {
            "lang": "en",
            "value": "The automatic update feature in Google Talk allows remote attackers to cause a denial of service (CPU and memory consumption) by poisoning a target's DNS cache and causing a large update file to be sent, which consumes large amounts of CPU and memory during the signature verification, aka BenjiBug."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-4046",
        "datePublished": "2005-12-07T11:00:00",
        "description": {
            "lang": "en",
            "value": "Unspecified vulnerability in Reverse SSL Proxy Plug-in for Sun Java System Application Server Standard Edition 7 2004Q2, Application Server Enterprise Edition 8.1 2005Q1, and Sun ONE Application Server 7 Standard Edition, as used in multiple web servers, allows remote attackers to conduct man-in-the-middle (MITM) attacks and \"compromise data privacy.\""
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2005-4441",
        "datePublished": "2005-12-21T02:00:00",
        "description": {
            "lang": "en",
            "value": "The PVLAN protocol allows remote attackers to bypass network segmentation and spoof PVLAN traffic via a PVLAN message with a target MAC address that is set to a gateway router, which causes the packet to be sent to the router, where the source MAC is modified, aka \"Modification of the MAC spoofing PVLAN jumping attack,\" as demonstrated by pvlan.c."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-4582",
        "datePublished": "2005-12-29T11:00:00",
        "description": {
            "lang": "en",
            "value": "Electric Sheep 2.6.3 does not require authentication or integrity checks from the server to the client, which allows remote attackers to download and display arbitrary MPEG movie files via (1) DNS spoofing, (2) a URL on the command line, or (3) a URL in the configuration file. NOTE: the same attack vectors apply to common web browsers that are able to communicate with untrusted web servers, and other problems related to DNS design issues.  Therefore this may not be a specific vulnerability.  However, a client would reasonably expect to receive content only from the server."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dns spoofing",
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-4684",
        "datePublished": "2006-02-01T02:00:00",
        "description": {
            "lang": "en",
            "value": "Konqueror can associate a cookie with multiple domains when the DNS resolver has a non-root domain in its search list, which allows remote attackers to trick a user into accepting a cookie for a hostname formed via search-list expansion of the hostname entered by the user, or steal a cookie for an expanded hostname, as demonstrated by an attacker who operates an ap1.com Internet web site to steal cookies associated with an ap1.com.example.com intranet web site."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-4685",
        "datePublished": "2006-02-01T02:00:00",
        "description": {
            "lang": "en",
            "value": "Firefox and Mozilla can associate a cookie with multiple domains when the DNS resolver has a non-root domain in its search list, which allows remote attackers to trick a user into accepting a cookie for a hostname formed via search-list expansion of the hostname entered by the user, or steal a cookie for an expanded hostname, as demonstrated by an attacker who operates an ap1.com Internet web site to steal cookies associated with an ap1.com.example.com intranet web site."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-4794",
        "datePublished": "2006-05-02T18:00:00",
        "description": {
            "lang": "en",
            "value": "Cisco IP Phones 7902/7905/7912, ATA 186/188, Unity Express, ACNS, and Subscriber Edge Services Manager (SESM) allows remote attackers to cause a denial of service (crash or instability) via a compressed DNS packet with a label length byte with an incorrect offset."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2005-4827",
        "datePublished": "2007-02-07T20:00:00",
        "description": {
            "lang": "en",
            "value": "Internet Explorer 6.0, and possibly other versions, allows remote attackers to bypass the same origin security policy and make requests outside of the intended domain by calling open on an XMLHttpRequest object (Microsoft.XMLHTTP) and using tab, newline, and carriage return characters within the first argument (method name), which is supported by some proxy servers that convert tabs to spaces.  NOTE: this issue can be leveraged to conduct referer spoofing, HTTP Request Smuggling, and other attacks."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2005-4890",
        "datePublished": "2019-11-04T18:38:09",
        "description": {
            "lang": "en",
            "value": "There is a possible tty hijacking in shadow 4.x before 4.1.5 and sudo 1.x before 1.7.4 via \"su - user -c program\". The user session can be escaped to the parent session by using the TIOCSTI ioctl to push characters into the input buffer to be read by the next process."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2005-4900",
        "datePublished": "2016-10-14T16:00:00",
        "description": {
            "lang": "en",
            "value": "SHA-1 is not collision resistant, which makes it easier for context-dependent attackers to conduct spoofing attacks, as demonstrated by attacks on the use of SHA-1 in TLS 1.2.  NOTE: this CVE exists to provide a common identifier for referencing this SHA-1 issue; the existence of an identifier is not, by itself, a technology recommendation."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    }
]