[
    {
        "cveId": "CVE-2016-0029",
        "datePublished": "2016-01-13T02:00:00",
        "description": {
            "lang": "en",
            "value": "Cross-site scripting (XSS) vulnerability in Outlook Web Access (OWA) in Microsoft Exchange Server 2016 allows remote attackers to inject arbitrary web script or HTML via a crafted URL, aka \"Exchange Spoofing Vulnerability,\" a different vulnerability than CVE-2016-0031."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-0030",
        "datePublished": "2016-01-13T02:00:00",
        "description": {
            "lang": "en",
            "value": "Cross-site scripting (XSS) vulnerability in Outlook Web Access (OWA) in Microsoft Exchange Server 2013 PS1, 2013 Cumulative Update 10, and 2016 allows remote attackers to inject arbitrary web script or HTML via a crafted URL, aka \"Exchange Spoofing Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-0031",
        "datePublished": "2016-01-13T02:00:00",
        "description": {
            "lang": "en",
            "value": "Cross-site scripting (XSS) vulnerability in Outlook Web Access (OWA) in Microsoft Exchange Server 2016 allows remote attackers to inject arbitrary web script or HTML via a crafted URL, aka \"Exchange Spoofing Vulnerability,\" a different vulnerability than CVE-2016-0029."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-0032",
        "datePublished": "2016-01-13T02:00:00",
        "description": {
            "lang": "en",
            "value": "Cross-site scripting (XSS) vulnerability in Outlook Web Access (OWA) in Microsoft Exchange Server 2013 PS1, 2013 Cumulative Update 10, 2013 Cumulative Update 11, and 2016 allows remote attackers to inject arbitrary web script or HTML via a crafted URL, aka \"Exchange Spoofing Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-0077",
        "datePublished": "2016-02-10T11:00:00",
        "description": {
            "lang": "en",
            "value": "Microsoft Internet Explorer 9 through 11 and Microsoft Edge misparse HTTP responses, which allows remote attackers to spoof web sites via a crafted URL, aka \"Microsoft Browser Spoofing Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-0128",
        "datePublished": "2016-04-12T23:00:00",
        "description": {
            "lang": "en",
            "value": "The SAM and LSAD protocol implementations in Microsoft Windows Vista SP2, Windows Server 2008 SP2 and R2 SP1, Windows 7 SP1, Windows 8.1, Windows Server 2012 Gold and R2, Windows RT 8.1, and Windows 10 Gold and 1511 do not properly establish an RPC channel, which allows man-in-the-middle attackers to perform protocol-downgrade attacks and impersonate users by modifying the client-server data stream, aka \"Windows SAM and LSAD Downgrade Vulnerability\" or \"BADLOCK.\""
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-0149",
        "datePublished": "2016-05-11T01:00:00",
        "description": {
            "lang": "en",
            "value": "Microsoft .NET Framework 2.0 SP2, 3.0 SP2, 3.5, 3.5.1, 4.5.2, 4.6, and 4.6.1 allows man-in-the-middle attackers to obtain sensitive cleartext information via vectors involving injection of cleartext data into the client-server data stream, aka \"TLS/SSL Information Disclosure Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-0248",
        "datePublished": "2016-09-26T01:00:00",
        "description": {
            "lang": "en",
            "value": "IBM Security Guardium 9.0 before p700 and 10.0 before p100 allows man-in-the-middle attackers to obtain sensitive query-string information from SSL sessions via unspecified vectors."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-0266",
        "datePublished": "2016-08-08T01:00:00",
        "description": {
            "lang": "en",
            "value": "IBM AIX 5.3, 6.1, 7.1, and 7.2 and VIOS 2.2.x do not default to the latest TLS version, which makes it easier for man-in-the-middle attackers to obtain sensitive information via unspecified vectors."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-0306",
        "datePublished": "2016-05-17T14:00:00",
        "description": {
            "lang": "en",
            "value": "IBM WebSphere Application Server (WAS) 7.0 before 7.0.0.41, 8.0 before 8.0.0.13, and 8.5 before 8.5.5.10, when FIPS 140-2 is enabled, misconfigures TLS, which allows man-in-the-middle attackers to obtain sensitive information via unspecified vectors."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-0398",
        "datePublished": "2016-07-02T14:00:00",
        "description": {
            "lang": "en",
            "value": "IBM Cognos Analytics (CA) 11.0 before 11.0.2 allows remote attackers to conduct content-spoofing attacks via a crafted URL."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-0703",
        "datePublished": "2016-03-02T00:00:00",
        "description": {
            "lang": "en",
            "value": "The get_client_master_key function in s2_srvr.c in the SSLv2 implementation in OpenSSL before 0.9.8zf, 1.0.0 before 1.0.0r, 1.0.1 before 1.0.1m, and 1.0.2 before 1.0.2a accepts a nonzero CLIENT-MASTER-KEY CLEAR-KEY-LENGTH value for an arbitrary cipher, which allows man-in-the-middle attackers to determine the MASTER-KEY value and decrypt TLS ciphertext data by leveraging a Bleichenbacher RSA padding oracle, a related issue to CVE-2016-0800."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-0713",
        "datePublished": "2017-08-31T14:00:00",
        "description": {
            "lang": "en",
            "value": "Gorouter in Cloud Foundry cf-release v141 through v228 allows man-in-the-middle attackers to conduct cross-site scripting (XSS) attacks via vectors related to modified requests."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-0739",
        "datePublished": "2016-04-13T17:00:00",
        "description": {
            "lang": "en",
            "value": "libssh before 0.7.3 improperly truncates ephemeral secrets generated for the (1) diffie-hellman-group1 and (2) diffie-hellman-group14 key exchange methods to 128 bits, which makes it easier for man-in-the-middle attackers to decrypt or intercept SSH sessions via unspecified vectors, aka a \"bits/bytes confusion bug.\""
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-0742",
        "datePublished": "2016-02-15T19:00:00",
        "description": {
            "lang": "en",
            "value": "The resolver in nginx before 1.8.1 and 1.9.x before 1.9.10 allows remote attackers to cause a denial of service (invalid pointer dereference and worker process crash) via a crafted UDP DNS response."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-0746",
        "datePublished": "2016-02-15T19:00:00",
        "description": {
            "lang": "en",
            "value": "Use-after-free vulnerability in the resolver in nginx 0.6.18 through 1.8.0 and 1.9.x before 1.9.10 allows remote attackers to cause a denial of service (worker process crash) or possibly have unspecified other impact via a crafted DNS response related to CNAME response processing."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-0771",
        "datePublished": "2016-03-13T22:00:00",
        "description": {
            "lang": "en",
            "value": "The internal DNS server in Samba 4.x before 4.1.23, 4.2.x before 4.2.9, 4.3.x before 4.3.6, and 4.4.x before 4.4.0rc4, when an AD DC is configured, allows remote authenticated users to cause a denial of service (out-of-bounds read) or possibly obtain sensitive information from process memory by uploading a crafted DNS TXT record."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-0772",
        "datePublished": "2016-09-02T14:00:00",
        "description": {
            "lang": "en",
            "value": "The smtplib library in CPython (aka Python) before 2.7.12, 3.x before 3.4.5, and 3.5.x before 3.5.2 does not return an error when StartTLS fails, which might allow man-in-the-middle attackers to bypass the TLS protections by leveraging a network position between the client and the registry to block the StartTLS command, aka a \"StartTLS stripping attack.\""
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-0787",
        "datePublished": "2016-04-13T17:00:00",
        "description": {
            "lang": "en",
            "value": "The diffie_hellman_sha256 function in kex.c in libssh2 before 1.7.0 improperly truncates secrets to 128 or 256 bits, which makes it easier for man-in-the-middle attackers to decrypt or intercept SSH sessions via unspecified vectors, aka a \"bits/bytes confusion bug.\""
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-0818",
        "datePublished": "2016-03-12T21:00:00",
        "description": {
            "lang": "en",
            "value": "The caching functionality in the TrustManagerImpl class in TrustManagerImpl.java in Conscrypt in Android 4.x before 4.4.4, 5.x before 5.1.1 LMY49H, and 6.x before 2016-03-01 mishandles the distinction between an intermediate CA and a trusted root CA, which allows man-in-the-middle attackers to spoof servers by leveraging access to an intermediate CA to issue a certificate, aka internal bug 26232830."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-0907",
        "datePublished": "2016-05-30T01:00:00",
        "description": {
            "lang": "en",
            "value": "EMC Isilon OneFS 7.1.x and 7.2.x before 7.2.1.3 and 8.0.x before 8.0.0.1, and IsilonSD Edge OneFS 8.0.x before 8.0.0.1, does not require SMB signing within a DCERPC session over ncacn_np, which allows man-in-the-middle attackers to spoof SMB clients by modifying the client-server data stream, a similar issue to CVE-2016-2115."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-10027",
        "datePublished": "2017-01-12T23:00:00",
        "description": {
            "lang": "en",
            "value": "Race condition in the XMPP library in Smack before 4.1.9, when the SecurityMode.required TLS setting has been set, allows man-in-the-middle attackers to bypass TLS protections and trigger use of cleartext for client authentication by stripping the \"starttls\" feature from a server response."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-10125",
        "datePublished": "2017-01-09T17:00:00",
        "description": {
            "lang": "en",
            "value": "D-Link DGS-1100 devices with Rev.B firmware 1.01.018 have a hardcoded SSL private key, which allows man-in-the-middle attackers to spoof devices by hijacking an HTTPS session."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-10130",
        "datePublished": "2017-03-24T15:00:00",
        "description": {
            "lang": "en",
            "value": "The http_connect function in transports/http.c in libgit2 before 0.24.6 and 0.25.x before 0.25.1 might allow man-in-the-middle attackers to spoof servers by leveraging clobbering of the error variable."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-10138",
        "datePublished": "2017-01-13T09:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on BLU Advance 5.0 and BLU R1 HD devices with Shanghai Adups software. The com.adups.fota.sysoper app is installed as a system app and cannot be disabled by the user. In the com.adups.fota.sysoper app's AndroidManifest.xml file, it sets the android:sharedUserId attribute to a value of android.uid.system which makes it execute as the system user, which is a very privileged user on the device. The app has an exported broadcast receiver named com.adups.fota.sysoper.WriteCommandReceiver which any app on the device can interact with. Therefore, any app can send a command embedded in an intent which will be executed by the WriteCommandReceiver component which is executing as the system user. The third-party app, utilizing the WriteCommandReceiver, can perform the following actions: call a phone number, factory reset the device, take pictures of the screen, record the screen in a video, install applications, inject events, obtain the Android log, and others. In addition, the com.adups.fota.sysoper.TaskService component will make a request to a URL of http://rebootv5.adsunflower.com/ps/fetch.do where the commands in the String array with a key of sf in the JSON Object sent back by the server will be executed as the system user. Since the connection is made via HTTP, it is vulnerable to a MITM attack."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10152",
        "datePublished": "2017-03-28T14:00:00",
        "description": {
            "lang": "en",
            "value": "The read_config_file function in lib/hesiod.c in Hesiod 3.2.1 falls back to the \".athena.mit.edu\" default domain when opening the configuration file fails, which allows remote attackers to gain root privileges by poisoning the DNS cache."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-10157",
        "datePublished": "2017-01-23T06:49:00",
        "description": {
            "lang": "en",
            "value": "Akamai NetSession 1.9.3.1 is vulnerable to DLL Hijacking: it tries to load CSUNSAPI.dll without supplying the complete path. The issue is aggravated because the mentioned DLL is missing from the installation, thus making it possible to hijack the DLL and subsequently inject code within the Akamai NetSession process space."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-10195",
        "datePublished": "2017-03-15T15:00:00",
        "description": {
            "lang": "en",
            "value": "The name_parse function in evdns.c in libevent before 2.1.6-beta allows remote attackers to have unspecified impact via vectors involving the label_len variable, which triggers an out-of-bounds stack read."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-10197",
        "datePublished": "2017-03-15T15:00:00",
        "description": {
            "lang": "en",
            "value": "The search_make_new function in evdns.c in libevent before 2.1.6-beta allows attackers to cause a denial of service (out-of-bounds read) via an empty hostname."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-10503",
        "datePublished": "2017-08-29T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "IBM Sametime Meeting Server 8.5.2 and 9.0 could allow an authenticated and invited user of Sametime meeting to lower any or all hands in an e-meeting, thus spoofing results of votes in the meeting. IBM X-Force ID: 113803."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-10511",
        "datePublished": "2017-09-18T21:00:00",
        "description": {
            "lang": "en",
            "value": "The Twitter iOS client versions 6.62 and 6.62.1 fail to validate Twitter's server certificates for the /1.1/help/settings.json configuration endpoint, permitting man-in-the-middle attackers the ability to view an application-only OAuth client token and potentially enable unreleased Twitter iOS app features."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-10557",
        "datePublished": "2018-05-31T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "appium-chromedriver is a Node.js wrapper around Chromedriver. Versions below 2.9.4 download binary resources over HTTP, which leaves the module vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10558",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "aerospike is an Aerospike add-on module for Node.js. aerospike versions below 2.4.2 download binary resources over HTTP, which leaves the module vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10559",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "selenium-download downloads the latest versions of the selenium standalone server and the chromedriver. selenium-download before 2.0.7 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10560",
        "datePublished": "2018-05-31T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "galenframework-cli is the node wrapper for the Galen Framework. galenframework-cli below 2.3.1 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10562",
        "datePublished": "2018-05-31T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "iedriver is an NPM wrapper for Selenium IEDriver. iedriver versions below 3.0.0 download binary resources over HTTP, which leaves the module vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10563",
        "datePublished": "2018-05-31T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "During the installation process, the go-ipfs-deps module before 0.4.4 insecurely downloads resources over HTTP. This allows for a MITM attack to compromise the integrity of the resources used by this module and could allow for further compromise."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10564",
        "datePublished": "2018-05-31T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "apk-parser is a tool to extract Android Manifest info from an APK file. apk-parser versions below 0.1.6 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10565",
        "datePublished": "2018-05-31T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "operadriver is a Opera Driver for Selenium. operadriver versions below 0.2.3 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10566",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "install-nw is a module which quickly and robustly installs and caches NW.js. install-nw versions below 1.1.5 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10567",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "product-monitor is a HTML/JavaScript template for monitoring a product by encouraging product developers to gather all the information about the status of a product, including live monitoring, statistics, endpoints, and test results into one place. product-monitor versions below 2.2.5 download JavaScript resources over HTTP, which leaves the module vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested JavaScript file with an attacker controlled JavaScript file if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10568",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "geoip-lite-country is a stripped down version of geoip-lite, supporting only country lookup. geoip-lite-country before 1.1.4 downloads data resources over HTTP, which leaves it vulnerable to MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10569",
        "datePublished": "2018-05-31T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "embedza is a module to create HTML snippets/embeds from URLs using info from oEmbed, Open Graph, meta tags. embedza versions below 1.2.4 download JavaScript resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested JavaScript file with an attacker controlled JavaScript file if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10570",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "pngcrush-installer is an installer for Pngcrush. pngcrush-installer versions below 1.8.10 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10571",
        "datePublished": "2018-05-31T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "bkjs-wand is imagemagick wand support for node.js and backendjs bkjs-wand versions lower than 0.3.2 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10572",
        "datePublished": "2018-05-31T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "mongodb-instance before 0.0.3 installs mongodb locally. mongodb-instance downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10573",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "baryton-saxophone is a module to install and launch Selenium Server for Mac, Linux and Windows. baryton-saxophone versions below 3.0.1 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10574",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "apk-parser3 is a module to extract Android Manifest info from an APK file. apk-parser3 versions before 0.1.3 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10575",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "Kindlegen is a simple Node.js wrapper of the official kindlegen program. Kindlegen versions before 1.1.0 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10576",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "Fuseki server wrapper and management API in fuseki before 1.0.1 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10577",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "ibm_db is an asynchronous/synchronous interface for node.js to IBM DB2 and IBM Informix. ibm_db before 1.0.2 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10578",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "unicode loads unicode data downloaded from unicode.org into nodejs. Unicode before 9.0.0 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10579",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "Chromedriver is an NPM wrapper for selenium ChromeDriver. Chromedriver before 2.26.1 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10580",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "nodewebkit is an installer for node-webkit. nodewebkit downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested zip file with an attacker controlled zip file if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10581",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "Steroids is PhoneGap on Steroids, providing native UI elements, multiple WebViews and enhancements for better developer productivity. steroids downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested tarball with an attacker controlled tarball if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10582",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "closurecompiler is a Closure Compiler for node.js. closurecompiler downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10583",
        "datePublished": "2018-06-01T18:00:00",
        "description": {
            "lang": "en",
            "value": "closure-utils is Utilities for Closure Library based projects. closure-utils downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10584",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "dalek-browser-chrome-canary provides Google Chrome bindings for DalekJS. dalek-browser-chrome-canary downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10585",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "libxl provides Node bindings for the libxl library for reading and writing excel (XLS and XLSX) spreadsheets. libxl downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested zip file with an attacker controlled zip file if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10586",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "macaca-chromedriver is a Node.js wrapper for the selenium chromedriver. macaca-chromedriver before 1.0.29 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10587",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "wasdk is a toolkit for creating WebAssembly modules. wasdk downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10589",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "selenium-binaries downloads Selenium related binaries for your OS. selenium-binaries downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10590",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "cue-sdk-node is a Corsair Cue SDK wrapper for node.js. cue-sdk-node downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested zip file with an attacker controlled zip file if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10591",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "Prince is a Node API for executing XML/HTML to PDF renderer PrinceXML via prince(1) CLI. prince downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested tarball with an attacker controlled tarball if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10592",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "jser-stat is a JSer.info stat library. jser-stat downloads data resources over HTTP, which leaves it vulnerable to MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10593",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "ibapi is an Interactive Brokers API addon for NodeJS. ibapi downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. Before 2.5.6, it may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10594",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "ipip is a Node.js module to query geolocation information for an IP or domain, based on database by ipip.net. ipip downloads data resources over HTTP, which leaves it vulnerable to MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10595",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "jdf-sass is a fork from node-sass, jdf use only. jdf-sass downloads executable resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested file with an attacker controlled file if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10596",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "imageoptim is a Node.js wrapper for some images compression algorithms. imageoptim downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested tarball with an attacker controlled tarball if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10597",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "cobalt-cli downloads resources over HTTP, which leaves it vulnerable to MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10598",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "arrayfire-js is a module for ArrayFire for the Node.js platform. arrayfire-js downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10599",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "sauce-connect is a Node.js wrapper over the SauceLabs SauceConnect.jar program for establishing a secure tunnel for intranet testing. sauce-connect downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10600",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "webrtc-native uses WebRTC from chromium project. webrtc-native downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10601",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "webdrvr is a npm wrapper for Selenium Webdriver including Chromedriver / IEDriver / IOSDriver / Ghostdriver. webdrvr downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10602",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "haxe is a cross-platform toolkit haxe downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested zip file with an attacker controlled zip file if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10603",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "air-sdk is a NPM wrapper for the Adobe AIR SDK. air-sdk downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10604",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "dalek-browser-chrome is Google Chrome bindings for DalekJS. dalek-browser-chrome downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10605",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "dalek-browser-ie is Internet Explorer bindings for DalekJS. dalek-browser-ie downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10606",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "grunt-webdriver-qunit is a grunt plugin to run qunit with webdriver in grunt grunt-webdriver-qunit downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10607",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "openframe-glsviewer is a Openframe extension which adds support for shaders via glslViewer. openframe-glsviewer downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10608",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "robot-js is a module for native system automation for node.js. robot-js downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10609",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "chromedriver126 is chromedriver version 1.26 for linux OS. chromedriver126 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10610",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "unicode-json is a unicode lookup table. unicode-json before 2.0.0 downloads data resources over HTTP, which leaves it vulnerable to MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10611",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "strider-sauce is Sauce Labs / Selenium support for Strider. strider-sauce downloads zipped resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested zip file with an attacker controlled zip file if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10612",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "dalek-browser-ie-canary is Internet Explorer bindings for DalekJS. dalek-browser-ie-canary downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10613",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "bionode-sra is a Node.js wrapper for SRA Toolkit. bionode-sra downloads data resources over HTTP, which leaves it vulnerable to MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10614",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "httpsync is a port of libcurl to node.js. httpsync downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10615",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "curses is bindings for the native curses library, a full featured console IO library. curses downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10616",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "openframe-image is an Openframe extension which adds support for images via fbi. openframe-image downloads data resources over HTTP, which leaves it vulnerable to MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10617",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "box2d-native downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10618",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "node-browser is a wrapper webdriver by nodejs. node-browser downloads resources over HTTP, which leaves it vulnerable to MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10619",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "pennyworth is a natural language templating engine. pennyworth downloads data resources over HTTP, which leaves it vulnerable to MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10620",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "atom-node-module-installer installs node modules for atom-shell applications. atom-node-module-installer binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10621",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "fibjs is a runtime for javascript applictions built on google v8 JS. fibjs downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10622",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "nodeschnaps is a NodeJS compatibility layer for Java (Rhino). nodeschnaps downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10623",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "macaca-chromedriver-zxa is a Node.js wrapper for the selenium chromedriver. macaca-chromedriver-zxa downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10624",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "selenium-chromedriver is a simple utility for downloading the Selenium Webdriver for Google Chrome selenium-chromedriver downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10625",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "headless-browser-lite is a minimal npm installer for phantomjs and slimerjs with no external dependencies. headless-browser-lite downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10626",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "mystem3 is a NodeJS wrapper for the Yandex MyStem 3. mystem3 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10627",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "scala-bin is a binary wrapper for Scala. scala-bin downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10628",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "selenium-wrapper is a selenium server wrapper, including installation and chrome webdriver. selenium-wrapper downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10629",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "nw-with-arm is a NW Installer including ARM-Build. nw-with-arm downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10630",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "install-g-test downloads resources over HTTP, which leaves it vulnerable to MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10631",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "jvminstall is a module for downloading and unpacking jvm to local system. jvminstall downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10632",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "apk-parser2 is a module which extracts Android Manifest info from an APK file. apk-parser2 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10633",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "dwebp-bin is a dwebp node.js wrapper that convert WebP into PNG. dwebp-bin downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10634",
        "datePublished": "2018-06-01T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "scala-standalone-bin is a Binary wrapper for ScalaJS. scala-standalone-bin downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10635",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "broccoli-closure is a Closure compiler plugin for Broccoli. broccoli-closure before 1.3.1 downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10636",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "grunt-ccompiler is a Closure Compiler Grunt Plugin. grunt-ccompiler downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10637",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "haxe-dev is a cross-platform toolkit. haxe-dev downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10638",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "js-given is a JavaScript frontend to jgiven. js-given downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10639",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "redis-srvr is a npm wrapper for redis-server. redis-srvr downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10640",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "node-thulac is a node binding for thulac. node-thulac downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10641",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "node-bsdiff-android downloads resources over HTTP, which leaves it vulnerable to MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10642",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "cmake installs the cmake x86 linux binaries. cmake downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10643",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "jstestdriver is a wrapper for Google's jstestdriver. jstestdriver downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10644",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "slimerjs-edge is a npm wrapper for installing the bleeding edge version of slimerjs. slimerjs-edge downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10645",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "grunt-images is a grunt plugin for processing images. grunt-images downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10646",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "resourcehacker is a Node wrapper of Resource Hacker (windows executable resource editor). resourcehacker downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10647",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "node-air-sdk is an AIR SDK for nodejs. node-air-sdk downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10648",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "marionette-socket-host is a marionette-js-runner host for sending actions over a socket. marionette-socket-host downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10649",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "frames-compiler downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10650",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "ntfserver is a Network Testing Framework Server. ntfserver downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10651",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "webdriver-launcher is a Node.js Selenium Webdriver Launcher. webdriver-launcher downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10652",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "prebuild-lwip is a module for comprehensive, fast, and simple image processing and manipulation. prebuild-lwip downloads resources over HTTP, which leaves it vulnerable to MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10653",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "xd-testing is a testing library for cross-device (XD) web applications. xd-testing downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10654",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "sfml downloads resources over HTTP, which leaves it vulnerable to MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10655",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "The clang-extra module installs LLVM's clang-extra tools. clang-extra downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10656",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "qbs is a build tool that helps simplify the build process for developing projects across multiple platforms. qbs downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10657",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "co-cli-installer downloads the co-cli module as part of the install process, but does so over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10658",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "native-opencv is the OpenCV library installed via npm native-opencv downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10659",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "poco - The POCO libraries, downloads source file resources used for compilation over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10660",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "fis-parser-sass-bin a plugin for fis to compile sass using node-sass-binaries. fis-parser-sass-bin downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10661",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "phantomjs-cheniu is a Headless WebKit with JS API phantomjs-cheniu downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10662",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "tomita is a node wrapper for Yandex Tomita Parser tomita downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10663",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "wixtoolset is a Node module wrapper around the wixtoolset binaries wixtoolset downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10664",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "mystem is a Node.js wrapper for MyStem morphology text analyzer by Yandex.ru mystem downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10665",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "herbivore is a packet sniffing and crafting library. Built on libtins herbivore 0.0.3 and below download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10666",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "tomita-parser is a Node wrapper for Yandex Tomita Parser tomita-parser downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10667",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "selenium-portal is a Selenium Testing Framework selenium-portal downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10668",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "libsbml is a module that installs Linux binaries for libSBML libsbml downloads resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10669",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "soci downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10670",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "windows-seleniumjar-mirror downloads the Selenium Jar file windows-seleniumjar-mirror downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10671",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "mystem-wrapper is a Yandex mystem app wrapper module. mystem-wrapper downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10672",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "cloudpub-redis is a module for CloudPub: Redis Backend cloudpub-redis downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10673",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "ipip-coffee queries geolocation information from IP ipip-coffee downloads geolocation resources over HTTP, which leaves it vulnerable to MITM attacks. This could impact the integrity and availability of the data being used to make geolocation decisions by an application."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10674",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "limbus-buildgen is a \"build anywhere\" build system. limbus-buildgen versions below 0.1.1 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10675",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "libsbmlsim is a module that installs linux binaries for libsbmlsim libsbmlsim downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10676",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "rs-brightcove is a wrapper around brightcove's web api rs-brightcove downloads source file resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10677",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "google-closure-tools-latest is a Node.js module wrapper for downloading the latest version of the Google Closure tools google-closure-tools-latest downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10678",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "serc.js is a Selenium RC process wrapper serc.js downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10679",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "selenium-standalone-painful installs a start-selenium command line to start a standalone selenium server with chrome-driver. selenium-standalone-painful downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10680",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "adamvr-geoip-lite is a light weight native JavaScript implementation of GeoIP API from MaxMind adamvr-geoip-lite downloads geoip resources over HTTP, which leaves it vulnerable to MITM attacks. This impacts the integrity and availability of this geoip data that may alter the decisions made by an application using this data."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10681",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "roslib-socketio - The standard ROS Javascript Library fork for add support to socket.io roslib-socketio downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10682",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "massif is a Phantomjs fork massif downloads resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10683",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "arcanist downloads resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10684",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "healthcenter - IBM Monitoring and Diagnostic Tools health Center agent healthcenter downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10685",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "pk-app-wonderbox is an integration with wonderbox pk-app-wonderbox downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10686",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "fis-sass-all is another libsass wrapper for node. fis-sass-all downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10687",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "windows-selenium-chromedriver is a module that downloads the Selenium Jar file. windows-selenium-chromedriver downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10688",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "Haxe 3 : The Cross-Platform Toolkit (a fork from David Mouton's damoebius/haxe-npm) haxe3 downloads resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10689",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "The windows-iedriver module downloads fixed version of iedriverserver.exe windows-iedriver downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10690",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "openframe-ascii-image module is an openframe plugin which adds support for ascii images via fim. openframe-ascii-image downloads resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10691",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "windows-seleniumjar is a module that downloads the Selenium Jar file windows-seleniumjar downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10692",
        "datePublished": "2018-06-04T16:00:00",
        "description": {
            "lang": "en",
            "value": "haxeshim haxe shim to deal with coexisting versions. haxeshim downloads resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10693",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "pm2-kafka is a PM2 module that installs and runs a kafka server pm2-kafka downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10694",
        "datePublished": "2018-06-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "alto-saxophone is a module to install and launch Chromedriver for Mac, Linux or Windows. alto-saxophone versions below 2.25.1 download binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested binary with an attacker controlled binary if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10695",
        "datePublished": "2018-06-04T19:00:00Z",
        "description": {
            "lang": "en",
            "value": "The npm-test-sqlite3-trunk module provides asynchronous, non-blocking SQLite3 bindings. npm-test-sqlite3-trunk downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10696",
        "datePublished": "2018-06-04T19:00:00Z",
        "description": {
            "lang": "en",
            "value": "windows-latestchromedriver downloads the latest version of chromedriver.exe. windows-latestchromedriver downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10697",
        "datePublished": "2018-06-04T19:00:00Z",
        "description": {
            "lang": "en",
            "value": "react-native-baidu-voice-synthesizer is a baidu voice speech synthesizer for react native. react-native-baidu-voice-synthesizer downloads resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10698",
        "datePublished": "2018-05-29T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "mystem-fix is a node.js wrapper for MyStem morphology text analyzer by Yandex.ru mystem-fix downloads binary resources over HTTP, which leaves it vulnerable to MITM attacks. It may be possible to cause remote code execution (RCE) by swapping out the requested resources with an attacker controlled copy if the attacker is on the network or positioned in between the user and the remote server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-10818",
        "datePublished": "2019-08-01T18:43:03",
        "description": {
            "lang": "en",
            "value": "cPanel before 57.9999.54 incorrectly sets log-file permissions in dnsadmin-startup and spamd-startup (SEC-124)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-10824",
        "datePublished": "2019-08-01T16:40:48",
        "description": {
            "lang": "en",
            "value": "cPanel before 55.9999.141 allows unauthenticated arbitrary code execution via DNS NS entry poisoning (SEC-90)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-10826",
        "datePublished": "2019-08-01T18:28:55",
        "description": {
            "lang": "en",
            "value": "cPanel before 55.9999.141 allows attackers to bypass Two Factor Authentication via DNS clustering requests (SEC-93)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-10858",
        "datePublished": "2019-08-01T14:38:03",
        "description": {
            "lang": "en",
            "value": "cPanel before 11.54.0.0 allows unauthenticated arbitrary code execution via DNS NS entry poisoning (SEC-64)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-10931",
        "datePublished": "2019-08-26T12:00:16",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in the openssl crate before 0.9.0 for Rust. There is an SSL/TLS man-in-the-middle vulnerability because certificate verification is off by default and there is no API for hostname verification."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-10932",
        "datePublished": "2019-08-26T12:01:57",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in the hyper crate before 0.9.4 for Rust on Windows. There is an HTTPS man-in-the-middle vulnerability because hostname verification was omitted."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-10933",
        "datePublished": "2019-08-26T12:03:36",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in the portaudio crate through 0.7.0 for Rust. There is a man-in-the-middle issue because the source code is downloaded over cleartext HTTP."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-11086",
        "datePublished": "2020-09-24T19:34:18",
        "description": {
            "lang": "en",
            "value": "lib/oauth/consumer.rb in the oauth-ruby gem through 0.5.4 for Ruby does not verify server X.509 certificates if a certificate bundle cannot be found, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-1115",
        "datePublished": "2016-05-11T01:00:00",
        "description": {
            "lang": "en",
            "value": "Adobe ColdFusion 10 before Update 19, 11 before Update 8, and 2016 before Update 1 mishandles wildcards in name fields of X.509 certificates, which might allow man-in-the-middle attackers to spoof servers via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-1203",
        "datePublished": "2023-10-31T12:38:05.419Z",
        "description": {
            "lang": "en",
            "value": "Improper file verification vulnerability in SaAT Netizen installer ver.1.2.0.424 and earlier, and SaAT Netizen ver.1.2.0.8 (Build427) and earlier allows a remote unauthenticated attacker to conduct a man-in-the-middle attack. A successful exploitation may result in a malicious file being downloaded and executed."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-1210",
        "datePublished": "2017-04-21T20:00:00",
        "description": {
            "lang": "en",
            "value": "The 105 BANK app 1.0 and 1.1 for Android and 1.0 for iOS does not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-1221",
        "datePublished": "2017-04-21T20:00:00",
        "description": {
            "lang": "en",
            "value": "Jetstar App for iOS before 3.0.0 does not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-1252",
        "datePublished": "2017-12-05T16:00:00",
        "description": {
            "lang": "en",
            "value": "The apt package in Debian jessie before 1.0.9.8.4, in Debian unstable before 1.4~beta2, in Ubuntu 14.04 LTS before 1.0.1ubuntu2.17, in Ubuntu 16.04 LTS before 1.2.15ubuntu0.2, and in Ubuntu 16.10 before 1.3.2ubuntu0.1 allows man-in-the-middle attackers to bypass a repository-signing protection mechanism by leveraging improper error handling when validating InRelease file signatures."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-1281",
        "datePublished": "2017-01-23T21:00:00",
        "description": {
            "lang": "en",
            "value": "Untrusted search path vulnerability in the installer for TrueCrypt 7.2 and 7.1a, VeraCrypt before 1.17-BETA, and possibly other products allows local users to execute arbitrary code with administrator privileges and conduct DLL hijacking attacks via a Trojan horse DLL in the \"application directory\", as demonstrated with the USP10.dll, RichEd20.dll, NTMarta.dll and SRClient.dll DLLs."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-1417",
        "datePublished": "2017-01-23T21:00:00",
        "description": {
            "lang": "en",
            "value": "Untrusted search path vulnerability in Snort 2.9.7.0-WIN32 allows remote attackers to execute arbitrary code and conduct DLL hijacking attacks via a Trojan horse tcapi.dll that is located in the same folder on a remote file share as a pcap file that is being processed."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-1436",
        "datePublished": "2016-06-23T00:00:00",
        "description": {
            "lang": "en",
            "value": "The General Packet Radio Switching Tunneling Protocol 1 (aka GTPv1) implementation on Cisco ASR 5000 Packet Data Network Gateway devices before 19.4 allows remote attackers to cause a denial of service (Session Manager process restart) via a crafted GTPv1 packet, aka Bug ID CSCuz46198."
        },
        "metrics": [],
        "tags": [
            "tunneling"
        ]
    },
    {
        "cveId": "CVE-2016-1489",
        "datePublished": "2016-01-26T19:00:00",
        "description": {
            "lang": "en",
            "value": "Lenovo SHAREit before 3.2.0 for Windows and SHAREit before 3.5.48_ww for Android transfer files in cleartext, which allows remote attackers to (1) obtain sensitive information by sniffing the network or (2) conduct man-in-the-middle (MITM) attacks via unspecified vectors."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-1493",
        "datePublished": "2016-01-29T20:00:00",
        "description": {
            "lang": "en",
            "value": "Intel Driver Update Utility before 2.4 retrieves driver updates in cleartext, which makes it easier for man-in-the-middle attackers to execute arbitrary code via a crafted file."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-1518",
        "datePublished": "2017-04-21T20:00:00",
        "description": {
            "lang": "en",
            "value": "The auto-provisioning mechanism in the Grandstream Wave app 1.0.1.26 and earlier for Android and Grandstream Video IP phones allows man-in-the-middle attackers to spoof provisioning data and consequently modify device functionality, obtain sensitive information from system logs, and have unspecified other impact by leveraging failure to use an HTTPS session for downloading configuration files from http://fm.grandstream.com/gs/."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-1519",
        "datePublished": "2017-04-21T20:00:00",
        "description": {
            "lang": "en",
            "value": "The com.softphone.common package in the Grandstream Wave app 1.0.1.26 and earlier for Android does not properly validate SSL certificates, which allows man-in-the-middle attackers to spoof the Grandstream provisioning server via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-1520",
        "datePublished": "2017-04-21T20:00:00",
        "description": {
            "lang": "en",
            "value": "The Grandstream Wave app 1.0.1.26 and earlier for Android does not use HTTPS when retrieving update information, which might allow man-in-the-middle attackers to execute arbitrary code via a crafted application."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-1563",
        "datePublished": "2016-04-07T10:00:00",
        "description": {
            "lang": "en",
            "value": "NetApp Clustered Data ONTAP 8.3.1 does not properly verify X.509 certificates from TLS servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-1693",
        "datePublished": "2016-06-05T23:00:00",
        "description": {
            "lang": "en",
            "value": "browser/safe_browsing/srt_field_trial_win.cc in Google Chrome before 51.0.2704.63 does not use the HTTPS service on dl.google.com to obtain the Software Removal Tool, which allows remote attackers to spoof the chrome_cleanup_tool.exe (aka CCT) file via a man-in-the-middle attack on an HTTP session."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-1731",
        "datePublished": "2016-03-14T01:00:00",
        "description": {
            "lang": "en",
            "value": "Apple Software Update before 2.2 on Windows does not use HTTPS, which makes it easier for man-in-the-middle attackers to spoof updates by modifying the client-server data stream."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-1866",
        "datePublished": "2016-04-12T14:00:00",
        "description": {
            "lang": "en",
            "value": "Salt 2015.8.x before 2015.8.4 does not properly handle clear messages on the minion, which allows man-in-the-middle attackers to execute arbitrary code by inserting packets into the minion-master data stream."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-1920",
        "datePublished": "2017-01-27T20:00:00",
        "description": {
            "lang": "en",
            "value": "Samsung KNOX 1.0.0 uses the shared certificate on Android, which allows local users to conduct man-in-the-middle attacks as demonstrated by installing a certificate and running a VPN service."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-1948",
        "datePublished": "2016-01-31T18:00:00",
        "description": {
            "lang": "en",
            "value": "Mozilla Firefox before 44.0 on Android does not ensure that HTTPS is used for a lightweight-theme installation, which allows man-in-the-middle attackers to replace a theme's images and colors by modifying the client-server data stream."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-20009",
        "datePublished": "2021-03-11T21:39:25",
        "description": {
            "lang": "en",
            "value": "A DNS client stack-based buffer overflow in ipdnsc_decode_name() affects Wind River VxWorks 6.5 through 7. NOTE: This vulnerability only affects products that are no longer supported by the maintainer"
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-2047",
        "datePublished": "2016-01-27T20:00:00",
        "description": {
            "lang": "en",
            "value": "The ssl_verify_server_cert function in sql-common/client.c in MariaDB before 5.5.47, 10.0.x before 10.0.23, and 10.1.x before 10.1.10; Oracle MySQL 5.5.48 and earlier, 5.6.29 and earlier, and 5.7.11 and earlier; and Percona Server do not properly verify that the server hostname matches a domain name in the subject's Common Name (CN) or subjectAltName field of the X.509 certificate, which allows man-in-the-middle attackers to spoof SSL servers via a \"/CN=\" string in a field in a certificate, as demonstrated by \"/OU=/CN=bar.com/CN=foo.com.\""
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2084",
        "datePublished": "2016-04-13T16:00:00",
        "description": {
            "lang": "en",
            "value": "F5 BIG-IP LTM, AFM, Analytics, APM, ASM, Link Controller, and PEM 11.3.x, 11.4.x before 11.4.1 build 685-HF10, 11.5.1 before build 10.104.180, 11.5.2 before 11.5.4 build 0.1.256, 11.6.0 before build 6.204.442, and 12.0.0 before build 1.14.628; BIG-IP AAM 11.4.x before 11.4.1 build 685-HF10, 11.5.1 before build 10.104.180, 11.5.2 before 11.5.4 build 0.1.256, 11.6.0 before build 6.204.442, and 12.0.0 before build 1.14.628; BIG-IP DNS 12.0.0 before build 1.14.628; BIG-IP Edge Gateway, WebAccelerator, and WOM 11.3.0; BIG-IP GTM 11.3.x, 11.4.x before 11.4.1 build 685-HF10, 11.5.1 before build 10.104.180, 11.5.2 before 11.5.4 build 0.1.256, and 11.6.0 before build 6.204.442; BIG-IP PSM 11.3.x and 11.4.x before 11.4.1 build 685-HF10; BIG-IQ Cloud, Device, and Security 4.2.0 through 4.5.0; and BIG-IQ ADC 4.5.0 do not properly regenerate certificates and keys when deploying cloud images in Amazon Web Services (AWS), Azure or Verizon cloud services environments, which allows attackers to obtain sensitive information or cause a denial of service (disruption) by leveraging a target instance configuration."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-2088",
        "datePublished": "2016-03-09T23:00:00",
        "description": {
            "lang": "en",
            "value": "resolver.c in named in ISC BIND 9.10.x before 9.10.3-P4, when DNS cookies are enabled, allows remote attackers to cause a denial of service (INSIST assertion failure and daemon exit) via a malformed packet with more than one cookie option."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-2110",
        "datePublished": "2016-04-25T00:00:00",
        "description": {
            "lang": "en",
            "value": "The NTLMSSP authentication implementation in Samba 3.x and 4.x before 4.2.11, 4.3.x before 4.3.8, and 4.4.x before 4.4.2 allows man-in-the-middle attackers to perform protocol-downgrade attacks by modifying the client-server data stream to remove application-layer flags or encryption settings, as demonstrated by clearing the NTLMSSP_NEGOTIATE_SEAL or NTLMSSP_NEGOTIATE_SIGN option to disrupt LDAP security."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2112",
        "datePublished": "2016-04-25T00:00:00",
        "description": {
            "lang": "en",
            "value": "The bundled LDAP client library in Samba 3.x and 4.x before 4.2.11, 4.3.x before 4.3.8, and 4.4.x before 4.4.2 does not recognize the \"client ldap sasl wrapping\" setting, which allows man-in-the-middle attackers to perform LDAP protocol-downgrade attacks by modifying the client-server data stream."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2113",
        "datePublished": "2016-04-25T00:00:00",
        "description": {
            "lang": "en",
            "value": "Samba 4.x before 4.2.11, 4.3.x before 4.3.8, and 4.4.x before 4.4.2 does not verify X.509 certificates from TLS servers, which allows man-in-the-middle attackers to spoof LDAPS and HTTPS servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2114",
        "datePublished": "2016-04-25T00:00:00",
        "description": {
            "lang": "en",
            "value": "The SMB1 protocol implementation in Samba 4.x before 4.2.11, 4.3.x before 4.3.8, and 4.4.x before 4.4.2 does not recognize the \"server signing = mandatory\" setting, which allows man-in-the-middle attackers to spoof SMB servers by modifying the client-server data stream."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2115",
        "datePublished": "2016-04-25T00:00:00",
        "description": {
            "lang": "en",
            "value": "Samba 3.x and 4.x before 4.2.11, 4.3.x before 4.3.8, and 4.4.x before 4.4.2 does not require SMB signing within a DCERPC session over ncacn_np, which allows man-in-the-middle attackers to spoof SMB clients by modifying the client-server data stream."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2118",
        "datePublished": "2016-04-12T23:00:00",
        "description": {
            "lang": "en",
            "value": "The MS-SAMR and MS-LSAD protocol implementations in Samba 3.x and 4.x before 4.2.11, 4.3.x before 4.3.8, and 4.4.x before 4.4.2 mishandle DCERPC connections, which allows man-in-the-middle attackers to perform protocol-downgrade attacks and impersonate users by modifying the client-server data stream, aka \"BADLOCK.\""
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2119",
        "datePublished": "2016-07-07T15:00:00",
        "description": {
            "lang": "en",
            "value": "libcli/smb/smbXcli_base.c in Samba 4.x before 4.2.14, 4.3.x before 4.3.11, and 4.4.x before 4.4.5 allows man-in-the-middle attackers to bypass a client-signing protection mechanism, and consequently spoof SMB2 and SMB3 servers, via the (1) SMB2_SESSION_FLAG_IS_GUEST or (2) SMB2_SESSION_FLAG_IS_NULL flag."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2120",
        "datePublished": "2018-11-01T13:00:00",
        "description": {
            "lang": "en",
            "value": "An issue has been found in PowerDNS Authoritative Server versions up to and including 3.4.10, 4.0.1 allowing an authorized user to crash the server by inserting a specially crafted record in a zone under their control then sending a DNS query for that record. The issue is due to an integer overflow when checking if the content of the record matches the expected size, allowing an attacker to cause a read past the buffer boundary."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-2123",
        "datePublished": "2018-11-01T13:00:00",
        "description": {
            "lang": "en",
            "value": "A flaw was found in samba versions 4.0.0 to 4.5.2. The Samba routine ndr_pull_dnsp_name contains an integer wrap problem, leading to an attacker-controlled memory overwrite. ndr_pull_dnsp_name parses data from the Samba Active Directory ldb database. Any user who can write to the dnsRecord attribute over LDAP can trigger this memory corruption. By default, all authenticated LDAP users can write to the dnsRecord attribute on new DNS objects. This makes the defect a remote privilege escalation."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.1,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-2141",
        "datePublished": "2016-06-30T00:00:00",
        "description": {
            "lang": "en",
            "value": "It was found that JGroups did not require necessary headers for encrypt and auth protocols from new nodes joining the cluster. An attacker could use this flaw to bypass security restrictions, and use this vulnerability to send and receive messages within the cluster, leading to information disclosure, message spoofing, or further possible attacks."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-2166",
        "datePublished": "2016-04-12T14:00:00",
        "description": {
            "lang": "en",
            "value": "The (1) proton.reactor.Connector, (2) proton.reactor.Container, and (3) proton.utils.BlockingConnection classes in Apache Qpid Proton before 0.12.1 improperly use an unencrypted connection for an amqps URI scheme when SSL support is unavailable, which might allow man-in-the-middle attackers to obtain sensitive information or modify data via unspecified vectors."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2224",
        "datePublished": "2017-03-24T15:00:00",
        "description": {
            "lang": "en",
            "value": "The __decode_dotted function in libc/inet/resolv.c in uClibc-ng before 1.0.12 allows remote DNS servers to cause a denial of service (infinite loop) via vectors involving compressed items in a reply."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-2225",
        "datePublished": "2017-03-24T15:00:00",
        "description": {
            "lang": "en",
            "value": "The __read_etc_hosts_r function in libc/inet/resolv.c in uClibc-ng before 1.0.12 allows remote DNS servers to cause a denial of service (infinite loop) via a crafted packet."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-2268",
        "datePublished": "2016-02-08T19:00:00",
        "description": {
            "lang": "en",
            "value": "Dell SecureWorks app before 2.1 for iOS does not validate SSL certificates, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2332",
        "datePublished": "2016-04-25T18:00:00",
        "description": {
            "lang": "en",
            "value": "flu.cgi in the web interface on SysLINK SL-1000 Machine-to-Machine (M2M) Modular Gateway devices with firmware before 01A.8 allows remote authenticated users to execute arbitrary commands via the 5066 (aka dnsmasq) parameter."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-2346",
        "datePublished": "2016-04-25T18:00:00",
        "description": {
            "lang": "en",
            "value": "Allround Automations PL/SQL Developer 11 before 11.0.6 relies on unverified HTTP data for updates, which allows man-in-the-middle attackers to execute arbitrary code by modifying fields in the client-server data stream."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2367",
        "datePublished": "2017-01-06T21:00:00",
        "description": {
            "lang": "en",
            "value": "An information leak exists in the handling of the MXIT protocol in Pidgin. Specially crafted MXIT data sent via the server could potentially result in an out-of-bounds read. A malicious user, server, or man-in-the-middle can send an invalid size for an avatar which will trigger an out-of-bounds read vulnerability. This could result in a denial of service or copy data from memory to the file, resulting in an information leak if the avatar is sent to another user."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2370",
        "datePublished": "2017-01-06T21:00:00",
        "description": {
            "lang": "en",
            "value": "A denial of service vulnerability exists in the handling of the MXIT protocol in Pidgin. Specially crafted MXIT data sent from the server could potentially result in an out-of-bounds read. A malicious server or man-in-the-middle attacker can send invalid data to trigger this vulnerability."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2372",
        "datePublished": "2017-01-06T21:00:00",
        "description": {
            "lang": "en",
            "value": "An information leak exists in the handling of the MXIT protocol in Pidgin. Specially crafted MXIT data sent via the server could potentially result in an out-of-bounds read. A malicious user, server, or man-in-the-middle attacker can send an invalid size for a file transfer which will trigger an out-of-bounds read vulnerability. This could result in a denial of service or copy data from memory to the file, resulting in an information leak if the file is sent to another user."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2402",
        "datePublished": "2017-01-30T22:00:00",
        "description": {
            "lang": "en",
            "value": "OkHttp before 2.7.4 and 3.x before 3.1.2 allows man-in-the-middle attackers to bypass certificate pinning by sending a certificate chain with a certificate from a non-pinned trusted CA and the pinned certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2562",
        "datePublished": "2016-03-01T11:00:00",
        "description": {
            "lang": "en",
            "value": "The checkHTTP function in libraries/Config.class.php in phpMyAdmin 4.5.x before 4.5.5.1 does not verify X.509 certificates from api.github.com SSL servers, which allows man-in-the-middle attackers to spoof these servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-2780",
        "datePublished": "2016-04-13T14:00:00",
        "description": {
            "lang": "en",
            "value": "Untrusted search path vulnerability in Huawei UTPS before UTPS-V200R003B015D15SP00C983 allows local users to execute arbitrary code and conduct DLL hijacking attacks via a Trojan horse DLL in an unspecified directory."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-2784",
        "datePublished": "2016-05-26T14:00:00",
        "description": {
            "lang": "en",
            "value": "CMS Made Simple 2.x before 2.1.3 and 1.x before 1.12.2, when Smarty Cache is activated, allow remote attackers to conduct cache poisoning attacks, modify links, and conduct cross-site scripting (XSS) attacks via a crafted HTTP Host header in a request."
        },
        "metrics": [],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2016-2831",
        "datePublished": "2016-06-13T10:00:00",
        "description": {
            "lang": "en",
            "value": "Mozilla Firefox before 47.0 and Firefox ESR 45.x before 45.2 do not ensure that the user approves the fullscreen and pointerlock settings, which allows remote attackers to cause a denial of service (UI outage), or conduct clickjacking or spoofing attacks, via a crafted web site."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-2922",
        "datePublished": "2018-08-13T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "IBM Rational ClearQuest 8.0 through 8.0.1.9 and 9.0 through 9.0.1.3 (CQ OSLC linkages, EmailRelay) fails to check the SSL certificate against the requested hostname. It is subject to a man-in-the-middle attack with an impersonating server observing all the data transmitted to the real server. IBM X-Force ID: 113353."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 3.7,
                "severity": "LOW"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-3075",
        "datePublished": "2016-06-01T20:00:00",
        "description": {
            "lang": "en",
            "value": "Stack-based buffer overflow in the nss_dns implementation of the getnetbyname function in GNU C Library (aka glibc) before 2.24 allows context-dependent attackers to cause a denial of service (stack consumption and application crash) via a long name."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-3128",
        "datePublished": "2017-01-13T09:00:00",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability in the Core of BlackBerry Enterprise Server (BES) 12 through 12.5.2 allows remote attackers to enroll an illegitimate device to the BES, gain access to device parameters for the BES, or send false information to the BES by gaining access to specific information about a device that was legitimately enrolled on the BES."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-3173",
        "datePublished": "2016-12-15T06:31:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Open-Xchange OX AppSuite before 7.8.0-rev27. The aria-label parameter of tiles at the Portal can be used to inject script code. Those labels use the name of the file (e.g. an image) which gets displayed at the portal application. Using script code at the file name leads to script execution. Malicious script code can be executed within a user's context. This can lead to session hijacking or triggering unwanted actions via the web interface (sending mail, deleting data etc.). Users actively need to add a file to the portal to enable this attack. In case of shared files however, a internal attacker may modify a previously embedded file to carry a malicious file name. Furthermore this vulnerability can be used to persistently execute code that got injected by a temporary script execution vulnerability."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-3180",
        "datePublished": "2017-02-07T17:00:00",
        "description": {
            "lang": "en",
            "value": "Tor Browser Launcher (aka torbrowser-launcher) before 0.2.4, during the initial run, allows man-in-the-middle attackers to bypass the PGP signature verification and execute arbitrary code via a Trojan horse tar file and a signature file with the valid tarball and signature."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-3223",
        "datePublished": "2016-06-16T01:00:00",
        "description": {
            "lang": "en",
            "value": "Microsoft Windows Vista SP2, Windows Server 2008 SP2 and R2 SP1, Windows 7 SP1, Windows 8.1, Windows Server 2012 Gold and R2, Windows RT 8.1, and Windows 10 Gold and 1511 mishandle LDAP authentication, which allows man-in-the-middle attackers to gain privileges by modifying group-policy update data within a domain-controller data stream, aka \"Group Policy Elevation of Privilege Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-3227",
        "datePublished": "2016-06-16T01:00:00",
        "description": {
            "lang": "en",
            "value": "Use-after-free vulnerability in the DNS Server component in Microsoft Windows Server 2012 Gold and R2 allows remote attackers to execute arbitrary code via crafted requests, aka \"Windows DNS Server Use After Free Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-3237",
        "datePublished": "2016-08-09T21:00:00",
        "description": {
            "lang": "en",
            "value": "Kerberos in Microsoft Windows Vista SP2; Windows Server 2008 SP2 and R2 SP1; Windows 7 SP1; Windows 8.1; Windows Server 2012 Gold and R2; Windows RT 8.1; and Windows 10 Gold, 1511, and 1607 allows man-in-the-middle attackers to bypass authentication via vectors related to a fallback to NTLM authentication during a domain account password change, aka \"Kerberos Security Feature Bypass Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-3238",
        "datePublished": "2016-07-13T01:00:00",
        "description": {
            "lang": "en",
            "value": "The Print Spooler service in Microsoft Windows Vista SP2, Windows Server 2008 SP2 and R2 SP1, Windows 7 SP1, Windows 8.1, Windows Server 2012 Gold and R2, Windows RT 8.1, and Windows 10 Gold and 1511 allows man-in-the-middle attackers to execute arbitrary code by providing a crafted print driver during printer installation, aka \"Windows Print Spooler Remote Code Execution Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-3274",
        "datePublished": "2016-07-13T01:00:00",
        "description": {
            "lang": "en",
            "value": "Microsoft Internet Explorer 9 through 11 and Microsoft Edge allow remote attackers to conduct content-spoofing attacks via a crafted URL, aka \"Microsoft Browser Spoofing Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-3276",
        "datePublished": "2016-07-13T01:00:00",
        "description": {
            "lang": "en",
            "value": "Microsoft Internet Explorer 11 and Microsoft Edge allow remote attackers to conduct content-spoofing attacks via a crafted URL, aka \"Microsoft Browser Spoofing Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-3299",
        "datePublished": "2016-08-09T21:00:00",
        "description": {
            "lang": "en",
            "value": "Microsoft Windows Vista SP2, Windows Server 2008 SP2 and R2 SP1, Windows 7 SP1, Windows 8.1, Windows Server 2012 Gold and R2, Windows RT 8.1, and Windows 10 Gold and 1511 allow remote attackers to hijack network traffic or bypass intended Enhanced Protected Mode (EPM) or application container protection mechanisms, and consequently render untrusted content in a browser, by leveraging how NetBIOS validates responses, aka \"NetBIOS Spoofing Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-3366",
        "datePublished": "2016-09-14T10:00:00",
        "description": {
            "lang": "en",
            "value": "Microsoft Outlook 2007 SP3, Outlook 2010 SP2, Outlook 2013 SP1, Outlook 2013 RT SP1, Outlook 2016, and Outlook 2016 for Mac do not properly implement RFC 2046, which allows remote attackers to bypass virus or spam detection via crafted MIME data in an e-mail attachment, aka \"Microsoft Office Spoofing Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-3400",
        "datePublished": "2017-07-03T16:00:00",
        "description": {
            "lang": "en",
            "value": "NetApp Data ONTAP 8.1 and 8.2, when operating in 7-Mode, allows man-in-the-middle attackers to obtain sensitive information, gain privileges, or cause a denial of service via vectors related to the SMB protocol."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-3664",
        "datePublished": "2016-05-23T19:00:00",
        "description": {
            "lang": "en",
            "value": "Trend Micro Mobile Security for iOS before 3.2.1188 does not verify the X.509 certificate of the mobile application login server, which allows man-in-the-middle attackers to spoof this server and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-3676",
        "datePublished": "2016-04-11T15:00:00",
        "description": {
            "lang": "en",
            "value": "Huawei E3276s USB modems with software before E3276s-150TCPU-V200R002B436D09SP00C00 allow man-in-the-middle attackers to intercept, spoof, or modify network traffic via unspecified vectors related to a fake network."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-3698",
        "datePublished": "2016-06-13T19:00:00",
        "description": {
            "lang": "en",
            "value": "libndp before 1.6, as used in NetworkManager, does not properly validate the origin of Neighbor Discovery Protocol (NDP) messages, which allows remote attackers to conduct man-in-the-middle attacks or cause a denial of service (network connectivity disruption) by advertising a node as a router from a non-local network."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-3725",
        "datePublished": "2016-05-17T14:00:00",
        "description": {
            "lang": "en",
            "value": "Jenkins before 2.3 and LTS before 1.651.2 allows remote authenticated users to trigger updating of update site metadata by leveraging a missing permissions check. NOTE: this issue can be combined with DNS cache poisoning to cause a denial of service (service disruption)."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dns cache poisoning",
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2016-3944",
        "datePublished": "2016-06-03T14:00:00",
        "description": {
            "lang": "en",
            "value": "UpdateAgent in Lenovo Accelerator Application allows man-in-the-middle attackers to execute arbitrary code by spoofing an update response from susapi.lenovomm.com."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-3997",
        "datePublished": "2017-07-03T16:00:00",
        "description": {
            "lang": "en",
            "value": "NetApp Clustered Data ONTAP allows man-in-the-middle attackers to obtain sensitive information, gain privileges, or cause a denial of service by leveraging failure to enable SMB signing enforcement in its default state."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-3998",
        "datePublished": "2017-07-03T16:00:00",
        "description": {
            "lang": "en",
            "value": "NetApp AltaVault 4.1 and earlier allows man-in-the-middle attackers to obtain sensitive information, gain privileges, or cause a denial of service via vectors related to the SMB protocol."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-4026",
        "datePublished": "2016-12-15T06:31:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Open-Xchange OX App Suite before 7.8.1-rev11. The content sanitizer component has an issue with filtering malicious content in case invalid HTML code is provided. In such cases the filter will output a unsanitized representation of the content. Malicious script code can be executed within a user's context. This can lead to session hijacking or triggering unwanted actions via the web interface (sending mail, deleting data etc.). Attackers can use this issue for filter evasion to inject script code later on."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-4045",
        "datePublished": "2016-12-15T06:31:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Open-Xchange OX App Suite before 7.8.1-rev11. Script code can be embedded to RSS feeds using a URL notation. In case a user clicks the corresponding link at the RSS reader of App Suite, code gets executed at the context of the user. Malicious script code can be executed within a user's context. This can lead to session hijacking or triggering unwanted actions via the web interface (sending mail, deleting data etc.). The attacker needs to reside within the same context to make this attack work."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-4087",
        "datePublished": "2016-05-23T19:00:00",
        "description": {
            "lang": "en",
            "value": "Huawei S12700 switches with software before V200R008C00SPC500 and S5700 switches with software before V200R005SPH010, when the debug switch is enabled, allows remote attackers to cause a denial of service or execute arbitrary code via crafted DNS packets."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-4467",
        "datePublished": "2017-05-02T14:00:00",
        "description": {
            "lang": "en",
            "value": "The C client and C-based client bindings in the Apache Qpid Proton library before 0.13.1 on Windows do not properly verify that the server hostname matches a domain name in the subject's Common Name (CN) or subjectAltName field of the X.509 certificate when using the SChannel-based security layer, which allows man-in-the-middle attackers to spoof servers via an arbitrary valid certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-4576",
        "datePublished": "2016-05-23T19:00:00",
        "description": {
            "lang": "en",
            "value": "Buffer overflow in the Application Specific Packet Filtering (ASPF) functionality in the Huawei IPS Module, NGFW Module, NIP6300, NIP6600, Secospace USG6300, USG6500, USG6600, USG9500, and AntiDDoS8000 devices with software before V500R001C20SPC100 allows remote attackers to cause a denial of service or execute arbitrary code via a crafted packet, related to \"illegitimate parameters.\""
        },
        "metrics": [],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2016-4577",
        "datePublished": "2016-05-23T19:00:00",
        "description": {
            "lang": "en",
            "value": "Buffer overflow in the Smart DNS functionality in the Huawei NGFW Module and Secospace USG6300, USG6500, USG6600, and USG9500 firewalls with software before V500R001C20SPC100 allows remote attackers to cause a denial of service or execute arbitrary code via a crafted packet, related to \"illegitimate parameters.\""
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-4635",
        "datePublished": "2016-07-22T01:00:00",
        "description": {
            "lang": "en",
            "value": "FaceTime in Apple iOS before 9.3.3 and OS X before 10.11.6 allows man-in-the-middle attackers to spoof relayed-call termination, and obtain sensitive audio information in opportunistic circumstances, via unspecified vectors."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-4721",
        "datePublished": "2017-02-20T08:35:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in certain Apple products. iOS before 10.1 is affected. macOS before 10.12.1 is affected. The issue involves the \"IDS - Connectivity\" component, which allows man-in-the-middle attackers to spoof calls via a \"switch caller\" notification."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-4722",
        "datePublished": "2016-09-25T10:00:00",
        "description": {
            "lang": "en",
            "value": "The IDS - Connectivity component in Apple iOS before 10 and OS X before 10.12 allows man-in-the-middle attackers to conduct Call Relay spoofing attacks and cause a denial of service via unspecified vectors."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-4739",
        "datePublished": "2016-09-25T10:00:00",
        "description": {
            "lang": "en",
            "value": "mDNSResponder in Apple OS X before 10.12, when VMnet.framework is used, arranges for a DNS proxy to listen on all interfaces, which allows remote attackers to obtain sensitive information by sending a DNS query to an unintended interface."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-4741",
        "datePublished": "2016-09-18T22:00:00",
        "description": {
            "lang": "en",
            "value": "The Assets component in Apple iOS before 10 allows man-in-the-middle attackers to block software updates via vectors related to lack of an HTTPS session for retrieving updates."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-4747",
        "datePublished": "2016-09-18T22:00:00",
        "description": {
            "lang": "en",
            "value": "Mail in Apple iOS before 10 mishandles certificates, which makes it easier for man-in-the-middle attackers to discover mail credentials via unspecified vectors."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-4760",
        "datePublished": "2016-09-25T10:00:00",
        "description": {
            "lang": "en",
            "value": "WebKit in Apple iOS before 10, iTunes before 12.5.1 on Windows, and Safari before 10 allows remote attackers to conduct DNS rebinding attacks against non-HTTP Safari sessions by leveraging HTTP/0.9 support."
        },
        "metrics": [],
        "tags": [
            "dns",
            "rebinding attack"
        ]
    },
    {
        "cveId": "CVE-2016-4763",
        "datePublished": "2016-09-25T10:00:00",
        "description": {
            "lang": "en",
            "value": "WKWebView in WebKit in Apple iOS before 10, iTunes before 12.5.1 on Windows, and Safari before 10 does not properly verify X.509 certificates from HTTPS servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-4802",
        "datePublished": "2016-06-24T17:00:00",
        "description": {
            "lang": "en",
            "value": "Multiple untrusted search path vulnerabilities in cURL and libcurl before 7.49.1, when built with SSPI or telnet is enabled, allow local users to execute arbitrary code and conduct DLL hijacking attacks via a Trojan horse (1) security.dll, (2) secur32.dll, or (3) ws2_32.dll in the application or current working directory."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-4811",
        "datePublished": "2016-06-19T20:00:00",
        "description": {
            "lang": "en",
            "value": "The NTT Broadband Platform Japan Connected-free Wi-Fi application 1.15.1 and earlier for Android and 1.13.0 and earlier for iOS allows man-in-the-middle attackers to obtain API access via unspecified vectors."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-4850",
        "datePublished": "2017-04-20T18:00:00",
        "description": {
            "lang": "en",
            "value": "LINE for Windows before 4.8.3 allows man-in-the-middle attackers to execute arbitrary code."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-4927",
        "datePublished": "2017-03-20T20:00:00",
        "description": {
            "lang": "en",
            "value": "Insufficient validation of SSH keys in Junos Space before 15.2R2 allows man-in-the-middle (MITM) type of attacks while a Space device is communicating with managed devices."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-5021",
        "datePublished": "2016-06-24T17:00:00",
        "description": {
            "lang": "en",
            "value": "The iControl REST service in F5 BIG-IP LTM, AAM, AFM, Analytics, APM, ASM, Link Controller, and PEM 11.5.x before 11.5.4, 11.6.x before 11.6.1, and 12.x before 12.0.0 HF3; BIG-IP DNS 12.x before 12.0.0 HF3; BIG-IP GTM 11.5.x before 11.5.4 and 11.6.x before 11.6.1; BIG-IQ Cloud and Security 4.0.0 through 4.5.0; BIG-IQ Device 4.2.0 through 4.5.0; BIG-IQ ADC 4.5.0; BIG-IQ Centralized Management 4.6.0; and BIG-IQ Cloud and Orchestration 1.0.0 allows remote authenticated administrators to obtain sensitive information via unspecified vectors."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-5022",
        "datePublished": "2016-09-07T19:00:00",
        "description": {
            "lang": "en",
            "value": "F5 BIG-IP LTM, Analytics, APM, ASM, and Link Controller 11.2.x before 11.2.1 HF16, 11.3.x, 11.4.x, 11.5.x before 11.5.4 HF2, 11.6.x before 11.6.1 HF1, and 12.x before 12.0.0 HF3; BIG-IP AAM, AFM, and PEM 11.4.x, 11.5.x before 11.5.4 HF2, 11.6.x before 11.6.1 HF1, and 12.x before 12.0.0 HF3; BIG-IP DNS 12.x before 12.0.0 HF3; BIG-IP Edge Gateway, WebAccelerator, and WOM 11.2.x before 11.2.1 HF16 and 11.3.0; BIG-IP GTM 11.2.x before 11.2.1 HF16, 11.3.x, 11.4.x, 11.5.x before 11.5.4 HF2, and 11.6.x before 11.6.1 HF1; BIG-IP PSM 11.2.x before 11.2.1 HF16, 11.3.x, and 11.4.0 through 11.4.1; Enterprise Manager 3.1.1; BIG-IQ Cloud and Security 4.0.0 through 4.5.0; BIG-IQ Device 4.2.0 through 4.5.0; BIG-IQ ADC 4.5.0; BIG-IQ Centralized Management 5.0.0; BIG-IQ Cloud and Orchestration 1.0.0; and iWorkflow 2.0.0, when Packet Filtering is enabled on virtual servers and possibly self IP addresses, allow remote attackers to cause a denial of service (Traffic Management Microkernel restart) and possibly have unspecified other impact via crafted network traffic."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-5117",
        "datePublished": "2017-01-31T19:00:00",
        "description": {
            "lang": "en",
            "value": "OpenNTPD before 6.0p1 does not validate the CN for HTTPS constraint requests, which allows remote attackers to bypass the man-in-the-middle mitigations via a crafted timestamp constraint with a valid certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-5119",
        "datePublished": "2017-01-23T21:00:00",
        "description": {
            "lang": "en",
            "value": "The automatic update feature in KeePass 2.33 and earlier allows man-in-the-middle attackers to execute arbitrary code by spoofing the version check response and supplying a crafted update."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-5124",
        "datePublished": "2016-12-15T06:31:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Open-Xchange OX App Suite before 7.8.1-rev14. Adding images from external sources to HTML editors by drag&drop can potentially lead to script code execution in the context of the active user. To exploit this, a user needs to be tricked to use an image from a specially crafted website and add it to HTML editor areas of OX App Suite, for example E-Mail Compose or OX Text. This specific attack circumvents typical XSS filters and detection mechanisms since the code is not loaded from an external service but injected locally. Malicious script code can be executed within a user's context. This can lead to session hijacking or triggering unwanted actions via the web interface (sending mail, deleting data etc.). To exploit this vulnerability, a attacker needs to convince a user to follow specific steps (social-engineering)."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-5133",
        "datePublished": "2016-07-23T19:00:00",
        "description": {
            "lang": "en",
            "value": "Google Chrome before 52.0.2743.82 mishandles origin information during proxy authentication, which allows man-in-the-middle attackers to spoof a proxy-authentication login prompt or trigger incorrect credential storage by modifying the client-server data stream."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-5268",
        "datePublished": "2016-08-05T01:00:00",
        "description": {
            "lang": "en",
            "value": "Mozilla Firefox before 48.0 does not properly set the LINKABLE and URI_SAFE_FOR_UNTRUSTED_CONTENT flags of about: URLs that are used for error pages, which makes it easier for remote attackers to conduct spoofing attacks via a crafted URL, as demonstrated by misleading text after an about:neterror?d= substring."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-5284",
        "datePublished": "2016-09-22T22:00:00",
        "description": {
            "lang": "en",
            "value": "Mozilla Firefox before 49.0, Firefox ESR 45.x before 45.4, and Thunderbird < 45.4 rely on unintended expiration dates for Preloaded Public Key Pinning, which allows man-in-the-middle attackers to spoof add-on updates by leveraging possession of an X.509 server certificate for addons.mozilla.org signed by an arbitrary built-in Certification Authority."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-5341",
        "datePublished": "2016-12-06T11:00:00",
        "description": {
            "lang": "en",
            "value": "The GPS component in Android before 2016-12-05 allows man-in-the-middle attackers to cause a denial of service (GPS signal-acquisition delay) via an incorrect xtra.bin or xtra2.bin file on a spoofed Qualcomm gpsonextra.net or izatcloud.net host, aka internal bug 31470303 and external bug 211602 (and AndroidID-7225554)."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-5348",
        "datePublished": "2016-10-10T10:00:00Z",
        "description": {
            "lang": "en",
            "value": "The GPS component in Android 4.x before 4.4.4, 5.0.x before 5.0.2, 5.1.x before 5.1.1, 6.x before 2016-10-01, and 7.0 before 2016-10-01 allows man-in-the-middle attackers to cause a denial of service (memory consumption, and device hang or reboot) via a large xtra.bin or xtra2.bin file on a spoofed Qualcomm gpsonextra.net or izatcloud.net host, aka internal bug 29555864."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-5362",
        "datePublished": "2016-06-17T15:00:00",
        "description": {
            "lang": "en",
            "value": "The IPTables firewall in OpenStack Neutron before 7.0.4 and 8.0.0 through 8.1.0 allows remote attackers to bypass an intended DHCP-spoofing protection mechanism and consequently cause a denial of service or intercept network traffic via a crafted DHCP discovery message."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-5363",
        "datePublished": "2016-06-17T15:00:00",
        "description": {
            "lang": "en",
            "value": "The IPTables firewall in OpenStack Neutron before 7.0.4 and 8.0.0 through 8.1.0 allows remote attackers to bypass an intended MAC-spoofing protection mechanism and consequently cause a denial of service or intercept network traffic via (1) a crafted DHCP discovery message or (2) crafted non-IP traffic."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-5426",
        "datePublished": "2016-09-21T14:00:00",
        "description": {
            "lang": "en",
            "value": "PowerDNS (aka pdns) Authoritative Server before 3.4.10 allows remote attackers to cause a denial of service (backend CPU consumption) via a long qname."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-5427",
        "datePublished": "2016-09-21T14:00:00",
        "description": {
            "lang": "en",
            "value": "PowerDNS (aka pdns) Authoritative Server before 3.4.10 does not properly handle a . (dot) inside labels, which allows remote attackers to cause a denial of service (backend CPU consumption) via a crafted DNS query."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-5435",
        "datePublished": "2016-06-24T17:00:00",
        "description": {
            "lang": "en",
            "value": "Memory leak in Huawei IPS Module, NGFW Module, NIP6300, NIP6600, and Secospace USG6300, USG6500, USG6600, USG9500, and AntiDDoS8000 V500R001C00 before V500R001C20SPC100, when in hot standby networking where two devices are not directly connected, allows remote attackers to cause a denial of service (memory consumption and reboot) via a crafted packet."
        },
        "metrics": [],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2016-5648",
        "datePublished": "2017-06-08T20:00:00",
        "description": {
            "lang": "en",
            "value": "Acer Portal app before 3.9.4.2000 for Android does not properly validate SSL certificates, which allows remote attackers to perform a Man-in-the-middle attack via a crafted SSL certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-5654",
        "datePublished": "2016-07-19T22:00:00",
        "description": {
            "lang": "en",
            "value": "Misys FusionCapital Opics Plus allows remote authenticated users to gain privileges via a man-in-the-middle attack that modifies the xmlMessageOut parameter."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-5655",
        "datePublished": "2016-07-19T22:00:00",
        "description": {
            "lang": "en",
            "value": "Misys FusionCapital Opics Plus does not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-5669",
        "datePublished": "2016-08-03T01:00:00",
        "description": {
            "lang": "en",
            "value": "Crestron Electronics DM-TXRX-100-STR devices with firmware before 1.3039.00040 use a hardcoded 0xb9eed4d955a59eb3 X.509 certificate from an OpenSSL Test Certification Authority, which makes it easier for remote attackers to conduct man-in-the-middle attacks against HTTPS sessions by leveraging the certificate's trust relationship."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-5672",
        "datePublished": "2016-08-01T01:00:00",
        "description": {
            "lang": "en",
            "value": "Intel Crosswalk before 19.49.514.5, 20.x before 20.50.533.11, 21.x before 21.51.546.0, and 22.x before 22.51.549.0 interprets a user's acceptance of one invalid X.509 certificate to mean that all invalid X.509 certificates should be accepted without prompting, which makes it easier for man-in-the-middle attackers to spoof SSL servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-5711",
        "datePublished": "2017-02-07T17:00:00",
        "description": {
            "lang": "en",
            "value": "NetApp Virtual Storage Console for VMware vSphere before 6.2.1 uses a non-unique certificate, which allows remote attackers to conduct man-in-the-middle attacks via unspecified vectors."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-5720",
        "datePublished": "2017-01-23T21:00:00",
        "description": {
            "lang": "en",
            "value": "Multiple untrusted search path vulnerabilities in Microsoft Skype allow local users to execute arbitrary code and conduct DLL hijacking attacks via a Trojan horse (1) msi.dll, (2) dpapi.dll, or (3) cryptui.dll that is located in the current working directory."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-5736",
        "datePublished": "2016-08-19T21:00:00",
        "description": {
            "lang": "en",
            "value": "The default configuration of the IPsec IKE peer listener in F5 BIG-IP LTM, Analytics, APM, ASM, and Link Controller 11.2.1 before HF16, 11.4.x, 11.5.x before 11.5.4 HF2, 11.6.x before 11.6.1, and 12.x before 12.0.0 HF2; BIG-IP AAM, AFM, and PEM 11.4.x, 11.5.x before 11.5.4 HF2, 11.6.x before 11.6.1, and 12.x before 12.0.0 HF2; BIG-IP DNS 12.x before 12.0.0 HF2; BIG-IP Edge Gateway, WebAccelerator, and WOM 11.2.1 before HF16; BIG-IP GTM 11.2.1 before HF16, 11.4.x, 11.5.x before 11.5.4 HF2, and 11.6.x before 11.6.1; and BIG-IP PSM 11.4.0 through 11.4.1 improperly enables the anonymous IPsec IKE peer configuration object, which allows remote attackers to establish an IKE Phase 1 negotiation and possibly conduct brute-force attacks against Phase 2 negotiations via unspecified vectors."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-5740",
        "datePublished": "2016-12-15T06:31:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Open-Xchange OX App Suite before 7.8.2-rev5. JavaScript code can be used as part of ical attachments within scheduling E-Mails. This content, for example an appointment's location, will be presented to the user at the E-Mail App, depending on the invitation workflow. This code gets executed within the context of the user's current session. Malicious script code can be executed within a user's context. This can lead to session hijacking or triggering unwanted actions via the web interface (sending mail, deleting data etc.)."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-5933",
        "datePublished": "2017-03-08T19:00:00",
        "description": {
            "lang": "en",
            "value": "IBM Tivoli Monitoring 6.2 and 6.3 is vulnerable to possible host header injection attack that could lead to HTTP cache poisoning or firewall bypass. IBM Reference #: 1997223."
        },
        "metrics": [],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2016-6026",
        "datePublished": "2016-10-06T10:00:00",
        "description": {
            "lang": "en",
            "value": "The Configuration Manager in IBM Sterling Secure Proxy (SSP) 3.4.2 before 3.4.2.0 iFix 8 and 3.4.3 before 3.4.3.0 iFix 1 allows man-in-the-middle attackers to obtain sensitive information via an HTTP method that is neither GET nor POST."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-6167",
        "datePublished": "2017-01-30T22:00:00",
        "description": {
            "lang": "en",
            "value": "Multiple untrusted search path vulnerabilities in Putty beta 0.67 allow local users to execute arbitrary code and conduct DLL hijacking attacks via a Trojan horse (1) UxTheme.dll or (2) ntmarta.dll file in the current working directory."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-6170",
        "datePublished": "2016-07-06T14:00:00",
        "description": {
            "lang": "en",
            "value": "ISC BIND through 9.9.9-P1, 9.10.x through 9.10.4-P1, and 9.11.x through 9.11.0b1 allows primary DNS servers to cause a denial of service (secondary DNS server crash) via a large AXFR response, and possibly allows IXFR servers to cause a denial of service (IXFR client crash) via a large IXFR response and allows remote authenticated users to cause a denial of service (primary DNS server crash) via a large UPDATE message."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-6171",
        "datePublished": "2017-02-09T15:00:00",
        "description": {
            "lang": "en",
            "value": "Knot DNS before 2.3.0 allows remote DNS servers to cause a denial of service (memory exhaustion and slave server crash) via a large zone transfer for (1) DDNS, (2) AXFR, or (3) IXFR."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-6172",
        "datePublished": "2016-09-26T16:00:00",
        "description": {
            "lang": "en",
            "value": "PowerDNS (aka pdns) Authoritative Server before 4.0.1 allows remote primary DNS servers to cause a denial of service (memory exhaustion and secondary DNS server crash) via a large (1) AXFR or (2) IXFR response."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-6173",
        "datePublished": "2017-02-09T15:00:00",
        "description": {
            "lang": "en",
            "value": "NSD before 4.1.11 allows remote DNS master servers to cause a denial of service (/tmp disk consumption and slave server crash) via a zone transfer with unlimited data."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-6231",
        "datePublished": "2016-08-25T18:00:00",
        "description": {
            "lang": "en",
            "value": "Kaspersky Safe Browser iOS before 1.7.0 does not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-6271",
        "datePublished": "2017-01-18T22:00:00",
        "description": {
            "lang": "en",
            "value": "The Bzrtp library (aka libbzrtp) 1.0.x before 1.0.4 allows man-in-the-middle attackers to conduct spoofing attacks by leveraging a missing HVI check on DHPart2 packet reception."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-6374",
        "datePublished": "2016-09-22T22:00:00",
        "description": {
            "lang": "en",
            "value": "Cisco Cloud Services Platform (CSP) 2100 2.0 allows remote attackers to execute arbitrary code via a crafted dnslookup command in an HTTP request, aka Bug ID CSCuz89093."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-6380",
        "datePublished": "2016-10-05T20:00:00",
        "description": {
            "lang": "en",
            "value": "The DNS forwarder in Cisco IOS 12.0 through 12.4 and 15.0 through 15.6 and IOS XE 3.1 through 3.15 allows remote attackers to obtain sensitive information from process memory or cause a denial of service (data corruption or device reload) via a crafted DNS response, aka Bug ID CSCup90532."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-6412",
        "datePublished": "2016-09-24T01:00:00",
        "description": {
            "lang": "en",
            "value": "The Cisco Application-hosting Framework (CAF) component in Cisco IOS 15.6(1)T1 and IOS XE, when the IOx feature set is enabled, allows man-in-the-middle attackers to trigger arbitrary downloads via crafted HTTP headers, aka Bug ID CSCuz84773."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-6550",
        "datePublished": "2016-10-05T01:00:00",
        "description": {
            "lang": "en",
            "value": "The U by BB&T app 1.5.4 and earlier for iOS does not properly verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-6562",
        "datePublished": "2018-07-13T20:00:00",
        "description": {
            "lang": "en",
            "value": "On iOS and Android devices, the ShoreTel Mobility Client app version 9.1.3.109 fails to properly validate SSL certificates provided by HTTPS connections, which means that an attacker in the position to perform MITM attacks may be able to obtain sensitive account information such as login credentials."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-6585",
        "datePublished": "2020-01-08T18:17:46",
        "description": {
            "lang": "en",
            "value": "A Denial of Service vulnerability exists in Symantec Norton Mobile Security for Android prior to 3.16, which could let a remote malicious user conduct a man-in-the-middle attack via specially crafted JavaScript."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-6586",
        "datePublished": "2020-01-08T16:51:32",
        "description": {
            "lang": "en",
            "value": "A security bypass vulnerability exists in Symantec Norton Mobile Security for Android before 3.16, which could let a malicious user conduct a man-in-the-middle via specially crafted JavaScript to add arbitrary URLs to the URL whitelist."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-6709",
        "datePublished": "2016-11-25T16:00:00",
        "description": {
            "lang": "en",
            "value": "An information disclosure vulnerability in Conscrypt and BoringSSL in Android 6.x before 2016-11-01 and 7.0 before 2016-11-01 could enable a man-in-the-middle attacker to gain access to sensitive information if a non-standard cipher suite is used by an application. This issue is rated as High because it could be used to access data without permission. Android ID: A-31081987."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-6805",
        "datePublished": "2017-04-07T19:00:00",
        "description": {
            "lang": "en",
            "value": "Apache Ignite before 1.9 allows man-in-the-middle attackers to read arbitrary files via XXE in modified update-notifier documents."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-6842",
        "datePublished": "2016-12-15T06:31:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Open-Xchange OX App Suite before 7.8.2-rev8. Setting the user's name to JS code makes that code execute when selecting that user's \"Templates\" folder from OX Documents settings. This requires the folder to be shared to the victim. Malicious script code can be executed within a user's context. This can lead to session hijacking or triggering unwanted actions via the web interface (sending mail, deleting data etc.)."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-6843",
        "datePublished": "2016-12-15T06:31:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Open-Xchange OX App Suite before 7.8.2-rev8. Script code can be injected to contact names. When adding those contacts to a group, the script code gets executed in the context of the user which creates or changes the group by using autocomplete. In most cases this is a user with elevated permissions. Malicious script code can be executed within a user's context. This can lead to session hijacking or triggering unwanted actions via the web interface (sending mail, deleting data etc.)."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-6844",
        "datePublished": "2016-12-15T06:31:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Open-Xchange OX App Suite before 7.8.2-rev8. Script code within SVG files is maintained when opening such files \"in browser\" based on our Mail or Drive app. In case of \"a\" tags, this may include link targets with base64 encoded \"data\" references. Malicious script code can be executed within a user's context. This can lead to session hijacking or triggering unwanted actions via the web interface (sending mail, deleting data etc.)."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-6845",
        "datePublished": "2016-12-15T06:31:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Open-Xchange OX App Suite before 7.8.2-rev8. Script code within hyperlinks at HTML E-Mails is not getting correctly sanitized when using base64 encoded \"data\" resources. This allows an attacker to provide hyperlinks that may execute script code instead of directing to a proper location. Malicious script code can be executed within a user's context. This can lead to session hijacking or triggering unwanted actions via the web interface (sending mail, deleting data etc.)."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-6847",
        "datePublished": "2016-12-15T06:31:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Open-Xchange OX App Suite before 7.8.2-rev8. SVG files can be used as mp3 album covers. In case their XML structure contains script code, that code may get executed when calling the related cover URL. Malicious script code can be executed within a user's context. This can lead to session hijacking or triggering unwanted actions via the web interface (sending mail, deleting data etc.)."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-6850",
        "datePublished": "2016-12-15T06:31:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Open-Xchange OX App Suite before 7.8.2-rev8. SVG files can be used as profile pictures. In case their XML structure contains iframes and script code, that code may get executed when calling the related picture URL or viewing the related person's image within a browser. Malicious script code can be executed within a user's context. This can lead to session hijacking or triggering unwanted actions via the web interface (sending mail, deleting data etc.)."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-6851",
        "datePublished": "2016-12-15T06:31:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Open-Xchange OX Guard before 2.4.2-rev5. Script code can be provided as parameter to the OX Guard guest reader web application. This allows cross-site scripting attacks against arbitrary users since no prior authentication is needed. Malicious script code can be executed within a user's context. This can lead to session hijacking or triggering unwanted actions via the web interface (sending mail, deleting data etc.) in case the user has an active session on the same domain already."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-6853",
        "datePublished": "2016-12-15T06:31:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Open-Xchange OX Guard before 2.4.2-rev5. Script code and references to external websites can be injected to the names of PGP public keys. When requesting that key later on using a specific URL, such script code might get executed. In case of injecting external websites, users might get lured into a phishing scheme. Malicious script code can be executed within a user's context. This can lead to session hijacking or triggering unwanted actions via the web interface (sending mail, deleting data etc.)."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-6854",
        "datePublished": "2016-12-15T06:31:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Open-Xchange OX Guard before 2.4.2-rev5. Script code which got injected to a mail with inline PGP signature gets executed when verifying the signature. Malicious script code can be executed within a user's context. This can lead to session hijacking or triggering unwanted actions via the web interface (sending mail, deleting data etc.)."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-6876",
        "datePublished": "2016-09-07T19:00:00",
        "description": {
            "lang": "en",
            "value": "The RESOLV::lookup iRule command in F5 BIG-IP LTM, APM, ASM, and Link Controller 10.2.1 through 10.2.4, 11.2.1, 11.4.x, 11.5.x before 11.5.4 HF2, 11.6.x before 11.6.1, and 12.0.0 before HF3; BIG-IP AAM, AFM, and PEM 11.4.x, 11.5.x before 11.5.4 HF2, 11.6.x before 11.6.1, and 12.0.0 before HF3; BIG-IP Analytics 11.2.1, 11.4.x, 11.5.x before 11.5.4 HF2, 11.6.x before 11.6.1, and 12.0.0 before HF3; BIG-IP DNS 12.0.0 before HF3; BIG-IP Edge Gateway, WebAccelerator, and WOM 10.2.1 through 10.2.4 and 11.2.1; BIG-IP GTM 10.2.1 through 10.2.4, 11.2.1, 11.4.x, 11.5.x before 11.5.4 HF2, and 11.6.x before 11.6.1; and BIG-IP PSM 10.2.1 through 10.2.4 and 11.4.0 through 11.4.1 allows remote DNS servers to cause a denial of service (CPU consumption or Traffic Management Microkernel crash) via a crafted PTR response."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-6877",
        "datePublished": "2017-05-05T20:00:00",
        "description": {
            "lang": "en",
            "value": "Citrix XenMobile Server before 10.5.0.24 allows man-in-the-middle attackers to trigger HTTP 302 redirections via vectors involving the HTTP Host header and a cached page.  NOTE: the vendor reports \"our internal analysis of this issue concluded that this was not a valid vulnerability\" because an exploitation scenario would involve a man-in-the-middle attack against a TLS session"
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-7068",
        "datePublished": "2018-09-11T13:00:00",
        "description": {
            "lang": "en",
            "value": "An issue has been found in PowerDNS before 3.4.11 and 4.0.2, and PowerDNS recursor before 3.7.4 and 4.0.4, allowing a remote, unauthenticated attacker to cause an abnormal CPU usage load on the PowerDNS server by sending crafted DNS queries, which might result in a partial denial of service if the system becomes overloaded. This issue is based on the fact that the PowerDNS server parses all records present in a query regardless of whether they are needed or even legitimate. A specially crafted query containing a large number of records can be used to take advantage of that behaviour."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-7069",
        "datePublished": "2018-09-11T13:00:00",
        "description": {
            "lang": "en",
            "value": "An issue has been found in dnsdist before 1.2.0 in the way EDNS0 OPT records are handled when parsing responses from a backend. When dnsdist is configured to add EDNS Client Subnet to a query, the response may contain an EDNS0 OPT record that has to be removed before forwarding the response to the initial client. On a 32-bit system, the pointer arithmetic used when parsing the received response to remove that record might trigger an undefined behavior leading to a crash."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-7072",
        "datePublished": "2018-09-10T17:00:00",
        "description": {
            "lang": "en",
            "value": "An issue has been found in PowerDNS Authoritative Server before 3.4.11 and 4.0.2 allowing a remote, unauthenticated attacker to cause a denial of service by opening a large number of TCP connections to the web server. If the web server runs out of file descriptors, it triggers an exception and terminates the whole PowerDNS process. While it's more complicated for an unauthorized attacker to make the web server run out of file descriptors since its connection will be closed just after being accepted, it might still be possible."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-7073",
        "datePublished": "2018-09-11T13:00:00",
        "description": {
            "lang": "en",
            "value": "An issue has been found in PowerDNS before 3.4.11 and 4.0.2, and PowerDNS recursor before 4.0.4, allowing an attacker in position of man-in-the-middle to alter the content of an AXFR because of insufficient validation of TSIG signatures. A missing check of the TSIG time and fudge values was found in AXFRRetriever, leading to a possible replay attack."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns",
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-7074",
        "datePublished": "2018-09-11T13:00:00",
        "description": {
            "lang": "en",
            "value": "An issue has been found in PowerDNS before 3.4.11 and 4.0.2, and PowerDNS recursor before 4.0.4, allowing an attacker in position of man-in-the-middle to alter the content of an AXFR because of insufficient validation of TSIG signatures. A missing check that the TSIG record is the last one, leading to the possibility of parsing records that are not covered by the TSIG signature."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns",
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-7099",
        "datePublished": "2016-10-10T16:00:00",
        "description": {
            "lang": "en",
            "value": "The tls.checkServerIdentity function in Node.js 0.10.x before 0.10.47, 0.12.x before 0.12.16, 4.x before 4.6.0, and 6.x before 6.7.0 does not properly handle wildcards in name fields of X.509 certificates, which allows man-in-the-middle attackers to spoof servers via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-7209",
        "datePublished": "2016-11-10T06:16:00",
        "description": {
            "lang": "en",
            "value": "Microsoft Edge allows remote attackers to spoof web content via a crafted web site, aka \"Microsoft Edge Spoofing Vulnerability.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-7469",
        "datePublished": "2017-06-09T15:00:00",
        "description": {
            "lang": "en",
            "value": "A stored cross-site scripting (XSS) vulnerability in the Configuration utility device name change page in BIG-IP LTM, AAM, AFM, Analytics, APM, ASM, DNS, Edge Gateway, GTM, Link Controller, PEM, PSM, WebAccelerator, WOM and WebSafe version 12.0.0 - 12.1.2, 11.4.0 - 11.6.1, and 11.2.1 allows an authenticated user to inject arbitrary web script or HTML. Exploitation requires Resource Administrator or Administrator privileges, and it could cause the Configuration utility client to become unstable."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-7579",
        "datePublished": "2017-02-20T08:35:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in certain Apple products. iOS before 10.1 is affected. macOS before 10.12.1 is affected. tvOS before 10.0.1 is affected. The issue involves the \"CFNetwork Proxies\" component, which allows man-in-the-middle attackers to spoof a proxy password authentication requirement and obtain sensitive information."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-7636",
        "datePublished": "2017-02-20T08:35:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in certain Apple products. iOS before 10.2 is affected. macOS before 10.12.2 is affected. watchOS before 3.1.3 is affected. The issue involves the \"Security\" component, which allows man-in-the-middle attackers to cause a denial of service (application crash) via vectors related to OCSP responder URLs."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-7805",
        "datePublished": "2017-06-09T16:00:00",
        "description": {
            "lang": "en",
            "value": "The mobiGate App for Android version 2.2.1.2 and earlier and mobiGate App for iOS version 2.2.4.1 and earlier do not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-7812",
        "datePublished": "2017-08-02T16:00:00",
        "description": {
            "lang": "en",
            "value": "The Bank of Tokyo-Mitsubishi UFJ, Ltd. App for Android ver5.3.1, ver5.2.2 and earlier allow a man-in-the-middle attacker to downgrade the communication between the app and the server from TLS v1.2 to SSL v3.0, which may result in the attacker to eavesdrop on an encrypted communication."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-7816",
        "datePublished": "2017-06-09T16:00:00",
        "description": {
            "lang": "en",
            "value": "The Cybozu kintone mobile for Android 1.0.6 and earlier does not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-7993",
        "datePublished": "2017-01-28T01:33:00",
        "description": {
            "lang": "en",
            "value": "A bug in util-print.c:relts_print() in tcpdump before 4.9.0 could cause a buffer overflow in multiple protocol parsers (DNS, DVMRP, HSRP, IGMP, lightweight resolver protocol, PIM)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-8022",
        "datePublished": "2017-03-14T22:00:00",
        "description": {
            "lang": "en",
            "value": "Authentication bypass by spoofing vulnerability in Intel Security VirusScan Enterprise Linux (VSEL) 2.0.3 (and earlier) allows remote unauthenticated attacker to execute arbitrary code or cause a denial of service via a crafted authentication cookie."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-8024",
        "datePublished": "2017-03-14T22:00:00",
        "description": {
            "lang": "en",
            "value": "Improper neutralization of CRLF sequences in HTTP headers vulnerability in Intel Security VirusScan Enterprise Linux (VSEL) 2.0.3 (and earlier) allows remote unauthenticated attacker to obtain sensitive information via the server HTTP response spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-8237",
        "datePublished": "2017-04-10T19:00:00",
        "description": {
            "lang": "en",
            "value": "Remote code execution in Lenovo Updates (not Lenovo System Update) allows man-in-the-middle attackers to execute arbitrary code."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-8273",
        "datePublished": "2017-04-02T20:00:00",
        "description": {
            "lang": "en",
            "value": "Huawei PC client software HiSuite 4.0.5.300_OVE uses insecure HTTP for upgrade software package download and does not check the integrity of the software package before installing; an attacker can launch an MITM attack to interrupt or replace the downloaded software package and further compromise the PC."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-8358",
        "datePublished": "2017-02-13T22:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Smiths-Medical CADD-Solis Medication Safety Software, Version 1.0; 2.0; 3.0; and 3.1. The affected software does not verify the identities at communication endpoints, which may allow a man-in-the-middle attacker to gain access to the communication channel between endpoints."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-8495",
        "datePublished": "2017-02-13T15:00:00",
        "description": {
            "lang": "en",
            "value": "An improper certificate validation vulnerability in Fortinet FortiManager 5.0.6 through 5.2.7 and 5.4.0 through 5.4.1 allows remote attacker to spoof a trusted entity by using a man-in-the-middle (MITM) attack via the Fortisandbox devices probing feature."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2016-8798",
        "datePublished": "2017-04-02T20:00:00",
        "description": {
            "lang": "en",
            "value": "Huawei USG5500 with software V300R001C00 and V300R001C00 allows attackers to bypass the anti-DDoS module of the USGs to cause a denial of service condition on the backend server."
        },
        "metrics": [],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2016-9014",
        "datePublished": "2016-12-09T20:00:00",
        "description": {
            "lang": "en",
            "value": "Django before 1.8.x before 1.8.16, 1.9.x before 1.9.11, and 1.10.x before 1.10.3, when settings.DEBUG is True, allow remote attackers to conduct DNS rebinding attacks by leveraging failure to validate the HTTP Host header against settings.ALLOWED_HOSTS."
        },
        "metrics": [],
        "tags": [
            "dns",
            "rebinding attack"
        ]
    },
    {
        "cveId": "CVE-2016-9015",
        "datePublished": "2017-01-11T16:00:00",
        "description": {
            "lang": "en",
            "value": "Versions 1.17 and 1.18 of the Python urllib3 library suffer from a vulnerability that can cause them, in certain configurations, to not correctly validate TLS certificates. This places users of the library with those configurations at risk of man-in-the-middle and information leakage attacks. This vulnerability affects users using versions 1.17 and 1.18 of the urllib3 library, who are using the optional PyOpenSSL support for TLS instead of the regular standard library TLS backend, and who are using OpenSSL 1.1.0 via PyOpenSSL. This is an extremely uncommon configuration, so the security impact of this vulnerability is low."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-9064",
        "datePublished": "2018-06-11T21:00:00",
        "description": {
            "lang": "en",
            "value": "Add-on updates failed to verify that the add-on ID inside the signed package matched the ID of the add-on being updated. An attacker who could perform a man-in-the-middle attack on the user's connection to the update server and defeat the certificate pinning protection could provide a malicious signed add-on instead of a valid update. This vulnerability affects Firefox ESR < 45.5 and Firefox < 50."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-9076",
        "datePublished": "2018-06-11T21:00:00",
        "description": {
            "lang": "en",
            "value": "An issue where a \"<select>\" dropdown menu can be used to cover location bar content, resulting in potential spoofing attacks. This attack requires e10s to be enabled in order to function. This vulnerability affects Firefox < 50."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-9147",
        "datePublished": "2017-01-12T06:06:00",
        "description": {
            "lang": "en",
            "value": "named in ISC BIND 9.9.9-P4, 9.9.9-S6, 9.10.4-P4, and 9.11.0-P1 allows remote attackers to cause a denial of service (assertion failure and daemon exit) via a response containing an inconsistency among the DNSSEC-related RRsets."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2016-9450",
        "datePublished": "2016-11-25T18:00:00",
        "description": {
            "lang": "en",
            "value": "The user password reset form in Drupal 8.x before 8.2.3 allows remote attackers to conduct cache poisoning attacks by leveraging failure to specify a correct cache context."
        },
        "metrics": [],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2016-9460",
        "datePublished": "2017-03-28T02:46:00",
        "description": {
            "lang": "en",
            "value": "Nextcloud Server before 9.0.52 & ownCloud Server before 9.0.4 are vulnerable to a content-spoofing attack in the files app. The location bar in the files app was not verifying the passed parameters. An attacker could craft an invalid link to a fake directory structure and use this to display an attacker-controlled error message to the user."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-9467",
        "datePublished": "2017-03-28T02:46:00",
        "description": {
            "lang": "en",
            "value": "Nextcloud Server before 9.0.54 and 10.0.1 & ownCloud Server before 9.0.6 and 9.1.2 suffer from content spoofing in the files app. The location bar in the files app was not verifying the passed parameters. An attacker could craft an invalid link to a fake directory structure and use this to display an attacker-controlled error message to the user."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-9468",
        "datePublished": "2017-03-28T02:46:00",
        "description": {
            "lang": "en",
            "value": "Nextcloud Server before 9.0.54 and 10.0.1 & ownCloud Server before 9.0.6 and 9.1.2 suffer from content spoofing in the dav app. The exception message displayed on the DAV endpoints contained partially user-controllable input leading to a potential misrepresentation of information."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-9471",
        "datePublished": "2017-03-28T02:46:00",
        "description": {
            "lang": "en",
            "value": "Revive Adserver before 3.2.5 and 4.0.0 suffers from Special Element Injection. Usernames weren't properly sanitised when creating users on a Revive Adserver instance. Especially, control characters were not filtered, allowing apparently identical usernames to co-exist in the system, due to the fact that such characters are normally ignored when an HTML page is displayed in a browser. The issue could have therefore been exploited for user spoofing, although elevated privileges are required to create users within Revive Adserver."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-9473",
        "datePublished": "2017-03-28T02:46:00",
        "description": {
            "lang": "en",
            "value": "Brave Browser iOS before 1.2.18 and Brave Browser Android 1.9.56 and earlier suffer from Full Address Bar Spoofing, allowing attackers to trick a victim by displaying a malicious page for legitimate domain names."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-9562",
        "datePublished": "2016-11-23T02:00:00",
        "description": {
            "lang": "en",
            "value": "SAP NetWeaver AS JAVA 7.4 allows remote attackers to cause a Denial of Service (null pointer exception and icman outage) via an HTTPS request to the sap.com~P4TunnelingApp!web/myServlet URI, aka SAP Security Note 2313835."
        },
        "metrics": [],
        "tags": [
            "tunneling"
        ]
    },
    {
        "cveId": "CVE-2016-9565",
        "datePublished": "2016-12-15T22:00:00",
        "description": {
            "lang": "en",
            "value": "MagpieRSS, as used in the front-end component in Nagios Core before 4.2.2 might allow remote attackers to read or write to arbitrary files by spoofing a crafted response from the Nagios RSS feed server.  NOTE: this vulnerability exists because of an incomplete fix for CVE-2008-4796."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2016-9604",
        "datePublished": "2018-07-11T13:00:00",
        "description": {
            "lang": "en",
            "value": "It was discovered in the Linux kernel before 4.11-rc8 that root can gain direct access to an internal keyring, such as '.dns_resolver' in RHEL-7 or '.builtin_trusted_keys' upstream, by joining it as its session keyring. This allows root to bypass module signature verification by adding a new public key of its own devising to the keyring."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 4.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-9692",
        "datePublished": "2017-05-05T19:00:00",
        "description": {
            "lang": "en",
            "value": "IBM WebSphere Cast Iron Solution 7.0.0 and 7.5.0.0 is vulnerable to External Service Interaction attack, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability to induce the application to perform server-side DNS lookups or HTTP requests to arbitrary domain names. By submitting suitable payloads, an attacker can cause the application server to attack other systems that it can interact with. IBM X-Force ID: 119516."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2016-9697",
        "datePublished": "2017-03-20T16:00:00",
        "description": {
            "lang": "en",
            "value": "An unspecified vulnerability in IBM Rhapsody DM 4.0, 5.0, and 6.0 could allow an attacker to perform a JSON Hijacking Attack. A JSON Hijacking Attack may expose to an attacker information passed between the server and the browser. IBM Reference #: 1999960."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2016-9892",
        "datePublished": "2017-03-02T23:00:00",
        "description": {
            "lang": "en",
            "value": "The esets_daemon service in ESET Endpoint Antivirus for macOS before 6.4.168.0 and Endpoint Security for macOS before 6.4.168.0 does not properly verify X.509 certificates from the edf.eset.com SSL server, which allows man-in-the-middle attackers to spoof this server and provide crafted responses to license activation requests via a self-signed certificate.  NOTE: this issue can be combined with CVE-2016-0718 to execute arbitrary code remotely as root."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2016-9952",
        "datePublished": "2018-03-12T21:00:00",
        "description": {
            "lang": "en",
            "value": "The verify_certificate function in lib/vtls/schannel.c in libcurl 7.30.0 through 7.51.0, when built for Windows CE using the schannel TLS backend, makes it easier for remote attackers to conduct man-in-the-middle attacks via a crafted wildcard SAN in a server certificate, as demonstrated by \"*.com.\""
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    }
]