[
    {
        "cveId": "CVE-2018-0007",
        "datePublished": "2018-01-10T22:00:00",
        "description": {
            "lang": "en",
            "value": "An unauthenticated network-based attacker able to send a maliciously crafted LLDP packet to the local segment, through a local segment broadcast, may be able to cause a Junos device to enter an improper boundary check condition allowing a memory corruption to occur, leading to a denial of service. Further crafted packets may be able to sustain the denial of service condition. Score: 6.5 MEDIUM (CVSS:3.0/AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H) Further, if the attacker is authenticated on the target device receiving and processing the malicious LLDP packet, while receiving the crafted packets, the attacker may be able to perform command or arbitrary code injection over the target device thereby elevating their permissions and privileges, and taking control of the device. Score: 7.8 HIGH (CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H) An unauthenticated network-based attacker able to send a maliciously crafted LLDP packet to one or more local segments, via LLDP proxy / tunneling agents or other LLDP through Layer 3 deployments, through one or more local segment broadcasts, may be able to cause multiple Junos devices to enter an improper boundary check condition allowing a memory corruption to occur, leading to multiple distributed Denials of Services. These Denials of Services attacks may have cascading Denials of Services to adjacent connected devices, impacts network devices, servers, workstations, etc. Further crafted packets may be able to sustain these Denials of Services conditions. Score 6.8 MEDIUM (CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:N/A:H) Further, if the attacker is authenticated on one or more target devices receiving and processing these malicious LLDP packets, while receiving the crafted packets, the attacker may be able to perform command or arbitrary code injection over multiple target devices thereby elevating their permissions and privileges, and taking control multiple devices. Score: 7.8 HIGH (CVSS:3.0/AV:L/AC:H/PR:L/UI:N/S:C/C:H/I:H/A:H) Affected releases are Juniper Networks Junos OS: 12.1X46 versions prior to 12.1X46-D71; 12.3 versions prior to 12.3R12-S7; 12.3X48 versions prior to 12.3X48-D55; 14.1 versions prior to 14.1R8-S5, 14.1R9; 14.1X53 versions prior to 14.1X53-D46, 14.1X53-D50, 14.1X53-D107; 14.2 versions prior to 14.2R7-S9, 14.2R8; 15.1 versions prior to 15.1F2-S17, 15.1F5-S8, 15.1F6-S8, 15.1R5-S7, 15.1R7; 15.1X49 versions prior to 15.1X49-D90; 15.1X53 versions prior to 15.1X53-D65; 16.1 versions prior to 16.1R4-S6, 16.1R5; 16.1X65 versions prior to 16.1X65-D45; 16.2 versions prior to 16.2R2; 17.1 versions prior to 17.1R2. No other Juniper Networks products or platforms are affected by this issue."
        },
        "metrics": [],
        "tags": [
            "tunneling"
        ]
    },
    {
        "cveId": "CVE-2018-0025",
        "datePublished": "2018-07-11T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "When an SRX Series device is configured to use HTTP/HTTPS pass-through authentication services, a client sending authentication credentials in the initial HTTP/HTTPS session is at risk that these credentials may be captured during follow-on HTTP/HTTPS requests by a malicious actor through a man-in-the-middle attack or by authentic servers subverted by malicious actors. FTP, and Telnet pass-through authentication services are not affected. Affected releases are Juniper Networks SRX Series: 12.1X46 versions prior to 12.1X46-D67 on SRX Series; 12.3X48 versions prior to 12.3X48-D25 on SRX Series; 15.1X49 versions prior to 15.1X49-D35 on SRX Series."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.1,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-0057",
        "datePublished": "2018-10-10T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "On MX Series and M120/M320 platforms configured in a Broadband Edge (BBE) environment, subscribers logging in with DHCP Option 50 to request a specific IP address will be assigned the requested IP address, even if there is a static MAC to IP address binding in the access profile. In the problem scenario, with a hardware-address and IP address configured under address-assignment pool, if a subscriber logging in with DHCP Option 50, the subscriber will not be assigned an available address from the matched pool, but will still get the requested IP address. A malicious DHCP subscriber may be able to utilize this vulnerability to create duplicate IP address assignments, leading to a denial of service for valid subscribers or unauthorized information disclosure via IP address assignment spoofing. Affected releases are Juniper Networks Junos OS: 15.1 versions prior to 15.1R7-S2, 15.1R8; 16.1 versions prior to 16.1R4-S12, 16.1R7-S2, 16.1R8; 16.2 versions prior to 16.2R2-S7, 16.2R3; 17.1 versions prior to 17.1R2-S9, 17.1R3; 17.2 versions prior to 17.2R1-S7, 17.2R2-S6, 17.2R3; 17.3 versions prior to 17.3R2-S4, 17.3R3; 17.4 versions prior to 17.4R2; 18.1 versions prior to 18.1R2-S3, 18.1R3."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.1,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-0170",
        "datePublished": "2018-03-28T22:00:00",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the Cisco Umbrella Integration feature of Cisco IOS XE Software could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition, related to the OpenDNS software. The vulnerability is due to a logic error that exists when handling a malformed incoming packet, leading to access to an internal data structure after it has been freed. An attacker could exploit this vulnerability by sending crafted, malformed IP packets to an affected device. A successful exploit could allow the attacker to cause an affected device to reload, resulting in a DoS condition. Cisco Bug IDs: CSCvb86327."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-0234",
        "datePublished": "2018-05-02T22:00:00",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the implementation of Point-to-Point Tunneling Protocol (PPTP) functionality in Cisco Aironet 1810, 1830, and 1850 Series Access Points could allow an unauthenticated, remote attacker to cause an affected device to reload, resulting in a denial of service (DoS) condition. The vulnerability is due to insufficient validation of Generic Routing Encapsulation (GRE) frames that pass through the data plane of an affected access point. An attacker could exploit this vulnerability by initiating a PPTP connection to an affected access point from a device that is registered to the same wireless network as the access point and sending a malicious GRE frame through the data plane of the access point. A successful exploit could allow the attacker to cause the NSS core process on the affected access point to crash, which would cause the access point to reload and result in a DoS condition. This vulnerability affects Cisco Aironet 1810, 1830, and 1850 Series Access Points that are running Cisco Mobility Express Software Release 8.4.100.0, 8.5.103.0, or 8.5.105.0 and are configured as a master, subordinate, or standalone access point. Cisco Bug IDs: CSCvf73890."
        },
        "metrics": [],
        "tags": [
            "tunneling"
        ]
    },
    {
        "cveId": "CVE-2018-0412",
        "datePublished": "2018-08-15T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the implementation of Extensible Authentication Protocol over LAN (EAPOL) functionality in Cisco Small Business 100 Series Wireless Access Points and Cisco Small Business 300 Series Wireless Access Points could allow an unauthenticated, adjacent attacker to force the downgrade of the encryption algorithm that is used between an authenticator (access point) and a supplicant (Wi-Fi client). The vulnerability is due to the improper processing of certain EAPOL messages that are received during the Wi-Fi handshake process. An attacker could exploit this vulnerability by establishing a man-in-the-middle position between a supplicant and an authenticator and manipulating an EAPOL message exchange to force usage of a WPA-TKIP cipher instead of the more secure AES-CCMP cipher. A successful exploit could allow the attacker to conduct subsequent cryptographic attacks, which could lead to the disclosure of confidential information. Cisco Bug IDs: CSCvj29229."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-0434",
        "datePublished": "2018-10-05T14:00:00Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the Zero Touch Provisioning feature of the Cisco SD-WAN Solution could allow an unauthenticated, remote attacker to gain unauthorized access to sensitive data by using an invalid certificate. The vulnerability is due to insufficient certificate validation by the affected software. An attacker could exploit this vulnerability by supplying a crafted certificate to an affected device. A successful exploit could allow the attacker to conduct man-in-the-middle attacks to decrypt confidential information on user connections to the affected software."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-0518",
        "datePublished": "2018-02-23T15:00:00",
        "description": {
            "lang": "en",
            "value": "LINE for iOS version 7.1.3 to 7.1.5 does not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-0553",
        "datePublished": "2018-04-09T13:00:00",
        "description": {
            "lang": "en",
            "value": "The iRemoconWiFi App for Android version 4.1.7 and earlier does not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-0591",
        "datePublished": "2018-05-14T13:00:00",
        "description": {
            "lang": "en",
            "value": "The KINEPASS App for Android Ver 3.1.1 and earlier, and for iOS Ver 3.1.2 and earlier do not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-0611",
        "datePublished": "2018-06-26T14:00:00",
        "description": {
            "lang": "en",
            "value": "The ANA App for iOS version 4.0.22 and earlier does not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-0622",
        "datePublished": "2018-07-26T17:00:00",
        "description": {
            "lang": "en",
            "value": "The DHC Online Shop App for Android version 3.2.0 and earlier does not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-0650",
        "datePublished": "2018-09-07T14:00:00",
        "description": {
            "lang": "en",
            "value": "The LINE MUSIC for Android version 3.1.0 to versions prior to 3.6.5 does not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-0690",
        "datePublished": "2018-11-15T15:00:00",
        "description": {
            "lang": "en",
            "value": "An unvalidated software update vulnerability in Music Center for PC version 1.0.02 and earlier could allow a man-in-the-middle attacker to tamper with an update file and inject executable files."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-0691",
        "datePublished": "2018-11-15T15:00:00",
        "description": {
            "lang": "en",
            "value": "Multiple +Message Apps (Softbank +Message App for Android prior to version 10.1.7, Softbank +Message App for iOS prior to version 1.1.23, NTT DOCOMO +Message App for Android prior to version 42.40.2800, NTT DOCOMO +Message App for iOS prior to version 1.1.23, KDDI +Message App for Android prior to version 1.0.6, and KDDI +Message App for iOS prior to version 1.1.23) do not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-0819",
        "datePublished": "2018-01-10T01:00:00Z",
        "description": {
            "lang": "en",
            "value": "Microsoft Office 2016 for Mac allows an attacker to send a specially crafted email attachment to a user in an attempt to launch a social engineering attack, such as phishing, due to how Outlook for Mac displays encoded email addresses, aka \"Spoofing Vulnerability in Microsoft Office for Mac.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-1000002",
        "datePublished": "2018-01-22T18:00:00",
        "description": {
            "lang": "en",
            "value": "Improper input validation bugs in DNSSEC validators components in Knot Resolver (prior version 1.5.2) allow attacker in man-in-the-middle position to deny existence of some data in DNS via packet replay."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dnssec",
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-1000003",
        "datePublished": "2018-01-22T18:00:00",
        "description": {
            "lang": "en",
            "value": "Improper input validation bugs in DNSSEC validators components in PowerDNS version 4.1.0 allow attacker in man-in-the-middle position to deny existence of some data in DNS via packet replay."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dnssec",
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-1000021",
        "datePublished": "2018-02-09T23:00:00",
        "description": {
            "lang": "en",
            "value": "GIT version 2.15.1 and earlier contains a Input Validation Error vulnerability in Client that can result in problems including messing up terminal configuration to RCE. This attack appear to be exploitable via The user must interact with a malicious git server, (or have their traffic modified in a MITM attack)."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-1000087",
        "datePublished": "2018-03-13T15:00:00",
        "description": {
            "lang": "en",
            "value": "WolfCMS version version 0.8.3.1 contains a Reflected Cross Site Scripting vulnerability in \"Create New File\" and \"Create New Directory\" input box from 'files' Tab that can result in Session Hijacking, Spread Worms,Control the browser remotely. . This attack appear to be exploitable via Attacker can execute the JavaScript into the \"Create New File\" and \"Create New Directory\" input box from 'files'."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-1000096",
        "datePublished": "2018-03-13T01:00:00",
        "description": {
            "lang": "en",
            "value": "brianleroux tiny-json-http version all versions since commit 9b8e74a232bba4701844e07bcba794173b0238a8 (Oct 29 2016) contains a Missing SSL certificate validation vulnerability in The libraries core functionality is affected. that can result in Exposes the user to man-in-the-middle attacks."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-1000135",
        "datePublished": "2018-03-20T13:00:00",
        "description": {
            "lang": "en",
            "value": "GNOME NetworkManager version 1.10.2 and earlier contains a Information Exposure (CWE-200) vulnerability in DNS resolver that can result in Private DNS queries leaked to local network's DNS servers, while on VPN. This vulnerability appears to have been fixed in Some Ubuntu 16.04 packages were fixed, but later updates removed the fix. cf. https://bugs.launchpad.net/ubuntu/+bug/1754671 an upstream fix does not appear to be available at this time."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-1000519",
        "datePublished": "2018-06-26T16:00:00",
        "description": {
            "lang": "en",
            "value": "aio-libs aiohttp-session contains a Session Fixation vulnerability in load_session function for RedisStorage (see: https://github.com/aio-libs/aiohttp-session/blob/master/aiohttp_session/redis_storage.py#L42) that can result in Session Hijacking. This attack appear to be exploitable via Any method that allows setting session cookies (?session=<>, or meta tags or script tags with Set-Cookie)."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-1000664",
        "datePublished": "2018-09-06T17:00:00Z",
        "description": {
            "lang": "en",
            "value": "daneren2005 DSub for Subsonic (Android client) version 5.4.1 contains a CWE-295: Improper Certificate Validation vulnerability in HTTPS Client that can result in Any non-CA signed server certificate, including self signed and expired, are accepted by the client. This attack appear to be exploitable via The victim connects to a server that's MITM/Proxied by an attacker."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-1000846",
        "datePublished": "2018-12-20T15:00:00Z",
        "description": {
            "lang": "en",
            "value": "FreshDNS version 1.0.3 and earlier contains a Cross ite Request Forgery (CSRF) vulnerability in All (authenticated) API calls in index.php / class.manager.php that can result in Editing domains and zones with victim's privileges. This attack appear to be exploitable via Victim must open a website containing attacker's javascript. This vulnerability appears to have been fixed in 1.0.5 and later."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-1000847",
        "datePublished": "2018-12-20T15:00:00Z",
        "description": {
            "lang": "en",
            "value": "FreshDNS version 1.0.3 and prior contains a Cross Site Scripting (XSS) vulnerability in Account data form; Zone editor that can result in Execution of attacker's JavaScript code in victim's session. This attack appear to be exploitable via The attacker stores a specially crafted string as their Full Name in their account details. The victim (e.g. the administrator of the FreshDNS instance) opens the User List in the admin interface.. This vulnerability appears to have been fixed in 1.0.5 and later."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-1002103",
        "datePublished": "2018-12-05T21:00:00Z",
        "description": {
            "lang": "en",
            "value": "In Minikube versions 0.3.0-0.29.0, minikube exposes the Kubernetes Dashboard listening on the VM IP at port 30000. In VM environments where the IP is easy to predict, the attacker can use DNS rebinding to indirectly make requests to the Kubernetes Dashboard, create a new Kubernetes Deployment running arbitrary code. If minikube mount is in use, the attacker could also directly access the host filesystem."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.1,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-10080",
        "datePublished": "2018-04-13T04:00:00Z",
        "description": {
            "lang": "en",
            "value": "Secutech RiS-11, RiS-22, and RiS-33 devices with firmware V5.07.52_es_FRI01 allow DNS settings changes via a goform/AdvSetDns?GO=wan_dns.asp request in conjunction with a crafted admin cookie."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-10252",
        "datePublished": "2018-05-14T14:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on Actiontec WCB6200Q before 1.1.10.20a devices. The admin login session cookie is insecurely generated making admin session hijacking possible. When an admin logs in, a session cookie is generated using the time of day rounded to 10ms. Since the web server returns its current time of day in responses, it is possible to step backward through possible session values until a working one is found. Once a working session ID is found, an attacker then has admin control of the device and can add a secondary SSID to create a backdoor to the network."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-10377",
        "datePublished": "2018-06-17T16:00:00",
        "description": {
            "lang": "en",
            "value": "PortSwigger Burp Suite before 1.7.34 has Improper Certificate Validation of the Collaborator server certificate, which might allow man-in-the-middle attackers to obtain interaction data."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-10531",
        "datePublished": "2019-07-10T15:32:21",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in the America's Army Proving Grounds platform for the Unreal Engine. With a false packet sent via UDP, the application server responds with several bytes, giving the possibility of DoS amplification, even being able to be used in DDoS attacks."
        },
        "metrics": [],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2018-10694",
        "datePublished": "2019-06-07T19:24:46",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on Moxa AWK-3121 1.14 devices. The device provides a Wi-Fi connection that is open and does not use any encryption mechanism by default. An administrator who uses the open wireless connection to set up the device can allow an attacker to sniff the traffic passing between the user's computer and the device. This can allow an attacker to steal the credentials passing over the HTTP connection as well as TELNET traffic. Also an attacker can MITM the response and infect a user's computer very easily as well."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-10698",
        "datePublished": "2019-06-07T19:33:42",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on Moxa AWK-3121 1.14 devices. The device enables an unencrypted TELNET service by default. This allows an attacker who has been able to gain an MITM position to easily sniff the traffic between the device and the user. Also an attacker can easily connect to the TELNET daemon using the default credentials if they have not been changed by the user."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-10825",
        "datePublished": "2018-05-15T04:00:00",
        "description": {
            "lang": "en",
            "value": "Mimo Baby 2 devices do not use authentication or encryption for the Bluetooth Low Energy (BLE) communication from a Turtle to a Lilypad, which allows attackers to inject fake information about the position and temperature of a baby via a replay or spoofing attack."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-10851",
        "datePublished": "2018-11-29T18:00:00",
        "description": {
            "lang": "en",
            "value": "PowerDNS Authoritative Server 3.3.0 up to 4.1.4 excluding 4.1.5 and 4.0.6, and PowerDNS Recursor 3.2 up to 4.1.4 excluding 4.1.5 and 4.0.9, are vulnerable to a memory leak while parsing malformed records that can lead to remote denial of service."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-10884",
        "datePublished": "2018-08-22T14:00:00",
        "description": {
            "lang": "en",
            "value": "Ansible Tower before versions 3.1.8 and 3.2.6 is vulnerable to cross-site request forgery (CSRF) in awx/api/authentication.py. An attacker could exploit this by tricking already authenticated users into visiting a malicious site and hijacking the authtoken cookie."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-10896",
        "datePublished": "2018-08-01T17:00:00",
        "description": {
            "lang": "en",
            "value": "The default cloud-init configuration, in cloud-init 0.6.2 and newer, included \"ssh_deletekeys: 0\", disabling cloud-init's deletion of ssh host keys. In some environments, this could lead to instances created by cloning a golden master or template system, sharing ssh host keys, and being able to impersonate one another or conduct man-in-the-middle attacks."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 4.6,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-10920",
        "datePublished": "2018-08-02T13:00:00",
        "description": {
            "lang": "en",
            "value": "Improper input validation bug in DNS resolver component of Knot Resolver before 2.4.1 allows remote attacker to poison cache."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-10936",
        "datePublished": "2018-08-30T13:00:00",
        "description": {
            "lang": "en",
            "value": "A weakness was found in postgresql-jdbc before version 42.2.5. It was possible to provide an SSL Factory and not check the host name if a host name verifier was not provided to the driver. This could lead to a condition where a man-in-the-middle attacker could masquerade as a trusted server by providing a certificate for the wrong host, as long as it was signed by a trusted CA."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.1,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-11076",
        "datePublished": "2018-11-26T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "Dell EMC Avamar Server versions 7.2.0, 7.2.1, 7.3.0, 7.3.1, 7.4.0 and 7.4.1 and Dell EMC Integrated Data Protection Appliance (IDPA) 2.0 are affected by an information exposure vulnerability. Avamar Java management console's SSL/TLS private key may be leaked in the Avamar Java management client package. The private key could potentially be used by an unauthenticated attacker on the same data-link layer to initiate a MITM attack on management console users."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-11078",
        "datePublished": "2018-09-11T19:00:00Z",
        "description": {
            "lang": "en",
            "value": "Dell EMC VPlex GeoSynchrony, versions prior to 6.1, contains an Insecure File Permissions vulnerability. A remote authenticated malicious user could read from VPN configuration files on and potentially author a MITM attack on the VPN traffic."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-11087",
        "datePublished": "2018-09-14T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "Pivotal Spring AMQP, 1.x versions prior to 1.7.10 and 2.x versions prior to 2.0.6, expose a man-in-the-middle vulnerability due to lack of hostname validation. A malicious user that has the ability to intercept traffic would be able to view data in transit."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-11314",
        "datePublished": "2018-07-03T00:00:00",
        "description": {
            "lang": "en",
            "value": "The External Control API in Roku and Roku TV products allow unauthorized access via a DNS Rebind attack. This can result in remote device control and privileged device and network information to be exfiltrated by an attacker."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-11315",
        "datePublished": "2018-05-20T13:00:00",
        "description": {
            "lang": "en",
            "value": "The Local HTTP API in Radio Thermostat CT50 and CT80 1.04.84 and below products allows unauthorized access via a DNS rebinding attack. This can result in remote device temperature control, as demonstrated by a tstat t_heat request that accesses a device purchased in the Spring of 2018, and sets a home's target temperature to 95 degrees Fahrenheit. This vulnerability might be described as an addendum to CVE-2013-4860."
        },
        "metrics": [],
        "tags": [
            "dns",
            "rebinding attack"
        ]
    },
    {
        "cveId": "CVE-2018-11316",
        "datePublished": "2018-07-03T16:00:00",
        "description": {
            "lang": "en",
            "value": "The UPnP HTTP server on Sonos wireless speaker products allow unauthorized access via a DNS rebinding attack. This can result in remote device control and privileged device and network information to be exfiltrated by an attacker."
        },
        "metrics": [],
        "tags": [
            "dns",
            "rebinding attack"
        ]
    },
    {
        "cveId": "CVE-2018-11338",
        "datePublished": "2018-07-31T14:00:00",
        "description": {
            "lang": "en",
            "value": "Intuit Lacerte 2017 for Windows in a client/server environment transfers the entire customer list in cleartext over SMB, which allows attackers to (1) obtain sensitive information by sniffing the network or (2) conduct man-in-the-middle (MITM) attacks via unspecified vectors. The customer list contains each customer's full name, social security number (SSN), address, job title, phone number, Email address, spouse's phone/Email address, and other sensitive information. After the client software authenticates to the server database, the server sends the customer list. There is no need for further exploitation as all sensitive data is exposed. This vulnerability was validated on Intuit Lacerte 2017, however older versions of Lacerte may be vulnerable."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-11347",
        "datePublished": "2018-12-04T17:00:00",
        "description": {
            "lang": "en",
            "value": "The YunoHost 2.7.2 through 2.7.14 web application is affected by one HTTP Response Header Injection. This flaw allows an attacker to inject, into the response from the server, one or several HTTP Header. It requires an interaction with the user to send him the malicious link. It could be used to perform other attacks such as user redirection to a malicious website, HTTP response splitting, or HTTP cache poisoning."
        },
        "metrics": [],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2018-11356",
        "datePublished": "2018-05-22T21:00:00",
        "description": {
            "lang": "en",
            "value": "In Wireshark 2.6.0, 2.4.0 to 2.4.6, and 2.2.0 to 2.2.14, the DNS dissector could crash. This was addressed in epan/dissectors/packet-dns.c by avoiding a NULL pointer dereference for an empty name in an SRV record."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-11551",
        "datePublished": "2018-06-01T17:00:00",
        "description": {
            "lang": "en",
            "value": "AXON PBX 2.02 contains a DLL hijacking vulnerability that could allow an unauthenticated, remote attacker to execute arbitrary code on a targeted system. The vulnerability exists because a DLL file is loaded by 'pbxsetup.exe' improperly."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-11560",
        "datePublished": "2018-06-23T19:00:00",
        "description": {
            "lang": "en",
            "value": "The webService binary on Insteon HD IP Camera White 2864-222 devices has a stack-based Buffer Overflow leading to Control-Flow Hijacking via a crafted usr key, as demonstrated by a long remoteIp parameter to cgi-bin/CGIProxy.fcgi on port 34100."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-11775",
        "datePublished": "2018-09-10T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "TLS hostname verification when using the Apache ActiveMQ Client before 5.15.6 was missing which could make the client vulnerable to a MITM attack between a Java application using the ActiveMQ client and the ActiveMQ server. This is now enabled by default."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-12123",
        "datePublished": "2018-11-28T17:00:00",
        "description": {
            "lang": "en",
            "value": "Node.js: All versions prior to Node.js 6.15.0, 8.14.0, 10.14.0 and 11.3.0: Hostname spoofing in URL parser for javascript protocol: If a Node.js application is using url.parse() to determine the URL hostname, that hostname can be spoofed by using a mixed case \"javascript:\" (e.g. \"javAscript:\") protocol (other protocols are not affected). If security decisions are made about the URL based on the hostname, they may be incorrect."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-12257",
        "datePublished": "2018-06-12T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on Momentum Axel 720P 5.1.8 devices. There is Authenticated Custom Firmware Upgrade via DNS Hijacking. An authenticated root user with CLI access is able to remotely upgrade firmware to a custom image due to lack of SSL validation by changing the nameservers in /etc/resolv.conf to the attacker's server, and serving the expected HTTPS response containing new firmware for the device to download."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dns hijacking",
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-12331",
        "datePublished": "2018-06-17T16:00:00",
        "description": {
            "lang": "en",
            "value": "Authentication Bypass by Spoofing vulnerability in ECOS System Management Appliance (aka SMA) 5.2.68 allows a man-in-the-middle attacker to compromise authentication keys and configurations via IP spoofing during \"Easy Enrollment.\""
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-12449",
        "datePublished": "2018-10-11T13:00:00",
        "description": {
            "lang": "en",
            "value": "The Whale browser installer 0.4.3.0 and earlier versions allows DLL hijacking."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-12499",
        "datePublished": "2018-07-02T16:00:00",
        "description": {
            "lang": "en",
            "value": "The Motorola MBP853 firmware does not correctly validate server certificates. This allows for a Man in The Middle (MiTM) attack to take place between a Motorola MBP853 camera and the servers it communicates with. In one such instance, it was identified that the device was downloading what appeared to be a client certificate."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-12571",
        "datePublished": "2018-07-05T20:00:00",
        "description": {
            "lang": "en",
            "value": "uniquesig0/InternalSite/InitParams.aspx in Microsoft Forefront Unified Access Gateway 2010 allows remote attackers to trigger outbound DNS queries for arbitrary hosts via a comma-separated list of URLs in the orig_url parameter, possibly causing a traffic amplification and/or SSRF outcome."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-12716",
        "datePublished": "2018-06-25T02:00:00Z",
        "description": {
            "lang": "en",
            "value": "The API service on Google Home and Chromecast devices before mid-July 2018 does not prevent DNS rebinding attacks from reading the scan_results JSON data, which allows remote attackers to determine the physical location of most web browsers by leveraging the presence of one of these devices on its local network, extracting the scan_results bssid fields, and sending these fields in a geolocation/v1/geolocate Google Maps Geolocation API request."
        },
        "metrics": [],
        "tags": [
            "dns",
            "rebinding attack"
        ]
    },
    {
        "cveId": "CVE-2018-12804",
        "datePublished": "2018-07-20T19:00:00",
        "description": {
            "lang": "en",
            "value": "Adobe Connect versions 9.7.5 and earlier have an Authentication Bypass vulnerability. Successful exploitation could lead to session hijacking."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-13257",
        "datePublished": "2019-11-18T15:32:42",
        "description": {
            "lang": "en",
            "value": "The bb-auth-provider-cas authentication module within Blackboard Learn 2018-07-02 is susceptible to HTTP host header spoofing during Central Authentication Service (CAS) service ticket validation, enabling a phishing attack from the CAS server login page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-13280",
        "datePublished": "2018-07-30T12:00:00Z",
        "description": {
            "lang": "en",
            "value": "Use of insufficiently random values vulnerability in SYNO.Encryption.GenRandomKey in Synology DiskStation Manager (DSM) before 6.2-23739 allows man-in-the-middle attackers to compromise non-HTTPS sessions via unspecified vectors."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.4,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-13283",
        "datePublished": "2019-04-01T14:25:46.642947Z",
        "description": {
            "lang": "en",
            "value": "Lack of administrator control over security vulnerability in client.cgi in Synology SSL VPN Client before 1.2.5-0226 allows remote attackers to conduct man-in-the-middle attacks via the (1) command, (2) hostname, or (3) port parameter."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-13298",
        "datePublished": "2019-04-01T14:30:54.811398Z",
        "description": {
            "lang": "en",
            "value": "Channel accessible by non-endpoint vulnerability in privacy page in Synology Android Moments before 1.2.3-199 allows man-in-the-middle attackers to execute arbitrary code via unspecified vectors."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 4.2,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-13806",
        "datePublished": "2018-09-12T14:00:00Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability has been identified in SIEMENS TD Keypad Designer (All versions). A DLL hijacking vulnerability exists in all versions of SIEMENS TD Keypad Designer which could allow an attacker to execute code with the permission of the user running TD Designer. The attacker must have write access to the directory containing the TD project file in order to exploit the vulnerability. A legitimate user with higher privileges than the attacker must open the TD project in order for this vulnerability to be exploited. At the time of advisory publication no public exploitation of this security vulnerability was known."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-13897",
        "datePublished": "2019-07-25T16:33:17",
        "description": {
            "lang": "en",
            "value": "Clients hostname gets added to DNS record on device which is running dnsmasq resulting in an information exposure in Snapdragon Auto, Snapdragon Connectivity, Snapdragon Consumer IOT, Snapdragon Industrial IOT, Snapdragon IoT, Snapdragon Mobile, Snapdragon Wearables in MDM9206, MDM9607, MDM9640, MDM9650, MSM8909W, MSM8996AU, QCS605, SD 210/SD 212/SD 205, SD 615/16/SD 415, SD 625, SD 636, SD 650/52, SD 675, SD 712 / SD 710 / SD 670, SD 730, SD 820, SD 820A, SD 835, SD 855, SDA660, SDM630, SDM660"
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-14505",
        "datePublished": "2018-07-22T18:00:00",
        "description": {
            "lang": "en",
            "value": "mitmweb in mitmproxy v4.0.3 allows DNS Rebinding attacks, related to tools/web/app.py."
        },
        "metrics": [],
        "tags": [
            "dns",
            "mitm",
            "rebinding attack"
        ]
    },
    {
        "cveId": "CVE-2018-14607",
        "datePublished": "2018-07-26T22:00:00",
        "description": {
            "lang": "en",
            "value": "Thomson Reuters UltraTax CS 2017 on Windows, in a client/server configuration, transfers customer records and bank account numbers in cleartext over SMBv2, which allows attackers to (1) obtain sensitive information by sniffing the network or (2) conduct man-in-the-middle (MITM) attacks via unspecified vectors. The customer record transferred in cleartext contains: Client ID, Full Name, Spouse's Full Name, Social Security Number, Spouse's Social Security Number, Occupation, Spouse's Occupation, Daytime Phone, Home Phone, Tax Preparer, Federal and State Taxes to File, Bank Name, Bank Account Number, and possibly other sensitive information."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-14626",
        "datePublished": "2018-11-29T18:00:00",
        "description": {
            "lang": "en",
            "value": "PowerDNS Authoritative Server 4.1.0 up to 4.1.4 inclusive and PowerDNS Recursor 4.0.0 up to 4.1.4 inclusive are vulnerable to a packet cache pollution via crafted query that can lead to denial of service."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-14644",
        "datePublished": "2018-11-09T19:00:00",
        "description": {
            "lang": "en",
            "value": "An issue has been found in PowerDNS Recursor from 4.0.0 up to and including 4.1.4. A remote attacker sending a DNS query for a meta-type like OPT can lead to a zone being wrongly cached as failing DNSSEC validation. It only arises if the parent zone is signed, and all the authoritative servers for that parent zone answer with FORMERR to a query for at least one of the meta-types. As a result, subsequent queries from clients requesting DNSSEC validation will be answered with a ServFail."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2018-14663",
        "datePublished": "2018-11-26T22:00:00",
        "description": {
            "lang": "en",
            "value": "An issue has been found in PowerDNS DNSDist before 1.3.3 allowing a remote attacker to craft a DNS query with trailing data such that the addition of a record by dnsdist, for example an OPT record when adding EDNS Client Subnet, might result in the trailing data being smuggled to the backend as a valid record while not seen by dnsdist. This is an issue when dnsdist is deployed as a DNS Firewall and used to filter some records that should not be received by the backend. This issue occurs only when either the 'useClientSubnet' or the experimental 'addXPF' parameters are used when declaring a new backend."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-14773",
        "datePublished": "2018-08-03T17:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Http Foundation in Symfony 2.7.0 through 2.7.48, 2.8.0 through 2.8.43, 3.3.0 through 3.3.17, 3.4.0 through 3.4.13, 4.0.0 through 4.0.13, and 4.1.0 through 4.1.2. It arises from support for a (legacy) IIS header that lets users override the path in the request URL via the X-Original-URL or X-Rewrite-URL HTTP request header. These headers are designed for IIS support, but it's not verified that the server is in fact running IIS, which means anybody who can send these requests to an application can trigger this. This affects \\Symfony\\Component\\HttpFoundation\\Request::prepareRequestUri() where X-Original-URL and X_REWRITE_URL are both used. The fix drops support for these methods so that they cannot be used as attack vectors such as web cache poisoning."
        },
        "metrics": [],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2018-14812",
        "datePublished": "2018-10-24T21:00:00Z",
        "description": {
            "lang": "en",
            "value": "An uncontrolled search path element (DLL Hijacking) vulnerability has been identified in Fuji Electric Energy Savings Estimator versions V.1.0.2.0 and prior. Exploitation of this vulnerability could give an attacker access to the system with the same level of privilege as the application that utilizes the malicious DLL."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-15399",
        "datePublished": "2018-10-05T14:00:00Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the TCP syslog module of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to exhaust the 1550-byte buffers on an affected device, resulting in a denial of service (DoS) condition. The vulnerability is due to a missing boundary check in an internal function. An attacker could exploit this vulnerability by establishing a man-in-the-middle position between an affected device and its configured TCP syslog server and then maliciously modifying the TCP header in segments that are sent from the syslog server to the affected device. A successful exploit could allow the attacker to exhaust buffer on the affected device and cause all TCP-based features to stop functioning, resulting in a DoS condition. The affected TCP-based features include AnyConnect SSL VPN, clientless SSL VPN, and management connections such as Secure Shell (SSH), Telnet, and HTTPS."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-15476",
        "datePublished": "2018-08-30T17:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in myStrom WiFi Switch V1 before 2.66, WiFi Switch V2 before 3.80, WiFi Switch EU before 3.80, WiFi Bulb before 2.58, WiFi LED Strip before 3.80, WiFi Button before 2.73, and WiFi Button Plus before 2.73. The SSL/TLS server certificate in the device to cloud communication was not verified by the device. As a result, an attacker in control of the network traffic of a device could have taken control of a device by intercepting and modifying commands issued from the server to the device in a Man-in-the-Middle attack. This included the ability to inject firmware update commands into the communication and cause the device to install maliciously modified firmware."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-15752",
        "datePublished": "2018-10-02T18:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in the MensaMax (aka com.breustedt.mensamax) application 4.3 for Android. Cleartext Transmission of Sensitive Information allows man-in-the-middle attackers to eavesdrop authentication information between the application and the server."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-15784",
        "datePublished": "2019-01-18T22:00:00Z",
        "description": {
            "lang": "en",
            "value": "Dell Networking OS10 versions prior to 10.4.3.0 contain a vulnerability in the Phone Home feature which does not properly validate the server's certificate authority during TLS handshake. Use of an invalid or malicious certificate could potentially allow an attacker to spoof a trusted entity by using a man-in-the-middle (MITM) attack."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.4,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-15895",
        "datePublished": "2018-08-27T04:00:00",
        "description": {
            "lang": "en",
            "value": "An SSRF vulnerability was discovered in idreamsoft iCMS 7.0.11 because the remote function in app/spider/spider_tools.class.php does not block DNS hostnames associated with private and reserved IP addresses, as demonstrated by 127.0.0.1 in an A record. NOTE: this vulnerability exists because of an incomplete fix for CVE-2018-14858."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-15898",
        "datePublished": "2018-09-11T21:00:00",
        "description": {
            "lang": "en",
            "value": "The Subsonic Music Streamer application 4.4 for Android has Improper Certificate Validation of the Subsonic server certificate, which might allow man-in-the-middle attackers to obtain interaction data."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-15974",
        "datePublished": "2018-10-17T18:00:00",
        "description": {
            "lang": "en",
            "value": "Adobe Framemaker versions 1.0.5.1 and below have an insecure library loading (dll hijacking) vulnerability. Successful exploitation could lead to privilege escalation."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-15976",
        "datePublished": "2018-10-17T18:00:00",
        "description": {
            "lang": "en",
            "value": "Adobe Technical Communications Suite versions 1.0.5.1 and below have an insecure library loading (dll hijacking) vulnerability. Successful exploitation could lead to privilege escalation."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-15983",
        "datePublished": "2019-01-18T17:00:00",
        "description": {
            "lang": "en",
            "value": "Flash Player versions 31.0.0.153 and earlier, and 31.0.0.108 and earlier have an insecure library loading (dll hijacking) vulnerability. Successful exploitation could lead to privilege escalation."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-16179",
        "datePublished": "2019-01-09T22:00:00",
        "description": {
            "lang": "en",
            "value": "The Mizuho Direct App for Android version 3.13.0 and earlier does not verify server certificates, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-16187",
        "datePublished": "2019-01-09T22:00:00",
        "description": {
            "lang": "en",
            "value": "The RICOH Interactive Whiteboard D2200 V1.3 to V2.2, D5500 V1.3 to V2.2, D5510 V1.3 to V2.2, the display versions with RICOH Interactive Whiteboard Controller Type1 V1.3 to V2.2 attached (D5520, D6500, D6510, D7500, D8400), and the display versions with RICOH Interactive Whiteboard Controller Type2 V3.0 to V3.1.10137.0 attached (D5520, D6510, D7500, D8400) does not verify its server certificates, which allows man-in-the-middle attackers to eversdrop on encrypted communication."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-16499",
        "datePublished": "2021-05-26T18:45:44",
        "description": {
            "lang": "en",
            "value": "In VOS compromised, an attacker at network endpoints can possibly view communications between an unsuspecting user and the service using man-in-the-middle attacks. Usage of unapproved SSH encryption protocols or cipher suites also violates the Data Protection TSR (Technical Security Requirements)."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-16525",
        "datePublished": "2018-12-06T23:00:00",
        "description": {
            "lang": "en",
            "value": "Amazon Web Services (AWS) FreeRTOS through 1.3.1, FreeRTOS up to V10.0.1 (with FreeRTOS+TCP), and WITTENSTEIN WHIS Connect middleware TCP/IP component allow remote attackers to execute arbitrary code or leak information because of a Buffer Overflow during parsing of DNS\\LLMNR packets in prvParseDNSReply."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-16598",
        "datePublished": "2018-12-06T23:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Amazon Web Services (AWS) FreeRTOS through 1.3.1, FreeRTOS up to V10.0.1 (with FreeRTOS+TCP), and WITTENSTEIN WHIS Connect middleware TCP/IP component. In xProcessReceivedUDPPacket and prvParseDNSReply, any received DNS response is accepted, without confirming it matches a sent DNS request."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-16605",
        "datePublished": "2018-09-12T16:00:00",
        "description": {
            "lang": "en",
            "value": "D-Link DIR-600M devices allow XSS via the Hostname and Username fields in the Dynamic DNS Configuration page."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-16758",
        "datePublished": "2018-10-10T00:00:00",
        "description": {
            "lang": "en",
            "value": "Missing message authentication in the meta-protocol in Tinc VPN version 1.0.34 and earlier allows a man-in-the-middle attack to disable the encryption of VPN packets."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-16852",
        "datePublished": "2018-11-28T14:00:00",
        "description": {
            "lang": "en",
            "value": "Samba from version 4.9.0 and before version 4.9.3 is vulnerable to a NULL pointer de-reference. During the processing of an DNS zone in the DNS management DCE/RPC server, the internal DNS server or the Samba DLZ plugin for BIND9, if the DSPROPERTY_ZONE_MASTER_SERVERS property or DSPROPERTY_ZONE_SCAVENGING_SERVERS property is set, the server will follow a NULL pointer and terminate. There is no further vulnerability associated with this issue, merely a denial of service."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-16855",
        "datePublished": "2018-12-03T14:00:00",
        "description": {
            "lang": "en",
            "value": "An issue has been found in PowerDNS Recursor before version 4.1.8 where a remote attacker sending a DNS query can trigger an out-of-bounds memory read while computing the hash of the query for a packet cache lookup, possibly leading to a crash."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-16958",
        "datePublished": "2018-09-18T02:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Oracle WebCenter Interaction Portal 10.3.3. The ASP.NET_SessionID primary session cookie, when Internet Information Services (IIS) with ASP.NET is used, is not protected with the HttpOnly attribute. The attribute cannot be enabled by customers. Consequently, this cookie is exposed to session hijacking attacks should an adversary be able to execute JavaScript in the origin of the portal installation. NOTE: this CVE is assigned by MITRE and isn't validated by Oracle because Oracle WebCenter Interaction Portal is out of support."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-17004",
        "datePublished": "2018-09-13T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on TP-Link TL-WR886N 6.0 2.3.4 and TL-WR886N 7.0 1.1.0 devices. Authenticated attackers can crash router services (e.g., inetd, HTTP, DNS, and UPnP) via long JSON data for wlan_access name."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17005",
        "datePublished": "2018-09-13T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on TP-Link TL-WR886N 6.0 2.3.4 and TL-WR886N 7.0 1.1.0 devices. Authenticated attackers can crash router services (e.g., inetd, HTTP, DNS, and UPnP) via long JSON data for firewall dmz enable."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17006",
        "datePublished": "2018-09-13T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on TP-Link TL-WR886N 6.0 2.3.4 and TL-WR886N 7.0 1.1.0 devices. Authenticated attackers can crash router services (e.g., inetd, HTTP, DNS, and UPnP) via long JSON data for firewall lan_manage mac2."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17007",
        "datePublished": "2018-09-13T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on TP-Link TL-WR886N 6.0 2.3.4 and TL-WR886N 7.0 1.1.0 devices. Authenticated attackers can crash router services (e.g., inetd, HTTP, DNS, and UPnP) via long JSON data for wireless wlan_wds_2g ssid."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17008",
        "datePublished": "2018-09-13T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on TP-Link TL-WR886N 6.0 2.3.4 and TL-WR886N 7.0 1.1.0 devices. Authenticated attackers can crash router services (e.g., inetd, HTTP, DNS, and UPnP) via long JSON data for wireless wlan_host_2g power."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17009",
        "datePublished": "2018-09-13T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on TP-Link TL-WR886N 6.0 2.3.4 and TL-WR886N 7.0 1.1.0 devices. Authenticated attackers can crash router services (e.g., inetd, HTTP, DNS, and UPnP) via long JSON data for wireless wlan_host_2g isolate."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17010",
        "datePublished": "2018-09-13T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on TP-Link TL-WR886N 6.0 2.3.4 and TL-WR886N 7.0 1.1.0 devices. Authenticated attackers can crash router services (e.g., inetd, HTTP, DNS, and UPnP) via long JSON data for wireless wlan_host_2g bandwidth."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17011",
        "datePublished": "2018-09-13T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on TP-Link TL-WR886N 6.0 2.3.4 and TL-WR886N 7.0 1.1.0 devices. Authenticated attackers can crash router services (e.g., inetd, HTTP, DNS, and UPnP) via long JSON data for hosts_info para sun."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17012",
        "datePublished": "2018-09-13T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on TP-Link TL-WR886N 6.0 2.3.4 and TL-WR886N 7.0 1.1.0 devices. Authenticated attackers can crash router services (e.g., inetd, HTTP, DNS, and UPnP) via long JSON data for hosts_info set_block_flag up_limit."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17013",
        "datePublished": "2018-09-13T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on TP-Link TL-WR886N 6.0 2.3.4 and TL-WR886N 7.0 1.1.0 devices. Authenticated attackers can crash router services (e.g., inetd, HTTP, DNS, and UPnP) via long JSON data for protocol wan wan_rate."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17014",
        "datePublished": "2018-09-13T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on TP-Link TL-WR886N 6.0 2.3.4 and TL-WR886N 7.0 1.1.0 devices. Authenticated attackers can crash router services (e.g., inetd, HTTP, DNS, and UPnP) via long JSON data for ip_mac_bind name."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17015",
        "datePublished": "2018-09-13T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on TP-Link TL-WR886N 6.0 2.3.4 and TL-WR886N 7.0 1.1.0 devices. Authenticated attackers can crash router services (e.g., inetd, HTTP, DNS, and UPnP) via long JSON data for ddns phddns username."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17016",
        "datePublished": "2018-09-13T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on TP-Link TL-WR886N 6.0 2.3.4 and TL-WR886N 7.0 1.1.0 devices. Authenticated attackers can crash router services (e.g., inetd, HTTP, DNS, and UPnP) via long JSON data for reboot_timer name."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17017",
        "datePublished": "2018-09-13T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on TP-Link TL-WR886N 6.0 2.3.4 and TL-WR886N 7.0 1.1.0 devices. Authenticated attackers can crash router services (e.g., inetd, HTTP, DNS, and UPnP) via long JSON data for dhcpd udhcpd enable."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17018",
        "datePublished": "2018-09-13T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on TP-Link TL-WR886N 6.0 2.3.4 and TL-WR886N 7.0 1.1.0 devices. Authenticated attackers can crash router services (e.g., inetd, HTTP, DNS, and UPnP) via long JSON data for time_switch name."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17065",
        "datePublished": "2018-09-15T21:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on D-Link DIR-816 A2 1.10 B05 devices. Within the handler function of the /goform/DDNS route, a very long password could lead to a stack-based buffer overflow and overwrite the return address."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17187",
        "datePublished": "2018-11-13T15:00:00",
        "description": {
            "lang": "en",
            "value": "The Apache Qpid Proton-J transport includes an optional wrapper layer to perform TLS, enabled by use of the 'transport.ssl(...)' methods. Unless a verification mode was explicitly configured, client and server modes previously defaulted as documented to not verifying a peer certificate, with options to configure this explicitly or select a certificate verification mode with or without hostname verification being performed. The latter hostname verifying mode was not implemented in Apache Qpid Proton-J versions 0.3 to 0.29.0, with attempts to use it resulting in an exception. This left only the option to verify the certificate is trusted, leaving such a client vulnerable to Man In The Middle (MITM) attack. Uses of the Proton-J protocol engine which do not utilise the optional transport TLS wrapper are not impacted, e.g. usage within Qpid JMS. Uses of Proton-J utilising the optional transport TLS wrapper layer that wish to enable hostname verification must be upgraded to version 0.30.0 or later and utilise the VerifyMode#VERIFY_PEER_NAME configuration, which is now the default for client mode usage unless configured otherwise."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-17195",
        "datePublished": "2018-12-19T14:00:00",
        "description": {
            "lang": "en",
            "value": "The template upload API endpoint accepted requests from different domain when sent in conjunction with ARP spoofing + man in the middle (MiTM) attack, resulting in a CSRF attack. The required attack vector is complex, requiring a scenario with client certificate authentication, same subnet access, and injecting malicious code into an unprotected (plaintext HTTP) website which the targeted user later visits, but the possible damage warranted a Severe severity level. Mitigation: The fix to apply Cross-Origin Resource Sharing (CORS) policy request filtering was applied on the Apache NiFi 1.8.0 release. Users running a prior 1.x release should upgrade to the appropriate release."
        },
        "metrics": [],
        "tags": [
            "mitm",
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-17215",
        "datePublished": "2018-09-26T21:00:00",
        "description": {
            "lang": "en",
            "value": "An information-disclosure issue was discovered in Postman through 6.3.0. It validates a server's X.509 certificate and presents an error if the certificate is not valid. Unfortunately, the associated HTTPS request data is sent anyway. Only the response is not displayed. Thus, all contained information of the HTTPS request is disclosed to a man-in-the-middle attacker (for example, user credentials)."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-17419",
        "datePublished": "2019-03-07T22:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in setTA in scan_rr.go in the Miek Gieben DNS library before 1.0.10 for Go. A dns.ParseZone() parsing error causes a segmentation violation, leading to denial of service."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-17935",
        "datePublished": "2018-10-24T13:00:00Z",
        "description": {
            "lang": "en",
            "value": "All versions of Telecrane F25 Series Radio Controls before 00.0A use fixed codes that are reproducible by sniffing and re-transmission. This can lead to unauthorized replay of a command, spoofing of an arbitrary message, or keeping the controlled load in a permanent \"stop\" state."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-17938",
        "datePublished": "2018-10-03T08:00:00",
        "description": {
            "lang": "en",
            "value": "Zimbra Collaboration before 8.8.10 GA allows text content spoofing via a loginErrorCode value."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-18291",
        "datePublished": "2018-10-14T21:00:00Z",
        "description": {
            "lang": "en",
            "value": "A cross site scripting (XSS) vulnerability on ASUS RT-AC58U 3.0.0.4.380_6516 devices allows remote attackers to inject arbitrary web script or HTML via Advanced_ASUSDDNS_Content.asp, Advanced_WSecurity_Content.asp, Advanced_Wireless_Content.asp, Logout.asp, Main_Login.asp, MobileQIS_Login.asp, QIS_wizard.htma, YandexDNS.asp, ajax_status.xml, apply.cgi, clients.asp, disk.asp, disk_utility.asp, or internet.asp."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-18330",
        "datePublished": "2018-12-21T15:00:00",
        "description": {
            "lang": "en",
            "value": "An Address Bar Spoofing vulnerability in Trend Micro Dr. Safety for Android (Consumer) versions 3.0.1324 and below could allow an attacker to potentially trick a victim into visiting a malicious URL using address bar spoofing on the Private Browser of the app on vulnerable installations."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-18333",
        "datePublished": "2019-02-05T22:00:00",
        "description": {
            "lang": "en",
            "value": "A DLL hijacking vulnerability in Trend Micro Security 2019 (Consumer) versions below 15.0.0.1163 and below could allow an attacker to manipulate a specific DLL and escalate privileges on vulnerable installations."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-18364",
        "datePublished": "2019-02-08T17:00:00Z",
        "description": {
            "lang": "en",
            "value": "Symantec Ghost Solution Suite (GSS) versions prior to 3.3 RU1 may be susceptible to a DLL hijacking vulnerability, which is a type of issue whereby a potential attacker attempts to execute unexpected code on your machine. This occurs via placement of a potentially foreign file (DLL) that the attacker then attempts to run via a linked application."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-18365",
        "datePublished": "2019-04-09T19:04:35",
        "description": {
            "lang": "en",
            "value": "Norton Password Manager may be susceptible to an address spoofing issue. This type of issue may allow an attacker to disguise their origin IP address in order to obfuscate the source of network traffic."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-18567",
        "datePublished": "2018-10-24T22:00:00",
        "description": {
            "lang": "en",
            "value": "AudioCodes 440HD and 450HD devices 3.1.2.89 and earlier allows man-in-the-middle attackers to obtain sensitive credential information by leveraging failure to validate X.509 certificates when used with an on-premise installation with Skype for Business."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-18568",
        "datePublished": "2018-10-24T22:00:00",
        "description": {
            "lang": "en",
            "value": "Polycom VVX 500 and 601 devices 5.8.0.12848 and earlier allows man-in-the-middle attackers to obtain sensitive credential information by leveraging failure to validate X.509 certificates when used with an on-premise installation with Skype for Business."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-18767",
        "datePublished": "2018-12-20T22:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in D-Link 'myDlink Baby App' version 2.04.06. Whenever actions are performed from the app (e.g., change camera settings or play lullabies), it communicates directly with the Wi-Fi camera (D-Link 825L firmware 1.08) with the credentials (username and password) in base64 cleartext. An attacker could conduct an MitM attack on the local network and very easily obtain these credentials."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-18908",
        "datePublished": "2019-01-19T18:00:00",
        "description": {
            "lang": "en",
            "value": "The Sky Go Desktop application 1.0.19-1 through 1.0.23-1 for Windows performs several requests over cleartext HTTP. This makes the data submitted in these requests prone to Man in The Middle (MiTM) attacks, whereby an attacker would be able to obtain the data sent in these requests. Some of the requests contain potentially sensitive information that could be useful to an attacker, such as the victim's Sky username."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-18913",
        "datePublished": "2019-03-21T21:06:16",
        "description": {
            "lang": "en",
            "value": "Opera before 57.0.3098.106 is vulnerable to a DLL Search Order hijacking attack where an attacker can send a ZIP archive composed of an HTML page along with a malicious DLL to the target. Once the document is opened, it may allow the attacker to take full control of the system from any location within the system. The issue lies in the loading of the shcore.dll and dcomp.dll files: these files are being searched for by the program in the same system-wide directory where the HTML file is executed."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-18960",
        "datePublished": "2018-12-24T17:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on Epson WorkForce WF-2861 10.48 LQ22I3, 10.51.LQ20I6 and 10.52.LQ17IA devices. They use SNMP to find certain devices on the network, but the default version is v2c, allowing an amplification attack."
        },
        "metrics": [],
        "tags": [
            "amplification attack"
        ]
    },
    {
        "cveId": "CVE-2018-19007",
        "datePublished": "2018-12-14T20:00:00",
        "description": {
            "lang": "en",
            "value": "In Geutebrueck GmbH E2 Camera Series versions prior to 1.12.0.25 the DDNS configuration (in the Network Configuration panel) is vulnerable to an OS system command injection as root."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-19023",
        "datePublished": "2019-01-25T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "Hetronic Nova-M prior to verson r161 uses fixed codes that are reproducible by sniffing and re-transmission. This can lead to unauthorized replay of a command, spoofing of an arbitrary message, or keeping the controlled load in a permanent \"stop\" state."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-19081",
        "datePublished": "2018-11-07T18:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on Foscam Opticam i5 devices with System Firmware 1.5.2.11 and Application Firmware 2.21.1.128. The ONVIF devicemgmt SetDNS method allows remote attackers to execute arbitrary OS commands via the IPv4Address field."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-19082",
        "datePublished": "2018-11-07T18:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on Foscam Opticam i5 devices with System Firmware 1.5.2.11 and Application Firmware 2.21.1.128. The ONVIF devicemgmt SetDNS method allows remote attackers to conduct stack-based buffer overflow attacks via the IPv4Address field."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-19224",
        "datePublished": "2018-11-12T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in LAOBANCMS 2.0. /admin/login.php allows spoofing of the id and guanliyuan cookies."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-19278",
        "datePublished": "2018-11-14T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "Buffer overflow in DNS SRV and NAPTR lookups in Digium Asterisk 15.x before 15.6.2 and 16.x before 16.0.1 allows remote attackers to crash Asterisk via a specially crafted DNS SRV or NAPTR response, because a buffer size is supposed to match an expanded length but actually matches a compressed length."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-19443",
        "datePublished": "2018-11-22T19:00:00",
        "description": {
            "lang": "en",
            "value": "The client in Tryton 5.x before 5.0.1 tries to make a connection to the bus in cleartext instead of encrypted under certain circumstances in bus.py and jsonrpc.py. This connection attempt fails, but it contains in the header the current session of the user. This session could then be stolen by a man-in-the-middle."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-19528",
        "datePublished": "2018-11-26T02:00:00",
        "description": {
            "lang": "en",
            "value": "TP-Link TL-WR886N 7.0 1.1.0 devices allow remote attackers to cause a denial of service (Tlb Load Exception) via crafted DNS packets to port 53/udp."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-19556",
        "datePublished": "2018-11-26T07:00:00",
        "description": {
            "lang": "en",
            "value": "zb_system/admin/index.php?act=UploadMng in Z-BlogPHP 1.5 mishandles file preview, leading to content spoofing. NOTE: the software maintainer disputes that this is a vulnerability"
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-19914",
        "datePublished": "2018-12-06T19:00:00",
        "description": {
            "lang": "en",
            "value": "DomainMOD through 4.11.01 has XSS via the assets/add/dns.php Profile Name or notes field."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-1046",
        "datePublished": "2018-07-16T20:00:00",
        "description": {
            "lang": "en",
            "value": "pdns before version 4.1.2 is vulnerable to a buffer overflow in dnsreplay. In the dnsreplay tool provided with PowerDNS Authoritative, replaying a specially crafted PCAP file can trigger a stack-based buffer overflow, leading to a crash and potentially arbitrary code execution. This buffer overflow only occurs when the -ecs-stamp option of dnsreplay is used."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-1099",
        "datePublished": "2018-04-03T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "DNS rebinding vulnerability found in etcd 3.3.1 and earlier. An attacker can control his DNS records to direct to localhost, and trick the browser into sending requests to localhost (or any other address)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-1110",
        "datePublished": "2021-03-30T01:55:31",
        "description": {
            "lang": "en",
            "value": "A flaw was found in knot-resolver before version 2.3.0. Malformed DNS messages may cause denial of service."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-1127",
        "datePublished": "2018-09-11T15:00:00",
        "description": {
            "lang": "en",
            "value": "Tendrl API in Red Hat Gluster Storage before 3.4.0 does not immediately remove session tokens after a user logs out. Session tokens remain active for a few minutes allowing attackers to replay tokens acquired via sniffing/MITM attacks and authenticate as the target user."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 4.2,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-1137",
        "datePublished": "2018-05-25T12:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Moodle 3.x. By substituting URLs in portfolios, users can instantiate any class. This can also be exploited by users who are logged in as guests to create a DDoS attack."
        },
        "metrics": [],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2018-1139",
        "datePublished": "2018-08-22T14:00:00",
        "description": {
            "lang": "en",
            "value": "A flaw was found in the way samba before 4.7.9 and 4.8.4 allowed the use of weak NTLMv1 authentication even when NTLMv1 was explicitly disabled. A man-in-the-middle attacker could use this flaw to read the credential and other details passed between the samba server and client."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-1227",
        "datePublished": "2018-03-13T20:00:00",
        "description": {
            "lang": "en",
            "value": "Pivotal Concourse after 2018-03-05 might allow remote attackers to have an unspecified impact, if a customer obtained the Concourse software from a DNS domain that is no longer controlled by Pivotal. The original domain for the Concourse CI (concourse-dot-ci) open source project has been registered by an unknown actor, and is therefore no longer the official website for Concourse CI. The new official domain is concourse-ci.org. At approximately 4 am EDT on March 7, 2018 the Concourse OSS team began receiving reports that the Concourse domain was not responding. The Concourse OSS team discovered, upon investigation with both the original and the new domain registrars, that the originating domain registrar had made the domain available for purchase. This was done despite the domain being renewed by the Concourse OSS team through August 2018. For a customer to be affected, they would have needed to access a download from a \"concourse-dot-ci\" domain web site after March 6, 2018 18:00:00 EST. Accessing that domain is NOT recommended by Pivotal. Anyone who had been using that domain should immediately begin using the concourse-ci.org domain instead. Customers can also safely access Concourse software from the traditionally available locations on the Pivotal Network or GitHub."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-1249",
        "datePublished": "2018-07-02T17:00:00Z",
        "description": {
            "lang": "en",
            "value": "Dell EMC iDRAC9 versions prior to 3.21.21.21 did not enforce the use of TLS/SSL for a connection to iDRAC web server for certain URLs. A man-in-the-middle attacker could use this vulnerability to strip the SSL/TLS protection from a connection between a client and a server."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-1348",
        "datePublished": "2018-03-26T19:00:00",
        "description": {
            "lang": "en",
            "value": "NetIQ Identity Manager driver, in versions prior to 4.7, allows for an SSL handshake renegotiation which could result in a MITM attack."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-1375",
        "datePublished": "2018-05-29T13:00:00Z",
        "description": {
            "lang": "en",
            "value": "IBM Security Guardium Big Data Intelligence (SonarG) 3.1 does not renew a session variable after a successful authentication which could lead to session fixation/hijacking vulnerability. This could force a user to utilize a cookie that may be known to an attacker. IBM X-Force ID: 137776."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-1435",
        "datePublished": "2018-03-14T00:00:00Z",
        "description": {
            "lang": "en",
            "value": "IBM Notes 8.5 and 9.0 is vulnerable to a DLL hijacking attack. A remote attacker could trick a user to double click a malicious executable in an attacker-controlled directory, which could result in code execution. IBM X-Force ID: 139563."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-1437",
        "datePublished": "2018-03-14T00:00:00Z",
        "description": {
            "lang": "en",
            "value": "IBM Notes 8.5 and 9.0 could allow an attacker to execute arbitrary code on the system, caused by an error related to multiple untrusted search path. A local attacker could exploit this vulnerability to DLL hijacking to execute arbitrary code on the system or cause the application to crash. IBM X-Force ID: 139565."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-1458",
        "datePublished": "2018-07-10T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "IBM DB2 for Linux, UNIX and Windows (includes DB2 Connect Server) 9.7, 10,1, 10.5 and 11.1 could allow a local user to execute arbitrary code and conduct DLL hijacking attacks. IBM X-Force ID: 140209."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.4,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-1474",
        "datePublished": "2018-12-12T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "IBM BigFix Platform 9.2.0 through 9.2.14 and 9.5 through 9.5.9 is vulnerable to HTTP response splitting attacks, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability to inject arbitrary HTTP headers and cause the server to return a split response, once the URL is clicked. This would allow the attacker to perform further attacks, such as Web cache poisoning or cross-site scripting, and possibly obtain sensitive information. IBM X-force ID: 140692."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.1,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2018-1485",
        "datePublished": "2018-12-12T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "IBM BigFix Platform 9.2.0 through 9.2.14 and 9.5 through 9.5.9 does not renew a session variable after a successful authentication which could lead to session fixation/hijacking vulnerability. This could force a user to utilize a cookie that may be known to an attacker. IBM X-Force ID: 140970."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 3.1,
                "severity": "LOW"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-1509",
        "datePublished": "2018-10-02T15:00:00Z",
        "description": {
            "lang": "en",
            "value": "IBM Security Guardium EcoSystem 10.5 does not validate, or incorrectly validates, a certificate.This weakness might allow an attacker to spoof a trusted entity by using a man-in-the-middle (MITM) attack. The software might connect to a malicious host while believing it is a trusted host, or the software might be deceived into accepting spoofed data that appears to originate from a trusted host. IBM X-Force ID: 141417."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 3.7,
                "severity": "LOW"
            }
        ],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-1549",
        "datePublished": "2018-07-10T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "IBM Rational Quality Manager 5.0 through 5.0.2 and 6.0 through 6.0.5 are vulnerable to HTTP response splitting attacks. A remote attacker could exploit this vulnerability using specially-crafted URL to cause the server to return a split response, once the URL is clicked. This would allow the attacker to perform further attacks, such as Web cache poisoning, cross-site scripting, and possibly obtain sensitive information. IBM X-Force ID: 142658."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2018-1626",
        "datePublished": "2019-04-02T13:20:33.705267Z",
        "description": {
            "lang": "en",
            "value": "IBM Security Privileged Identity Manager Virtual Appliance 2.2.1 does not renew a session variable after a successful authentication which could lead to session fixation/hijacking vulnerability. This could force a user to utilize a cookie that may be known to an attacker. IBM X-Force ID: 144411."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 3.1,
                "severity": "LOW"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-1658",
        "datePublished": "2019-03-14T22:00:00Z",
        "description": {
            "lang": "en",
            "value": "IBM Jazz Foundation (IBM Rational Collaborative Lifecycle Management 5.0 through 6.0.6) is vulnerable to HTTP header injection, caused by improper validation of input. By persuading a victim to visit a specially-crafted Web page, a remote attacker could exploit this vulnerability to inject arbitrary HTTP headers, which will allow the attacker to conduct various attacks against the vulnerable system, including cross-site scripting, cache poisoning or session hijacking. IBM X-Force ID: 144884."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning",
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-1695",
        "datePublished": "2018-09-06T14:00:00Z",
        "description": {
            "lang": "en",
            "value": "IBM WebSphere Application Server 7.0, 8.0, and 8.5.5 installations using Form Login could allow a remote attacker to conduct spoofing attacks. IBM X-Force ID: 145769."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.3,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-1719",
        "datePublished": "2018-09-14T12:00:00Z",
        "description": {
            "lang": "en",
            "value": "IBM WebSphere Application Server 8.5 and 9.0 could provide weaker than expected security under certain conditions. This could result in a downgrade of TLS protocol. A remote attacker could exploit this vulnerability to perform man-in-the-middle attacks. IBM X-Force ID: 147292."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-1943",
        "datePublished": "2019-04-08T14:50:37.897124Z",
        "description": {
            "lang": "en",
            "value": "IBM Cloud Private 3.1.0 and 3.1.1 is vulnerable to HTTP HOST header injection, caused by improper validation of input. By persuading a victim to visit a specially-crafted Web page, a remote attacker could exploit this vulnerability to inject arbitrary HTTP headers, which will allow the attacker to conduct various attacks against the vulnerable system, including cross-site scripting, cache poisoning or session hijacking. IBM X-Force ID: 153385."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning",
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-20102",
        "datePublished": "2018-12-12T17:00:00",
        "description": {
            "lang": "en",
            "value": "An out-of-bounds read in dns_validate_dns_response in dns.c was discovered in HAProxy through 1.8.14. Due to a missing check when validating DNS responses, remote attackers might be able read the 16 bytes corresponding to an AAAA record from the non-initialized part of the buffer, possibly accessing anything that was left on the stack, or even past the end of the 8193-byte buffer, depending on the value of accepted_payload_size."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-20103",
        "datePublished": "2018-12-12T17:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in dns.c in HAProxy through 1.8.14. In the case of a compressed pointer, a crafted packet can trigger infinite recursion by making the pointer point to itself, or create a long chain of valid pointers resulting in stack exhaustion."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-20135",
        "datePublished": "2019-06-07T15:45:01",
        "description": {
            "lang": "en",
            "value": "Samsung Galaxy Apps before 4.4.01.7 allows modification of the hostname used for load balancing on installations of applications through a man-in-the-middle attack. An attacker may trick Galaxy Apps into using an arbitrary hostname for which the attacker can provide a valid SSL certificate, and emulate the API of the app store to modify existing apps at installation time. The specific flaw involves an HTTP method to obtain the load-balanced hostname that enforces SSL only after obtaining a hostname from the load balancer, and a missing app signature validation in the application XML. An attacker can exploit this vulnerability to achieve Remote Code Execution on the device. The Samsung ID is SVE-2018-12071."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-20200",
        "datePublished": "2019-04-18T18:31:52",
        "description": {
            "lang": "en",
            "value": "CertificatePinner.java in OkHttp 3.x through 3.12.0 allows man-in-the-middle attackers to bypass certificate pinning by changing SSLContext and the boolean values while hooking the application. NOTE: This id is disputed because some parties don't consider this is a vulnerability. Their rationale can be found in https://github.com/square/okhttp/issues/4967"
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-20211",
        "datePublished": "2019-01-02T18:00:00",
        "description": {
            "lang": "en",
            "value": "ExifTool 8.32 allows local users to gain privileges by creating a %TEMP%\\par-%username%\\cache-exiftool-8.32 folder with a victim's username, and then copying a Trojan horse ws32_32.dll file into this new folder, aka DLL Hijacking.  NOTE: 8.32 is an obsolete version from 2010 (9.x was released starting in 2012, and 10.x was released starting in 2015)."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-20242",
        "datePublished": "2019-02-11T21:00:00Z",
        "description": {
            "lang": "en",
            "value": "A carefully crafted URL could trigger an XSS vulnerability on Apache JSPWiki, from versions up to 2.10.5, which could lead to session hijacking."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-20812",
        "datePublished": "2019-03-16T03:00:00Z",
        "description": {
            "lang": "en",
            "value": "An information exposure issue where IPv6 DNS traffic would be sent outside of the VPN tunnel (when Traffic Enforcement was enabled) exists in Pulse Secure Pulse Secure Desktop 9.0R1 and below. This is applicable only to dual-stack (IPv4/IPv6) endpoints."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-20816",
        "datePublished": "2019-04-05T13:05:07",
        "description": {
            "lang": "en",
            "value": "An XSS combined with CSRF vulnerability discovered in SalesAgility SuiteCRM 7.x before 7.8.24 and 7.10.x before 7.10.11 leads to cookie stealing, aka session hijacking. This issue affects the \"add dashboard pages\" feature where users can receive a malicious attack through a phished URL, with script executed."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-20866",
        "datePublished": "2019-07-30T14:22:56",
        "description": {
            "lang": "en",
            "value": "cPanel before 76.0.8 has Stored XSS in the WHM \"Reset a DNS Zone\" feature (SEC-461)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-20869",
        "datePublished": "2019-07-30T14:27:55",
        "description": {
            "lang": "en",
            "value": "cPanel before 76.0.8 allows arbitrary code execution in the context of the root account via dnssec adminbin (SEC-465)."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2018-20872",
        "datePublished": "2019-07-31T17:11:25",
        "description": {
            "lang": "en",
            "value": "DrayTek routers before 2018-05-23 allow CSRF attacks to change DNS or DHCP settings, a related issue to CVE-2017-11649."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-20915",
        "datePublished": "2019-08-01T14:45:12",
        "description": {
            "lang": "en",
            "value": "cPanel before 70.0.23 allows stored XSS via a WHM Edit DNS Zone action (SEC-369)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-20918",
        "datePublished": "2019-08-01T14:48:09",
        "description": {
            "lang": "en",
            "value": "cPanel before 70.0.23 allows stored XSS in WHM DNS Cluster (SEC-372)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-20920",
        "datePublished": "2019-08-01T14:49:58",
        "description": {
            "lang": "en",
            "value": "cPanel before 70.0.23 allows stored XSS via a WHM Edit DNS Zone action (SEC-374)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-20921",
        "datePublished": "2019-08-01T14:50:56",
        "description": {
            "lang": "en",
            "value": "cPanel before 70.0.23 allows stored XSS via a WHM \"Delete a DNS Zone\" action (SEC-375)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-20922",
        "datePublished": "2019-08-01T14:51:53",
        "description": {
            "lang": "en",
            "value": "cPanel before 70.0.23 allows stored XSS via a WHM DNS Cleanup action (SEC-376)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-20923",
        "datePublished": "2019-08-01T14:52:49",
        "description": {
            "lang": "en",
            "value": "cPanel before 70.0.23 allows stored XSS via a WHM Synchronize DNS Records action (SEC-377)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-20933",
        "datePublished": "2019-08-01T15:49:29",
        "description": {
            "lang": "en",
            "value": "cPanel before 70.0.23 has Stored XSS via an WHM Edit DNS Zone action (SEC-410)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-20935",
        "datePublished": "2019-08-01T15:51:27",
        "description": {
            "lang": "en",
            "value": "cPanel before 70.0.23 allows stored XSS in via a WHM \"Reset a DNS Zone\" action (SEC-412)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-20994",
        "datePublished": "2019-08-26T12:34:16",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in the trust-dns-proto crate before 0.5.0-alpha.3 for Rust. There is infinite recursion because DNS message compression is mishandled."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-21029",
        "datePublished": "2019-10-30T21:46:51",
        "description": {
            "lang": "en",
            "value": "systemd 239 through 245 accepts any certificate signed by a trusted certificate authority for DNS Over TLS. Server Name Indication (SNI) is not sent, and there is no hostname validation with the GnuTLS backend. NOTE: This has been disputed by the developer as not a vulnerability since hostname validation does not have anything to do with this issue (i.e. there is no hostname to be sent)"
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-25031",
        "datePublished": "2022-03-11T06:47:46",
        "description": {
            "lang": "en",
            "value": "Swagger UI 4.1.2 and earlier could allow a remote attacker to conduct spoofing attacks. By persuading a victim to open a crafted URL, an attacker could exploit this vulnerability to display remote OpenAPI definitions. Note: This was originally claimed to be resolved in 4.1.3. However, third parties have indicated this is not resolved in 4.1.3 and even occurs in that version and possibly others."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-25037",
        "datePublished": "2022-06-12T07:40:24",
        "description": {
            "lang": "en",
            "value": "A vulnerability was found in Thomson TCW710 ST5D.10.05 and classified as problematic. Affected by this issue is some unknown functionality of the file /goform/RgDdns. The manipulation of the argument DdnsHostName with the input ><script>alert(1)</script> as part of POST Request leads to cross site scripting (Persistent). The attack may be launched remotely. The exploit has been disclosed to the public and may be used."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 3.5,
                "severity": "LOW"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-2415",
        "datePublished": "2018-05-09T20:00:00",
        "description": {
            "lang": "en",
            "value": "SAP NetWeaver Application Server Java Web Container and HTTP Service (Engine API, from 7.10 to 7.11, 7.30, 7.31, 7.40, 7.50; J2EE Engine Server Core 7.11, 7.30, 7.31, 7.40, 7.50) do not sufficiently encode user controlled inputs, resulting in a content spoofing vulnerability when error pages are displayed."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 4.7,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-2432",
        "datePublished": "2018-07-10T18:00:00",
        "description": {
            "lang": "en",
            "value": "SAP BusinessObjects Business Intelligence (BI Launchpad and Central Management Console) versions 4.10, 4.20 and 4.30 allow an attacker to include invalidated data in the HTTP response header sent to a Web user. Successful exploitation of this vulnerability may lead to advanced attacks, including: cross-site scripting and page hijacking."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-2434",
        "datePublished": "2018-07-10T18:00:00",
        "description": {
            "lang": "en",
            "value": "A content spoofing vulnerability in the following components allows to render html pages containing arbitrary plain text content, which might fool an end user: UI add-on for SAP NetWeaver (UI_Infra, 1.0), SAP UI Implementation for Decoupled Innovations (UI_700, 2.0): SAP NetWeaver 7.00 Implementation, SAP User Interface Technology (SAP_UI 7.4, 7.5, 7.51, 7.52). There is little impact as it is not possible to embed active contents such as JavaScript or hyperlinks."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-2460",
        "datePublished": "2018-09-11T15:00:00",
        "description": {
            "lang": "en",
            "value": "SAP Business One Android application, version 1.2, does not verify the certificate properly for HTTPS connection. This allows attacker to do MITM attack."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-3759",
        "datePublished": "2018-06-13T15:00:00Z",
        "description": {
            "lang": "en",
            "value": "private_address_check ruby gem before 0.5.0 is vulnerable to a time-of-check time-of-use (TOCTOU) race condition due to the address the socket uses not being checked. DNS entries with a TTL of 0 can trigger this case where the initial resolution is a public address but the subsequent resolution is a private address."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-3815",
        "datePublished": "2018-01-08T05:00:00",
        "description": {
            "lang": "en",
            "value": "The \"XML Interface to Messaging, Scheduling, and Signaling\" (XIMSS) protocol implementation in CommuniGate Pro (CGP) 6.2 suffers from a Missing XIMSS Protocol Validation attack that leads to an email spoofing attack, allowing a malicious authenticated attacker to send a message from any source email address. The attack uses an HTTP POST request to a /Session URI, and interchanges the XML From and To elements."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-3985",
        "datePublished": "2019-03-21T15:30:19",
        "description": {
            "lang": "en",
            "value": "An exploitable double free vulnerability exists in the mdnscap binary of the CUJO Smart Firewall. When parsing mDNS packets, a memory space is freed twice if an invalid query name is encountered, leading to arbitrary code execution in the context of the mdnscap process. An unauthenticated attacker can send an mDNS message to trigger this vulnerability."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.3,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-4002",
        "datePublished": "2019-10-31T20:37:17",
        "description": {
            "lang": "en",
            "value": "An exploitable denial-of-service vulnerability exists in the mdnscap binary of the CUJO Smart Firewall running firmware 7003. When parsing labels in mDNS packets, the firewall unsafely handles label compression pointers, leading to an uncontrolled recursion that eventually exhausts the stack, crashing the mdnscap process. An unauthenticated attacker can send an mDNS message to trigger this vulnerability."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-4003",
        "datePublished": "2019-03-21T15:05:44",
        "description": {
            "lang": "en",
            "value": "An exploitable heap overflow vulnerability exists in the mdnscap binary of the CUJO Smart Firewall running firmware 7003. The string lengths are handled incorrectly when parsing character strings in mDNS resource records, leading to arbitrary code execution in the context of the mdnscap process. An unauthenticated attacker can send an mDNS message to trigger this vulnerability."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.3,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-4011",
        "datePublished": "2019-03-21T15:42:40",
        "description": {
            "lang": "en",
            "value": "An exploitable integer underflow vulnerability exists in the mdnscap binary of the CUJO Smart Firewall, version 7003. When parsing SRV records in an mDNS packet, the \"RDLENGTH\" value is handled incorrectly, leading to an out-of-bounds access that crashes the mdnscap process. An unauthenticated attacker can send an mDNS message to trigger this vulnerability."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-4111",
        "datePublished": "2018-04-03T06:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in certain Apple products. macOS before 10.13.4 is affected. The issue involves the \"Mail\" component. It allows man-in-the-middle attackers to read S/MIME encrypted message content by sending HTML e-mail that references remote resources but lacks a valid S/MIME signature."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-4174",
        "datePublished": "2018-04-03T06:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in certain Apple products. iOS before 11.3 is affected. macOS before 10.13.4 is affected. The issue involves the \"Mail\" component. It allows man-in-the-middle attackers to read S/MIME encrypted messages by leveraging an inconsistency in the user interface."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-4202",
        "datePublished": "2018-06-08T18:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in certain Apple products. iOS before 11.4 is affected. macOS before 10.13.5 is affected. The issue involves the \"iBooks\" component. It allows man-in-the-middle attackers to spoof a password prompt."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-4274",
        "datePublished": "2019-04-03T17:43:13",
        "description": {
            "lang": "en",
            "value": "A spoofing issue existed in the handling of URLs. This issue was addressed with improved input validation. This issue affected versions prior to iOS 11.4.1, Safari 11.1.2."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-4277",
        "datePublished": "2019-01-11T18:00:00",
        "description": {
            "lang": "en",
            "value": "In iOS before 11.4.1, watchOS before 4.3.2, tvOS before 11.4.1, Safari before 11.1.1, macOS High Sierra before 10.13.6, a spoofing issue existed in the handling of URLs. This issue was addressed with improved input validation."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-4390",
        "datePublished": "2020-10-27T19:18:38",
        "description": {
            "lang": "en",
            "value": "An inconsistent user interface issue was addressed with improved state management. This issue is fixed in macOS High Sierra 10.13.1, Security Update 2017-001 Sierra, and Security Update 2017-004 El Capitan, watchOS 4.3, iOS 12.1. Processing a maliciously crafted text message may lead to UI spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-4391",
        "datePublished": "2020-10-27T19:19:36",
        "description": {
            "lang": "en",
            "value": "An inconsistent user interface issue was addressed with improved state management. This issue is fixed in macOS High Sierra 10.13.1, Security Update 2017-001 Sierra, and Security Update 2017-004 El Capitan, watchOS 4.3, iOS 12.1. Processing a maliciously crafted text message may lead to UI spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-4429",
        "datePublished": "2019-04-03T17:43:18",
        "description": {
            "lang": "en",
            "value": "A spoofing issue existed in the handling of URLs. This issue was addressed with improved input validation. This issue affected versions prior to iOS 12.1.1, watchOS 5.1.2."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-4849",
        "datePublished": "2018-05-03T13:00:00Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability has been identified in Siveillance VMS Video for Android (All versions < V12.1a (2018 R1)), Siveillance VMS Video for iOS (All versions < V12.1a (2018 R1)). Improper certificate validation could allow an attacker in a privileged network position to read data from and write data to the encrypted communication channel between the app and a server. The security vulnerability could be exploited by an attacker in a privileged network position which allows intercepting the communication channel between the affected app and a server (such as Man-in-the-Middle). Furthermore, an attacker must be able to generate a certificate that results for the validation algorithm in a checksum identical to a trusted certificate. Successful exploitation requires no user interaction. The vulnerability could allow reading data from and writing data to the encrypted communication channel between the app and a server, impacting the communication's confidentiality and integrity. At the time of advisory publication no public exploitation of this security vulnerability was known. Siemens confirms the security vulnerability and provides mitigations to resolve the security issue."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-5003",
        "datePublished": "2018-08-29T13:00:00",
        "description": {
            "lang": "en",
            "value": "Adobe Creative Cloud Desktop Application before 4.5.5.342 (installer) has an insecure library loading (dll hijacking) vulnerability. Successful exploitation could lead to privilege escalation."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-5121",
        "datePublished": "2018-06-11T21:00:00",
        "description": {
            "lang": "en",
            "value": "Low descenders on some Tibetan characters in several fonts on OS X are clipped when rendered in the addressbar. When used as part of an Internationalized Domain Name (IDN) this can be used for domain name spoofing attacks. Note: This attack only affects OS X operating systems. Other operating systems are unaffected. This vulnerability affects Firefox < 58."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-5138",
        "datePublished": "2018-06-11T21:00:00",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability can occur when a malicious site with an extremely long domain name is opened in an Android Custom Tab (a browser panel inside another app) and the default browser is Firefox for Android. This could allow an attacker to spoof which page is actually loaded and in use. Note: this issue only affects Firefox for Android. Other versions and operating systems are unaffected. This vulnerability affects Firefox < 59."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-5261",
        "datePublished": "2018-02-02T21:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Flexense DiskBoss 8.8.16 and earlier. Due to the usage of plaintext information from the handshake as input for the encryption key used for the encryption of the rest of the session, the server and client disclose sensitive information, such as the authentication credentials, to any man-in-the-middle (MiTM) listener."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-5353",
        "datePublished": "2020-09-29T20:07:22",
        "description": {
            "lang": "en",
            "value": "The custom GINA/CP module in Zoho ManageEngine ADSelfService Plus before 5.5 build 5517 allows remote attackers to execute code and escalate privileges via spoofing. It does not authenticate the intended server before opening a browser window. An unauthenticated attacker capable of conducting a spoofing attack can redirect the browser to gain execution in the context of the WinLogon.exe process. If Network Level Authentication is not enforced, the vulnerability can be exploited via RDP. Additionally, if the web server has a misconfigured certificate then no spoofing attack is required"
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-5354",
        "datePublished": "2020-09-29T19:54:52",
        "description": {
            "lang": "en",
            "value": "The custom GINA/CP module in ANIXIS Password Reset Client before version 3.22 allows remote attackers to execute code and escalate privileges via spoofing. When the client is configured to use HTTP, it does not authenticate the intended server before opening a browser window. An unauthenticated attacker capable of conducting a spoofing attack can redirect the browser to gain execution in the context of the WinLogon.exe process. If Network Level Authentication is not enforced, the vulnerability can be exploited via RDP."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-5400",
        "datePublished": "2018-10-08T15:00:00Z",
        "description": {
            "lang": "en",
            "value": "The Auto-Maskin products utilize an undocumented custom protocol to set up Modbus communications with other devices without validating those devices. The originating device sends a message in plaintext, 48:65:6c:6c:6f:20:57:6f:72:6c:64, \"Hello World\" over UDP ports 44444-44446 to the broadcast address for the LAN. Without verification devices respond to any of these broadcast messages on the LAN with a plaintext reply over UDP containing the device model and firmware version. Following this exchange the devices allow Modbus transmissions between the two devices on the standard Modbus port 502 TCP. Impact: An attacker can exploit this vulnerability to send arbitrary messages to any DCU or RP device through spoofing or replay attacks as long as they have access to the network. Affected releases are Auto-Maskin DCU-210E RP-210E: Versions prior to 3.7 on ARMv7."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 9.1,
                "severity": "CRITICAL"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-5408",
        "datePublished": "2019-05-08T14:48:20",
        "description": {
            "lang": "en",
            "value": "The PrinterLogic Print Management software, versions up to and including 18.3.1.96, does not validate, or incorrectly validates, the PrinterLogic management portal's SSL certificate. When a certificate is invalid or malicious, it might allow an attacker to spoof a trusted entity by using a man-in-the-middle (MITM) attack. The software might connect to a malicious host while believing it is a trusted host, or the software might be deceived into accepting spoofed data that appears to originate from a trusted host."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-5409",
        "datePublished": "2019-05-08T14:48:20",
        "description": {
            "lang": "en",
            "value": "The PrinterLogic Print Management software, versions up to and including 18.3.1.96, updates and executes the code without sufficiently verifying the origin and integrity of the code. An attacker can execute malicious code by compromising the host server, performing DNS spoofing, or modifying the code in transit."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dns spoofing",
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-5411",
        "datePublished": "2018-12-13T22:00:00",
        "description": {
            "lang": "en",
            "value": "Pixar's Tractor software, versions 2.2 and earlier, contain a stored cross-site scripting vulnerability in the field that allows a user to add a note to an existing node. The stored information is displayed when a user requests information about the node. An attacker could insert Javascript into this note field that is then saved and displayed to the end user. An attacker might include Javascript that could execute on an authenticated user's system that could lead to website redirects, session cookie hijacking, social engineering, etc. As this is stored with the information about the node, all other authenticated users with access to this data are also vulnerable."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-5461",
        "datePublished": "2018-03-06T21:00:00",
        "description": {
            "lang": "en",
            "value": "An Inadequate Encryption Strength issue was discovered in Belden Hirschmann RS, RSR, RSB, MACH100, MACH1000, MACH4000, MS, and OCTOPUS Classic Platform Switches. An inadequate encryption strength vulnerability in the web interface has been identified, which may allow an attacker to obtain sensitive information through a successful man-in-the-middle attack."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-5471",
        "datePublished": "2018-03-06T21:00:00",
        "description": {
            "lang": "en",
            "value": "A Cleartext Transmission of Sensitive Information issue was discovered in Belden Hirschmann RS, RSR, RSB, MACH100, MACH1000, MACH4000, MS, and OCTOPUS Classic Platform Switches. A cleartext transmission of sensitive information vulnerability in the web interface has been identified, which may allow an attacker to obtain sensitive information through a successful man-in-the-middle attack."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-5481",
        "datePublished": "2019-01-07T15:00:00",
        "description": {
            "lang": "en",
            "value": "OnCommand Unified Manager for 7-Mode (core package) prior to 5.2.4 uses cookies that lack the secure attribute in certain circumstances making it vulnerable to impersonation via man-in-the-middle (MITM) attacks."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-5501",
        "datePublished": "2018-03-01T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "In some circumstances, on F5 BIG-IP systems running 13.0.0, 12.1.0 - 12.1.3.1, any 11.6.x or 11.5.x release, or 11.2.1, TCP DNS profile allows excessive buffering due to lack of flow control."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-5505",
        "datePublished": "2018-03-22T18:00:00Z",
        "description": {
            "lang": "en",
            "value": "On F5 BIG-IP versions 13.1.0 - 13.1.0.3, when ASM and AVR are both provisioned, TMM may restart while processing DNS requests when the virtual server is configured with a DNS profile and the Protocol setting is set to TCP."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-5532",
        "datePublished": "2018-07-19T14:00:00Z",
        "description": {
            "lang": "en",
            "value": "On F5 BIG-IP 13.0.0, 12.1.0-12.1.2, 11.6.0-11.6.3.1, or 11.2.1-11.5.6 a domain name cached within the DNS Cache of TMM may continue to be resolved by the cache even after the parent server revokes the record, if the DNS Cache is receiving a stream of requests for the cached name."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-5538",
        "datePublished": "2018-07-25T14:00:00Z",
        "description": {
            "lang": "en",
            "value": "On F5 BIG-IP DNS 13.1.0-13.1.0.7, 12.1.3-12.1.3.5, DNS Express / DNS Zones accept NOTIFY messages on the management interface from source IP addresses not listed in the 'Allow NOTIFY From' configuration parameter when the db variable \"dnsexpress.notifyport\" is set to any value other than the default of \"0\"."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-5702",
        "datePublished": "2018-01-15T16:00:00",
        "description": {
            "lang": "en",
            "value": "Transmission through 2.92 relies on X-Transmission-Session-Id (which is not a forbidden header for Fetch) for access control, which allows remote attackers to execute arbitrary RPC commands, and consequently write to arbitrary files, via POST requests to /transmission/rpc in conjunction with a DNS rebinding attack."
        },
        "metrics": [],
        "tags": [
            "dns",
            "rebinding attack"
        ]
    },
    {
        "cveId": "CVE-2018-5740",
        "datePublished": "2019-01-16T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "\"deny-answer-aliases\" is a little-used feature intended to help recursive server operators protect end users against DNS rebinding attacks, a potential method of circumventing the security model used by client browsers. However, a defect in this feature makes it easy, when the feature is in use, to experience an assertion failure in name.c. Affects BIND 9.7.0->9.8.8, 9.9.0->9.9.13, 9.10.0->9.10.8, 9.11.0->9.11.4, 9.12.0->9.12.2, 9.13.0->9.13.2."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns",
            "rebinding attack"
        ]
    },
    {
        "cveId": "CVE-2018-5741",
        "datePublished": "2019-01-16T20:00:00Z",
        "description": {
            "lang": "en",
            "value": "To provide fine-grained controls over the ability to use Dynamic DNS (DDNS) to update records in a zone, BIND 9 provides a feature called update-policy. Various rules can be configured to limit the types of updates that can be performed by a client, depending on the key used when sending the update request. Unfortunately, some rule types were not initially documented, and when documentation for them was added to the Administrator Reference Manual (ARM) in change #3112, the language that was added to the ARM at that time incorrectly described the behavior of two rule types, krb5-subdomain and ms-subdomain. This incorrect documentation could mislead operators into believing that policies they had configured were more restrictive than they actually were. This affects BIND versions prior to BIND 9.11.5 and BIND 9.12.3."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-5744",
        "datePublished": "2019-10-09T14:17:14.332021Z",
        "description": {
            "lang": "en",
            "value": "A failure to free memory can occur when processing messages having a specific combination of EDNS options. Versions affected are: BIND 9.10.7 -> 9.10.8-P1, 9.11.3 -> 9.11.5-P1, 9.12.0 -> 9.12.3-P1, and versions 9.10.7-S1 -> 9.11.5-S3 of BIND 9 Supported Preview Edition. Versions 9.13.0 -> 9.13.6 of the 9.13 development branch are also affected."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-5745",
        "datePublished": "2019-10-09T14:17:14.370307Z",
        "description": {
            "lang": "en",
            "value": "\"managed-keys\" is a feature which allows a BIND resolver to automatically maintain the keys used by trust anchors which operators configure for use in DNSSEC validation. Due to an error in the managed-keys feature it is possible for a BIND server which uses managed-keys to exit due to an assertion failure if, during key rollover, a trust anchor's keys are replaced with keys which use an unsupported algorithm. Versions affected: BIND 9.9.0 -> 9.10.8-P1, 9.11.0 -> 9.11.5-P1, 9.12.0 -> 9.12.3-P1, and versions 9.9.3-S1 -> 9.11.5-S3 of BIND 9 Supported Preview Edition. Versions 9.13.0 -> 9.13.6 of the 9.13 development branch are also affected. Versions prior to BIND 9.9.0 have not been evaluated for vulnerability to CVE-2018-5745."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 4.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2018-5761",
        "datePublished": "2018-01-22T17:00:00",
        "description": {
            "lang": "en",
            "value": "A man-in-the-middle vulnerability related to vCenter access was found in Rubrik CDM 3.x and 4.x before 4.0.4-p2. This vulnerability might expose Rubrik user credentials configured to access vCenter as Rubrik clusters did not verify TLS certificates presented by vCenter."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-6019",
        "datePublished": "2018-03-06T20:00:00",
        "description": {
            "lang": "en",
            "value": "Samsung Display Solutions App before 3.02 for Android allows man-in-the-middle attackers to spoof B2B content by leveraging failure to use encryption during information transmission."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-6098",
        "datePublished": "2018-12-04T17:00:00",
        "description": {
            "lang": "en",
            "value": "Incorrect handling of confusable characters in URL Formatter in Google Chrome prior to 66.0.3359.117 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6100",
        "datePublished": "2019-01-09T19:00:00",
        "description": {
            "lang": "en",
            "value": "Incorrect handling of confusable characters in URL Formatter in Google Chrome on macOS prior to 66.0.3359.117 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6104",
        "datePublished": "2018-12-04T17:00:00",
        "description": {
            "lang": "en",
            "value": "Incorrect handling of confusable characters in URL Formatter in Google Chrome prior to 66.0.3359.117 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6105",
        "datePublished": "2018-12-04T17:00:00",
        "description": {
            "lang": "en",
            "value": "Incorrect handling of confusable characters in Omnibox in Google Chrome prior to 66.0.3359.117 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6107",
        "datePublished": "2018-12-04T17:00:00",
        "description": {
            "lang": "en",
            "value": "Incorrect handling of confusable characters in URL Formatter in Google Chrome prior to 66.0.3359.117 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6108",
        "datePublished": "2018-12-04T17:00:00",
        "description": {
            "lang": "en",
            "value": "Incorrect handling of confusable characters in URL Formatter in Google Chrome prior to 66.0.3359.117 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6113",
        "datePublished": "2019-01-09T19:00:00",
        "description": {
            "lang": "en",
            "value": "Improper handling of pending navigation entries in Navigation in Google Chrome on iOS prior to 66.0.3359.117 allowed a remote attacker to perform domain spoofing via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6128",
        "datePublished": "2019-06-27T16:13:42",
        "description": {
            "lang": "en",
            "value": "Incorrect URL parsing in WebKit in Google Chrome on iOS prior to 67.0.3396.62 allowed a remote attacker to perform domain spoofing via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6133",
        "datePublished": "2019-01-09T19:00:00",
        "description": {
            "lang": "en",
            "value": "Incorrect handling of confusable characters in URL Formatter in Google Chrome prior to 67.0.3396.62 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6135",
        "datePublished": "2019-01-09T19:00:00",
        "description": {
            "lang": "en",
            "value": "Lack of clearing the previous site before loading alerts from a new one in Blink in Google Chrome prior to 67.0.3396.62 allowed a remote attacker to perform domain spoofing via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6163",
        "datePublished": "2019-01-09T19:00:00",
        "description": {
            "lang": "en",
            "value": "Incorrect handling of confusable characters in URL Formatter in Google Chrome prior to 68.0.3440.75 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6166",
        "datePublished": "2019-01-09T19:00:00",
        "description": {
            "lang": "en",
            "value": "Incorrect handling of confusable characters in URL Formatter in Google Chrome prior to 68.0.3440.75 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6167",
        "datePublished": "2019-01-09T19:00:00",
        "description": {
            "lang": "en",
            "value": "Incorrect handling of confusable characters in URL Formatter in Google Chrome prior to 68.0.3440.75 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6172",
        "datePublished": "2019-01-09T19:00:00",
        "description": {
            "lang": "en",
            "value": "Incorrect handling of confusable characters in URL Formatter in Google Chrome prior to 68.0.3440.75 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6173",
        "datePublished": "2019-01-09T19:00:00",
        "description": {
            "lang": "en",
            "value": "Incorrect handling of confusable characters in URL Formatter in Google Chrome prior to 68.0.3440.75 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6175",
        "datePublished": "2019-01-09T19:00:00",
        "description": {
            "lang": "en",
            "value": "Incorrect handling of confusable characters in URL Formatter in Google Chrome prior to 68.0.3440.75 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-6218",
        "datePublished": "2018-02-16T22:00:00",
        "description": {
            "lang": "en",
            "value": "A DLL Hijacking vulnerability in Trend Micro's User-Mode Hooking Module (UMH) could allow an attacker to run arbitrary code on a vulnerable system."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-6221",
        "datePublished": "2018-03-15T19:00:00",
        "description": {
            "lang": "en",
            "value": "An unvalidated software update vulnerability in Trend Micro Email Encryption Gateway 5.5 could allow a man-in-the-middle attacker to tamper with an update file and inject their own."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-6258",
        "datePublished": "2018-08-31T21:00:00Z",
        "description": {
            "lang": "en",
            "value": "NVIDIA GeForce Experience all versions prior to 3.14.1 contains a potential vulnerability during GameStream installation where an attacker who has system access can potentially conduct a Man-in-the-Middle (MitM) attack to obtain sensitive information."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-6306",
        "datePublished": "2018-04-19T13:00:00Z",
        "description": {
            "lang": "en",
            "value": "Unauthorized code execution from specific DLL and is known as DLL Hijacking attack in Kaspersky Password Manager versions before 8.0.6.538."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-6318",
        "datePublished": "2018-02-02T21:00:00",
        "description": {
            "lang": "en",
            "value": "In Sophos Tester Tool 3.2.0.7 Beta, the driver loads (in the context of the application used to test an exploit or ransomware) the DLL using a payload that runs from NTDLL.DLL (so, it's run in userland), but the driver doesn't perform any validation of this DLL (not its signature, not its hash, etc.). A person can change this DLL in a local way, or with a remote connection, to a malicious DLL with the same name -- and when the product is used, this malicious DLL will be loaded, aka a DLL Hijacking attack."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-6475",
        "datePublished": "2018-01-31T19:00:00Z",
        "description": {
            "lang": "en",
            "value": "In SUPERAntiSpyware Professional Trial 6.0.1254, SUPERAntiSpyware.exe allows DLL hijacking, leading to Escalation of Privileges."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-6553",
        "datePublished": "2018-08-10T15:00:00Z",
        "description": {
            "lang": "en",
            "value": "The CUPS AppArmor profile incorrectly confined the dnssd backend due to use of hard links. A local attacker could possibly use this issue to escape confinement. This flaw affects versions prior to 2.2.7-1ubuntu2.1 in Ubuntu 18.04 LTS, prior to 2.2.4-7ubuntu3.1 in Ubuntu 17.10, prior to 2.1.3-4ubuntu0.5 in Ubuntu 16.04 LTS, and prior to 1.7.2-0ubuntu1.10 in Ubuntu 14.04 LTS."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-6562",
        "datePublished": "2018-05-18T20:00:00",
        "description": {
            "lang": "en",
            "value": "totemomail Encryption Gateway before 6.0_b567 allows remote attackers to obtain sensitive information about user sessions and encryption key material via a JSONP hijacking attack."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-6695",
        "datePublished": "2018-10-03T21:00:00",
        "description": {
            "lang": "en",
            "value": "SSH host keys generation vulnerability in the server in McAfee Threat Intelligence Exchange Server (TIE Server) 1.3.0, 2.0.x, 2.1.x, 2.2.0 allows man-in-the-middle attackers to spoof servers via acquiring keys from another environment."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.1,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-6700",
        "datePublished": "2018-09-24T13:00:00",
        "description": {
            "lang": "en",
            "value": "DLL Search Order Hijacking vulnerability in Microsoft Windows Client in McAfee True Key (TK) before 5.1.165 allows local users to execute arbitrary code via specially crafted malware."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-6765",
        "datePublished": "2018-03-27T17:00:00",
        "description": {
            "lang": "en",
            "value": "Swisscom MySwisscomAssistant 2.17.1.1065 contains a vulnerability that could allow an unauthenticated, remote attacker to execute arbitrary code on the targeted system. This vulnerability exists due to the way .dll files are loaded. It allows an attacker to load a .dll of the attacker's choosing that could execute arbitrary code without the user's knowledge. The specific flaw exists within the handling of several DLLs (dwmapi.dll, IPHLPAPI.DLL, WindowsCodecs.dll, RpcRtRemote.dll, CRYPTSP.dll, rasadhlp.dll, DNSAPI.dll, ntmarta.dll, netbios.dll, olepro32.dll, security.dll, winhttp.dll, WINSTA.dll) loaded by the MySwisscomAssistant_Setup.exe process."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-6826",
        "datePublished": "2018-02-09T15:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on VOBOT CLOCK before 0.99.30 devices. Cleartext HTTP is used to download a breakout program, and therefore man-in-the-middle attackers can execute arbitrary code by watching for a local user to launch the Breakout Easter Egg feature, and then sending a crafted HTTP response."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-6827",
        "datePublished": "2018-02-09T15:00:00",
        "description": {
            "lang": "en",
            "value": "VOBOT CLOCK before 0.99.30 devices do not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information, and consequently execute arbitrary code, via a crafted certificate, as demonstrated by leveraging a hardcoded --no-check-certificate Wget option."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-6959",
        "datePublished": "2018-04-13T13:00:00Z",
        "description": {
            "lang": "en",
            "value": "VMware vRealize Automation (vRA) prior to 7.4.0 contains a vulnerability in the handling of session IDs. Exploitation of this issue may lead to the hijacking of a valid vRA user's session."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-7032",
        "datePublished": "2018-02-14T15:00:00Z",
        "description": {
            "lang": "en",
            "value": "webcheckout in myrepos through 1.20171231 does not sanitize URLs that are passed to git clone, allowing a malicious website operator or a MitM attacker to take advantage of it for arbitrary code execution, as demonstrated by an \"ext::sh -c\" attack or an option injection attack."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-7160",
        "datePublished": "2018-05-17T14:00:00Z",
        "description": {
            "lang": "en",
            "value": "The Node.js inspector, in 6.x and later is vulnerable to a DNS rebinding attack which could be exploited to perform remote code execution. An attack is possible from malicious websites open in a web browser on the same computer, or another computer with network access to the computer running the Node.js process. A malicious website could use a DNS rebinding attack to trick the web browser to bypass same-origin-policy checks and to allow HTTP connections to localhost or to hosts on the local network. If a Node.js process with the debug port active is running on localhost or on a host on the local network, the malicious website could connect to it as a debugger, and get full code execution access."
        },
        "metrics": [],
        "tags": [
            "dns",
            "rebinding attack"
        ]
    },
    {
        "cveId": "CVE-2018-7211",
        "datePublished": "2018-02-18T04:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in iDashboards 9.6b. The SSO implementation is affected by a weak obfuscation library, allowing man-in-the-middle attackers to discover credentials."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-7239",
        "datePublished": "2018-03-09T23:00:00Z",
        "description": {
            "lang": "en",
            "value": "A DLL hijacking vulnerability exists in Schneider Electric's SoMove Software and associated DTM software components in all versions prior to 2.6.2 which could allow an attacker to execute arbitrary code."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-7295",
        "datePublished": "2018-05-23T12:00:00",
        "description": {
            "lang": "en",
            "value": "ffxivlauncher.exe in Square Enix Final Fantasy XIV 4.21 and 4.25 on Windows is affected by Improper Enforcement of Message Integrity During Transmission in a Communication Channel, allowing a man-in-the-middle attacker to steal user credentials because a session retrieves global.js via http before proceeding to use https. This is fixed in Patch 4.3."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-7298",
        "datePublished": "2018-02-22T19:00:00",
        "description": {
            "lang": "en",
            "value": "In /usr/local/etc/config/addons/mh/loopupd.sh on eQ-3 AG HomeMatic CCU2 2.29.22 devices, software update packages are downloaded via the HTTP protocol, which does not provide any cryptographic protection of the downloaded contents. An attacker with a privileged network position (which could be obtained via DNS spoofing of www.meine-homematic.de or other approaches) can exploit this issue in order to provide arbitrary malicious firmware updates to the CCU2. This can result in a full system compromise."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dns spoofing",
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-7484",
        "datePublished": "2018-02-26T02:00:00Z",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in PureVPN through 5.19.4.0 on Windows. The client installation grants the Everyone group Full Control permission to the installation directory. In addition, the PureVPNService.exe service, which runs under NT Authority\\SYSTEM privileges, tries to load several dynamic-link libraries using relative paths instead of the absolute path. When not using a fully qualified path, the application will first try to load the library from the directory from which the application is started. As the residing directory of PureVPNService.exe is writable to all users, this makes the application susceptible to privilege escalation through DLL hijacking."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-7799",
        "datePublished": "2018-11-02T17:00:00",
        "description": {
            "lang": "en",
            "value": "A DLL hijacking vulnerability exists in Schneider Electric Software Update (SESU), all versions prior to V2.2.0, which could allow an attacker to execute arbitrary code on the targeted system when placing a specific DLL file."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-7842",
        "datePublished": "2019-05-22T19:59:46",
        "description": {
            "lang": "en",
            "value": "A CWE-290: Authentication Bypass by Spoofing vulnerability exists in all versions of the Modicon M580, Modicon M340, Modicon Quantum, and Modicon Premium which could cause an elevation of privilege by conducting a brute force attack on Modbus parameters sent to the controller."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-7884",
        "datePublished": "2018-06-05T21:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in DisplayLink Core Software Cleaner Application 8.2.1956. When the drivers are updated to a newer version, the product launches a process as SYSTEM to uninstall the old version: cl_1956.exe is run as SYSTEM on the %systemroot%\\Temp folder, where any user can write a DLL (e.g., version.dll) to perform DLL Hijacking and elevate privileges to SYSTEM."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-7958",
        "datePublished": "2018-11-27T22:00:00",
        "description": {
            "lang": "en",
            "value": "There is an anonymous TLS cipher suites supported vulnerability in Huawei eSpace product. An unauthenticated, remote attacker launches man-in-the-middle attack to hijack the connection from a client when the user signs up to log in by TLS. Due to insufficient authentication, which may be exploited to intercept and tamper with the data information."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-7959",
        "datePublished": "2018-11-27T22:00:00",
        "description": {
            "lang": "en",
            "value": "There is a short key vulnerability in Huawei eSpace product. An unauthenticated, remote attacker launches man-in-the-middle attack to intercept and decrypt the call information when the user enables SRTP to make a call. Successful exploitation may cause sensitive information leak."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-7960",
        "datePublished": "2018-11-27T22:00:00",
        "description": {
            "lang": "en",
            "value": "There is a SRTP icon display vulnerability in Huawei eSpace product. An unauthenticated, remote attacker launches man-in-the-middle attack to intercept the packets in non-secure transmission mode. Successful exploitation may intercept and tamper with the call information, eventually cause sensitive information leak."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-8004",
        "datePublished": "2018-08-29T13:00:00Z",
        "description": {
            "lang": "en",
            "value": "There are multiple HTTP smuggling and cache poisoning issues when clients making malicious requests interact with Apache Traffic Server (ATS). This affects versions 6.0.0 to 6.2.2 and 7.0.0 to 7.1.3. To resolve this issue users running 6.x should upgrade to 6.2.3 or later versions and 7.x users should upgrade to 7.1.4 or later versions."
        },
        "metrics": [],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2018-8039",
        "datePublished": "2018-07-02T13:00:00Z",
        "description": {
            "lang": "en",
            "value": "It is possible to configure Apache CXF to use the com.sun.net.ssl implementation via 'System.setProperty(\"java.protocol.handler.pkgs\", \"com.sun.net.ssl.internal.www.protocol\");'. When this system property is set, CXF uses some reflection to try to make the HostnameVerifier work with the old com.sun.net.ssl.HostnameVerifier interface. However, the default HostnameVerifier implementation in CXF does not implement the method in this interface, and an exception is thrown. However, in Apache CXF prior to 3.2.5 and 3.1.16 the exception is caught in the reflection code and not properly propagated. What this means is that if you are using the com.sun.net.ssl stack with CXF, an error with TLS hostname verification will not be thrown, leaving a CXF client subject to man-in-the-middle attacks."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-8090",
        "datePublished": "2018-07-25T23:00:00",
        "description": {
            "lang": "en",
            "value": "Quick Heal Total Security 64 bit 17.00 (QHTS64.exe), (QHTSFT64.exe) - Version 10.0.1.38; Quick Heal Total Security 32 bit 17.00 (QHTS32.exe), (QHTSFT32.exe) - Version 10.0.1.38; Quick Heal Internet Security 64 bit 17.00 (QHIS64.exe), (QHISFT64.exe) - Version 10.0.0.37; Quick Heal Internet Security 32 bit 17.00 (QHIS32.exe), (QHISFT32.exe) - Version 10.0.0.37; Quick Heal AntiVirus Pro 64 bit 17.00 (QHAV64.exe), (QHAVFT64.exe) - Version 10.0.0.37; and Quick Heal AntiVirus Pro 32 bit 17.00 (QHAV32.exe), (QHAVFT32.exe) - Version 10.0.0.37 allow DLL Hijacking because of Insecure Library Loading."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2018-8119",
        "datePublished": "2018-05-09T19:00:00",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when the Azure IoT Device Provisioning AMQP Transport library improperly validates certificates over the AMQP protocol, aka \"Azure IoT SDK Spoofing Vulnerability.\" This affects C# SDK, C SDK, Java SDK."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-8153",
        "datePublished": "2018-05-09T19:00:00",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in Microsoft Exchange Server when Outlook Web Access (OWA) fails to properly handle web requests, aka \"Microsoft Exchange Spoofing Vulnerability.\" This affects Microsoft Exchange Server."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-8225",
        "datePublished": "2018-06-14T12:00:00",
        "description": {
            "lang": "en",
            "value": "A remote code execution vulnerability exists in Windows Domain Name System (DNS) DNSAPI.dll when it fails to properly handle DNS responses, aka \"Windows DNSAPI Remote Code Execution Vulnerability.\" This affects Windows 7, Windows Server 2012 R2, Windows RT 8.1, Windows Server 2008, Windows Server 2012, Windows 8.1, Windows Server 2016, Windows Server 2008 R2, Windows 10, Windows 10 Servers."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-8278",
        "datePublished": "2018-07-11T00:00:00",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft Edge improperly handles specific HTML content, aka \"Microsoft Edge Spoofing Vulnerability.\" This affects Microsoft Edge."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-8304",
        "datePublished": "2018-07-11T00:00:00",
        "description": {
            "lang": "en",
            "value": "A denial of service vulnerability exists in Windows Domain Name System (DNS) DNSAPI.dll when it fails to properly handle DNS responses, aka \"Windows DNSAPI Denial of Service Vulnerability.\" This affects Windows 7, Windows Server 2012 R2, Windows RT 8.1, Windows Server 2008, Windows Server 2012, Windows 8.1, Windows Server 2016, Windows Server 2008 R2, Windows 10, Windows 10 Servers."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-8320",
        "datePublished": "2018-10-10T13:00:00",
        "description": {
            "lang": "en",
            "value": "A security feature bypass vulnerability exists in DNS Global Blocklist feature, aka \"Windows DNS Security Feature Bypass Vulnerability.\" This affects Windows Server 2012 R2, Windows Server 2008, Windows Server 2012, Windows Server 2019, Windows Server 2016, Windows Server 2008 R2, Windows 10, Windows 10 Servers."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-8383",
        "datePublished": "2018-08-15T17:00:00",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft Edge does not properly parse HTTP content, aka \"Microsoft Edge Spoofing Vulnerability.\" This affects Microsoft Edge. This CVE ID is unique from CVE-2018-8388."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-8388",
        "datePublished": "2018-08-15T17:00:00",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft Edge improperly handles specific HTML content, aka \"Microsoft Edge Spoofing Vulnerability.\" This affects Microsoft Edge. This CVE ID is unique from CVE-2018-8383."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-8425",
        "datePublished": "2018-09-13T00:00:00",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft Edge improperly handles specific HTML content, aka \"Microsoft Edge Spoofing Vulnerability.\" This affects Microsoft Edge."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-8479",
        "datePublished": "2018-09-13T00:00:00",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists for the Azure IoT Device Provisioning for the C SDK library using the HTTP protocol on Windows platform, aka \"Azure IoT SDK Spoofing Vulnerability.\" This affects C SDK."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-8564",
        "datePublished": "2018-11-14T01:00:00",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft Edge improperly handles specific HTML content, aka \"Microsoft Edge Spoofing Vulnerability.\" This affects Microsoft Edge."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2018-8626",
        "datePublished": "2018-12-12T00:00:00",
        "description": {
            "lang": "en",
            "value": "A remote code execution vulnerability exists in Windows Domain Name System (DNS) servers when they fail to properly handle requests, aka \"Windows DNS Server Heap Overflow Vulnerability.\" This affects Windows Server 2012 R2, Windows Server 2019, Windows Server 2016, Windows 10, Windows 10 Servers."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2018-8929",
        "datePublished": "2018-07-06T12:00:00Z",
        "description": {
            "lang": "en",
            "value": "Improper restriction of communication channel to intended endpoints vulnerability in HTTP daemon in Synology SSL VPN Client before 1.2.4-0224 allows remote attackers to conduct man-in-the-middle attacks via a crafted payload."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.3,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-8970",
        "datePublished": "2018-03-24T21:00:00",
        "description": {
            "lang": "en",
            "value": "The int_x509_param_set_hosts function in lib/libcrypto/x509/x509_vpm.c in LibreSSL 2.7.0 before 2.7.1 does not support a certain special case of a zero name length, which causes silent omission of hostname verification, and consequently allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate. NOTE: the LibreSSL documentation indicates that this special case is supported, but the BoringSSL documentation does not."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2018-9192",
        "datePublished": "2018-09-05T13:00:00Z",
        "description": {
            "lang": "en",
            "value": "A plaintext recovery of encrypted messages or a Man-in-the-middle (MiTM) attack on RSA PKCS #1 v1.5 encryption may be possible without knowledge of the server's private key. Fortinet FortiOS 5.4.6 to 5.4.9, 6.0.0 and 6.0.1 are vulnerable by such attack under SSL Deep Inspection feature when CPx being used."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2018-9194",
        "datePublished": "2018-09-05T13:00:00Z",
        "description": {
            "lang": "en",
            "value": "A plaintext recovery of encrypted messages or a Man-in-the-middle (MiTM) attack on RSA PKCS #1 v1.5 encryption may be possible without knowledge of the server's private key. Fortinet FortiOS 5.4.6 to 5.4.9, 6.0.0 and 6.0.1 are vulnerable by such attack under VIP SSL feature when CPx being used."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    }
]