[
    {
        "cveId": "CVE-2019-0054",
        "datePublished": "2019-10-09T19:26:17.333372Z",
        "description": {
            "lang": "en",
            "value": "An Improper Certificate Validation weakness in the SRX Series Application Identification (app-id) signature update client of Juniper Networks Junos OS allows an attacker to perform Man-in-the-Middle (MitM) attacks which may compromise the integrity and confidentiality of the device. This issue affects: Juniper Networks Junos OS 15.1X49 versions prior to 15.1X49-D120 on SRX Series devices. No other versions of Junos OS are affected."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-0283",
        "datePublished": "2019-04-10T20:23:32",
        "description": {
            "lang": "en",
            "value": "SAP NetWeaver Process Integration (Adapter Engine), fixed in versions 7.10 to 7.11, 7.30, 7.31, 7.40, 7.50; is vulnerable to Digital Signature Spoofing. It is possible to spoof XML signatures and send arbitrary requests to the server via PI Axis adapter. These requests will be accepted by the PI Axis adapter even if the payload has been altered, especially when the signed element is the body of the xml document."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-0334",
        "datePublished": "2019-08-14T13:48:51",
        "description": {
            "lang": "en",
            "value": "When creating a module in SAP BusinessObjects Business Intelligence Platform (BI Workspace), versions 4.1, 4.2, 4.3, it is possible to store a malicious script which when executed later could potentially allow a user to escalate privileges via session hijacking. The attacker could also access other sensitive information, leading to Stored Cross Site Scripting."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-0608",
        "datePublished": "2019-10-10T13:28:40",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft Browsers does not properly parse HTTP content, aka 'Microsoft Browser Spoofing Vulnerability'. This CVE ID is unique from CVE-2019-1357."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-0624",
        "datePublished": "2019-01-17T18:00:00",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when a Skype for Business 2015 server does not properly sanitize a specially crafted request, aka \"Skype for Business 2015 Spoofing Vulnerability.\" This affects Skype."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-0654",
        "datePublished": "2019-03-06T00:00:00",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft browsers improperly handles specific redirects, aka 'Microsoft Browser Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-0657",
        "datePublished": "2019-03-06T00:00:00",
        "description": {
            "lang": "en",
            "value": "A vulnerability exists in certain .Net Framework API's and Visual Studio in the way they parse URL's, aka '.NET Framework and Visual Studio Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-0670",
        "datePublished": "2019-03-06T00:00:00",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in Microsoft SharePoint when the application does not properly parse HTTP content, aka 'Microsoft SharePoint Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-0734",
        "datePublished": "2019-05-16T18:17:00",
        "description": {
            "lang": "en",
            "value": "An elevation of privilege vulnerability exists in Microsoft Windows when a man-in-the-middle attacker is able to successfully decode and replace authentication request using Kerberos, allowing an attacker to be validated as an Administrator.The update addresses this vulnerability by changing how these requests are validated., aka 'Windows Elevation of Privilege Vulnerability'. This CVE ID is unique from CVE-2019-0936."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-0798",
        "datePublished": "2019-04-09T02:33:50",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when a Lync Server or Skype for Business Server does not properly sanitize a specially crafted request, aka 'Skype for Business and Lync Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-0811",
        "datePublished": "2019-07-15T18:56:19",
        "description": {
            "lang": "en",
            "value": "A denial of service vulnerability exists in Windows DNS Server when it fails to properly handle DNS queries, aka 'Windows DNS Server Denial of Service Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-0817",
        "datePublished": "2019-04-09T20:16:25",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in Microsoft Exchange Server when Outlook Web Access (OWA) fails to properly handle web requests, aka 'Microsoft Exchange Spoofing Vulnerability'. This CVE ID is unique from CVE-2019-0858."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-0857",
        "datePublished": "2019-04-09T20:19:48",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability that could allow a security feature bypass exists in when Azure DevOps Server does not properly sanitize user provided input, aka 'Azure DevOps Server Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-0858",
        "datePublished": "2019-04-09T20:19:48",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in Microsoft Exchange Server when Outlook Web Access (OWA) fails to properly handle web requests, aka 'Microsoft Exchange Spoofing Vulnerability'. This CVE ID is unique from CVE-2019-0817."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-0869",
        "datePublished": "2019-04-09T20:20:34",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in Microsoft Azure DevOps Server when it fails to properly handle web requests, aka 'Azure DevOps Server HTML Injection Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-0921",
        "datePublished": "2019-05-16T18:17:02",
        "description": {
            "lang": "en",
            "value": "An spoofing vulnerability exists when Internet Explorer improperly handles URLs, aka 'Internet Explorer Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-0949",
        "datePublished": "2019-05-16T18:17:03",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server, aka 'Microsoft SharePoint Spoofing Vulnerability'. This CVE ID is unique from CVE-2019-0950, CVE-2019-0951."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-0950",
        "datePublished": "2019-05-16T18:17:03",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server, aka 'Microsoft SharePoint Spoofing Vulnerability'. This CVE ID is unique from CVE-2019-0949, CVE-2019-0951."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-0951",
        "datePublished": "2019-05-16T18:17:03",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server, aka 'Microsoft SharePoint Spoofing Vulnerability'. This CVE ID is unique from CVE-2019-0949, CVE-2019-0950."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-0996",
        "datePublished": "2019-06-12T13:49:39",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in Azure DevOps Server when it improperly handles requests to authorize applications, resulting in a cross-site request forgery, aka 'Azure DevOps Server Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1000006",
        "datePublished": "2019-02-04T21:00:00",
        "description": {
            "lang": "en",
            "value": "RIOT RIOT-OS version after commit 7af03ab624db0412c727eed9ab7630a5282e2fd3 contains a Buffer Overflow vulnerability in sock_dns, an implementation of the DNS protocol utilizing the RIOT sock API that can result in Remote code executing. This attack appears to be exploitable via network connectivity."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-1010100",
        "datePublished": "2019-07-19T15:37:12",
        "description": {
            "lang": "en",
            "value": "Akeo Consulting Rufus 3.0 and earlier is affected by: DLL search order hijacking. The impact is: Arbitrary code execution WITH escalation of privilege. The component is: Executable installers, portable executables (ALL executables on the web site). The attack vector is: CAPEC-471, CWE-426, CWE-427."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-1010206",
        "datePublished": "2019-07-23T13:30:18",
        "description": {
            "lang": "en",
            "value": "OSS Http Request (Apache Cordova Plugin) 6 is affected by: Missing SSL certificate validation. The impact is: certificate spoofing. The component is: use this library when https communication. The attack vector is: certificate spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1010251",
        "datePublished": "2019-07-18T17:48:48",
        "description": {
            "lang": "en",
            "value": "Open Information Security Foundation Suricata prior to version 4.1.2 is affected by: Denial of Service - DNS detection bypass. The impact is: An attacker can evade a signature detection with a specialy formed network packet. The component is: app-layer-detect-proto.c, decode.c, decode-teredo.c and decode-ipv6.c (https://github.com/OISF/suricata/pull/3590/commits/11f3659f64a4e42e90cb3c09fcef66894205aefe, https://github.com/OISF/suricata/pull/3590/commits/8357ef3f8ffc7d99ef6571350724160de356158b). The attack vector is: An attacker can trigger the vulnerability by sending a specifically crafted network request. The fixed version is: 4.1.2."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-1010260",
        "datePublished": "2019-04-02T14:03:49",
        "description": {
            "lang": "en",
            "value": "Using ktlint to download and execute custom rulesets can result in arbitrary code execution as the served jars can be compromised by a MITM. This attack is exploitable via Man in the Middle of the HTTP connection to the artifact servers. This vulnerability appears to have been fixed in 0.30.0 and later; after commit 5e547b287d6c260d328a2cb658dbe6b7a7ff2261."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-1020010",
        "datePublished": "2019-07-29T12:12:04",
        "description": {
            "lang": "en",
            "value": "Misskey before 10.102.4 allows hijacking a user's token."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-10008",
        "datePublished": "2019-04-24T18:58:55",
        "description": {
            "lang": "en",
            "value": "Zoho ManageEngine ServiceDesk 9.3 allows session hijacking and privilege escalation because an established guest session is automatically converted into an established administrator session when the guest user enters the administrator username, with an arbitrary incorrect password, in an mc/ login attempt within a different browser tab."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-10076",
        "datePublished": "2019-05-20T20:31:41",
        "description": {
            "lang": "en",
            "value": "A carefully crafted malicious attachment could trigger an XSS vulnerability on Apache JSPWiki 2.9.0 to 2.11.0.M3, which could lead to session hijacking."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-10077",
        "datePublished": "2019-05-20T20:46:15",
        "description": {
            "lang": "en",
            "value": "A carefully crafted InterWiki link could trigger an XSS vulnerability on Apache JSPWiki 2.9.0 to 2.11.0.M3, which could lead to session hijacking."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-10078",
        "datePublished": "2019-05-20T20:50:54",
        "description": {
            "lang": "en",
            "value": "A carefully crafted plugin link invocation could trigger an XSS vulnerability on Apache JSPWiki 2.9.0 to 2.11.0.M3, which could lead to session hijacking. Initial reporting indicated ReferredPagesPlugin, but further analysis showed that multiple plugins were vulnerable."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-10091",
        "datePublished": "2020-03-16T13:05:51",
        "description": {
            "lang": "en",
            "value": "When TLS is enabled with ssl-endpoint-identification-enabled set to true, Apache Geode fails to perform hostname verification of the entries in the certificate SAN during the SSL handshake. This could compromise intra-cluster communication using a man-in-the-middle attack."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-10101",
        "datePublished": "2019-07-03T00:00:00",
        "description": {
            "lang": "en",
            "value": "JetBrains Kotlin versions before 1.3.30 were resolving artifacts using an http connection during the build process, potentially allowing an MITM attack."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-10102",
        "datePublished": "2019-07-03T00:00:00",
        "description": {
            "lang": "en",
            "value": "JetBrains Ktor framework (created using the Kotlin IDE template) versions before 1.1.0 were resolving artifacts using an http connection during the build process, potentially allowing an MITM attack. This issue was fixed in Kotlin plugin version 1.3.30."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-10103",
        "datePublished": "2019-07-03T00:00:00",
        "description": {
            "lang": "en",
            "value": "JetBrains IntelliJ IDEA projects created using the Kotlin (JS Client/JVM Server) IDE Template were resolving Gradle artifacts using an http connection, potentially allowing an MITM attack. This issue, which was fixed in Kotlin plugin version 1.3.30, is similar to CVE-2019-10101."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-10162",
        "datePublished": "2019-07-30T22:15:35",
        "description": {
            "lang": "en",
            "value": "A vulnerability has been found in PowerDNS Authoritative Server before versions 4.1.10, 4.0.8 allowing an authorized user to cause the server to exit by inserting a crafted record in a MASTER type zone under their control. The issue is due to the fact that the Authoritative Server will exit when it runs into a parsing error while looking up the NS/A/AAAA records it is about to use for an outgoing notify."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 3.5,
                "severity": "LOW"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-10163",
        "datePublished": "2019-07-30T22:16:59",
        "description": {
            "lang": "en",
            "value": "A Vulnerability has been found in PowerDNS Authoritative Server before versions 4.1.9, 4.0.8 allowing a remote, authorized master server to cause a high CPU load or even prevent any further updates to any slave zone by sending a large number of NOTIFY messages. Note that only servers configured as slaves are affected by this issue."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 3.5,
                "severity": "LOW"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-10190",
        "datePublished": "2019-07-16T17:50:05",
        "description": {
            "lang": "en",
            "value": "A vulnerability was discovered in DNS resolver component of knot resolver through version 3.2.0 before 4.1.0 which allows remote attackers to bypass DNSSEC validation for non-existence answer. NXDOMAIN answer would get passed through to the client even if its DNSSEC validation failed, instead of sending a SERVFAIL packet. Caching is not affected by this particular bug but see CVE-2019-10191."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2019-10191",
        "datePublished": "2019-07-16T17:52:43",
        "description": {
            "lang": "en",
            "value": "A vulnerability was discovered in DNS resolver of knot resolver before version 4.1.0 which allows remote attackers to downgrade DNSSEC-secure domains to DNSSEC-insecure state, opening possibility of domain hijack using attacks against insecure DNS protocol."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2019-10203",
        "datePublished": "2019-11-22T12:01:13",
        "description": {
            "lang": "en",
            "value": "PowerDNS Authoritative daemon , pdns versions 4.0.x before 4.0.9, 4.1.x before 4.1.11, exiting when encountering a serial between 2^31 and 2^32-1 while trying to notify a slave leads to DoS."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 4.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-10214",
        "datePublished": "2019-11-25T10:41:15",
        "description": {
            "lang": "en",
            "value": "The containers/image library used by the container tools Podman, Buildah, and Skopeo in Red Hat Enterprise Linux version 8 and CRI-O in OpenShift Container Platform, does not enforce TLS connections to the container registry authorization service. An attacker could use this vulnerability to launch a MiTM attack and steal login credentials or bearer tokens."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-10240",
        "datePublished": "2019-04-03T18:04:29",
        "description": {
            "lang": "en",
            "value": "Eclipse hawkBit versions prior to 0.3.0M2 resolved Maven build artifacts for the Vaadin based UI over HTTP instead of HTTPS. Any of these dependent artifacts could have been maliciously compromised by a MITM attack. Hence produced build artifacts of hawkBit might be infected."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-10248",
        "datePublished": "2019-04-22T20:15:24",
        "description": {
            "lang": "en",
            "value": "Eclipse Vorto versions prior to 0.11 resolved Maven build artifacts for the Xtext project over HTTP instead of HTTPS. Any of these dependent artifacts could have been maliciously compromised by a MITM attack. Hence produced build artifacts of Vorto might be infected."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-10250",
        "datePublished": "2019-03-28T14:00:43",
        "description": {
            "lang": "en",
            "value": "UCWeb UC Browser 7.0.185.1002 on Windows uses HTTP for downloading certain PDF modules, which allows MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-10251",
        "datePublished": "2019-03-28T14:01:04",
        "description": {
            "lang": "en",
            "value": "The UCWeb UC Browser application through 2019-03-26 for Android uses HTTP to download certain modules associated with PDF and Microsoft Office files (related to libpicsel), which allows MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-10261",
        "datePublished": "2019-04-03T14:07:38",
        "description": {
            "lang": "en",
            "value": "CentOS Web Panel (CWP) 0.9.8.789 is vulnerable to Stored/Persistent XSS for the \"Name Server 1\" and \"Name Server 2\" fields via a \"DNS Functions\" \"Edit Nameservers IPs\" action."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-10639",
        "datePublished": "2019-07-05T22:07:27",
        "description": {
            "lang": "en",
            "value": "The Linux kernel 4.x (starting from 4.1) and 5.x before 5.0.8 allows Information Exposure (partial kernel address disclosure), leading to a KASLR bypass. Specifically, it is possible to extract the KASLR kernel image offset using the IP ID values the kernel produces for connection-less protocols (e.g., UDP and ICMP). When such traffic is sent to multiple destination IP addresses, it is possible to obtain hash collisions (of indices to the counter array) and thereby obtain the hashing key (via enumeration). This key contains enough bits from a kernel address (of a static variable) so when the key is extracted (via enumeration), the offset of the kernel image is exposed. This attack can be carried out remotely, by the attacker forcing the target device to send UDP or ICMP (or certain other) traffic to attacker-controlled IP addresses. Forcing a server to send UDP traffic is trivial if the server is a DNS server. ICMP traffic is trivial if the server answers ICMP Echo requests (ping). For client targets, if the target visits the attacker's web page, then WebRTC or gQUIC can be used to force UDP traffic to attacker-controlled IP addresses. NOTE: this attack against KASLR became viable in 4.1 because IP ID generation was changed to have a dependency on an address associated with a network namespace."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-10648",
        "datePublished": "2019-03-30T12:53:57",
        "description": {
            "lang": "en",
            "value": "Robocode through 1.9.3.5 allows remote attackers to cause external service interaction (DNS), as demonstrated by a query for a unique subdomain name within an attacker-controlled DNS zone, because of a .openStream call within java.net.URL."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-10677",
        "datePublished": "2019-09-05T13:23:06",
        "description": {
            "lang": "en",
            "value": "Multiple Cross-Site Scripting (XSS) issues in the web interface on DASAN Zhone ZNID GPON 2426A EU version S3.1.285 devices allow a remote attacker to execute arbitrary JavaScript via manipulation of an unsanitized GET parameter: /zhndnsdisplay.cmd (name), /wlsecrefresh.wl (wlWscCfgMethod, wl_wsc_reg)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-10753",
        "datePublished": "2019-09-05T19:45:24",
        "description": {
            "lang": "en",
            "value": "In all versions prior to version 3.9.6 for eclipse-wtp, all versions prior to version 9.4.4 for eclipse-cdt, and all versions prior to version 3.0.1 for eclipse-groovy, Spotless was resolving dependencies over an insecure channel (http). If the build occurred over an insecure connection, a malicious user could have perform a Man-in-the-Middle attack during the build and alter the build artifacts that were produced. In case that any of these artifacts were compromised, any developers using these could be altered. **Note:** In order to validate that this artifact was not compromised, the maintainer would need to confirm that none of the artifacts published to the registry were not altered with. Until this happens, we can not guarantee that this artifact was not compromised even though the probability that this happened is low."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-10875",
        "datePublished": "2019-04-05T12:36:49",
        "description": {
            "lang": "en",
            "value": "A URL spoofing vulnerability was found in all international versions of Xiaomi Mi browser 10.5.6-g (aka the MIUI native browser) and Mint Browser 1.5.3 due to the way they handle the \"q\" query parameter. The portion of an https URL before the ?q= substring is not shown to the user."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-10902",
        "datePublished": "2019-04-09T03:53:25",
        "description": {
            "lang": "en",
            "value": "In Wireshark 3.0.0, the TSDNS dissector could crash. This was addressed in epan/dissectors/packet-tsdns.c by splitting strings safely."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-10929",
        "datePublished": "2019-08-13T18:55:57",
        "description": {
            "lang": "en",
            "value": "A vulnerability has been identified in SIMATIC CP 1626 (All versions), SIMATIC ET 200SP Open Controller CPU 1515SP PC (incl. SIPLUS variants) (All versions), SIMATIC ET 200SP Open Controller CPU 1515SP PC2 (incl. SIPLUS variants) (All versions < V20.8), SIMATIC HMI Panel (incl. SIPLUS variants) (All versions), SIMATIC NET PC Software V14 (All versions < V14 SP1 Update 14), SIMATIC NET PC Software V15 (All versions), SIMATIC S7-1200 CPU family (incl. SIPLUS variants) (All versions < V4.4.0), SIMATIC S7-1500 CPU family (incl. related ET200 CPUs and SIPLUS variants) (All versions < V2.8.1), SIMATIC S7-1500 Software Controller (All versions < V20.8), SIMATIC S7-PLCSIM Advanced (All versions < V3.0), SIMATIC STEP 7 (TIA Portal) (All versions < V16), SIMATIC WinCC (TIA Portal) (All versions < V16), SIMATIC WinCC OA (All versions < V3.16 P013), SIMATIC WinCC Runtime Advanced (All versions < V16), SIMATIC WinCC Runtime Professional (All versions < V16), TIM 1531 IRC (incl. SIPLUS NET variants) (All versions < V2.1). Affected devices contain a message protection bypass vulnerability due to certain properties in the calculation used for integrity protection. This could allow an attacker in a Man-in-the-Middle position to modify network traffic sent on port 102/tcp to the affected devices."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-11014",
        "datePublished": "2019-04-08T19:44:56",
        "description": {
            "lang": "en",
            "value": "The VStarCam vstc.vscam.client library and vstc.vscam shared object, as used in the Eye4 application (for Android, iOS, and Windows), do not prevent spoofing of the camera server. An attacker can create a fake camera server that listens for the client looking for a camera on the local network. When the camera responds to the client, it responds via the broadcast address, giving all information necessary to impersonate the camera. The attacker then floods the client with responses, causing the original camera to be denied service from the client, and thus causing the client to then communicate exclusively with the attacker's fake camera server. When connecting to the fake camera server, the client sends all details necessary to login to the camera (username and password)."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-11065",
        "datePublished": "2019-04-09T23:37:04",
        "description": {
            "lang": "en",
            "value": "Gradle versions from 1.4 to 5.3.1 use an insecure HTTP URL to download dependencies when the built-in JavaScript or CoffeeScript Gradle plugins are used. Dependency artifacts could have been maliciously compromised by a MITM attack against the ajax.googleapis.com web site."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-11189",
        "datePublished": "2020-02-20T21:36:02",
        "description": {
            "lang": "en",
            "value": "Authentication Bypass by Spoofing in org.onosproject.acl (access control) and org.onosproject.mobility (host mobility) in ONOS v2.0 and earlier allows attackers to bypass network access control via data plane packet injection. To exploit the vulnerability, an attacker sends a gratuitous ARP reply that causes the host mobility application to remove existing access control flow denial rules in the network. The access control application does not re-install flow deny rules, so the attacker can bypass the intended access control policy."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-11234",
        "datePublished": "2019-04-21T16:36:48",
        "description": {
            "lang": "en",
            "value": "FreeRADIUS before 3.0.19 does not prevent use of reflection for authentication spoofing, aka a \"Dragonblood\" issue, a similar issue to CVE-2019-9497."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-11242",
        "datePublished": "2019-07-12T19:04:51",
        "description": {
            "lang": "en",
            "value": "A man-in-the-middle vulnerability related to vCenter access was found in Cohesity DataPlatform version 5.x and 6.x prior to 6.1.1c. Cohesity clusters did not verify TLS certificates presented by vCenter. This vulnerability could expose Cohesity user credentials configured to access vCenter."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-11288",
        "datePublished": "2020-01-27T18:50:13.211744Z",
        "description": {
            "lang": "en",
            "value": "In Pivotal tc Server, 3.x versions prior to 3.2.19 and 4.x versions prior to 4.0.10, and Pivotal tc Runtimes, 7.x versions prior to 7.0.99.B, 8.x versions prior to 8.5.47.A, and 9.x versions prior to 9.0.27.A, when a tc Runtime instance is configured with the JMX Socket Listener, a local attacker without access to the tc Runtime process or configuration files is able to manipulate the RMI registry to perform a man-in-the-middle attack to capture user names and passwords used to access the JMX interface. The attacker can then use these credentials to access the JMX interface and gain complete control over the tc Runtime instance."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.3,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-11404",
        "datePublished": "2019-04-21T16:06:56",
        "description": {
            "lang": "en",
            "value": "arrow-kt Arrow before 0.9.0 resolved Gradle build artifacts (for compiling and building the published JARs) over HTTP instead of HTTPS. Any of these dependent artifacts could have been maliciously compromised by an MITM attack."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.1,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-11429",
        "datePublished": "2019-05-13T14:44:56",
        "description": {
            "lang": "en",
            "value": "CentOS-WebPanel.com (aka CWP) CentOS Web Panel 0.9.8.793 (Free/Open Source Version), 0.9.8.753 (Pro) and 0.9.8.807 (Pro) is vulnerable to Reflected XSS for the \"Domain\" field on the \"DNS Functions > \"Add DNS Zone\" screen."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-11480",
        "datePublished": "2020-04-14T02:10:13.554325Z",
        "description": {
            "lang": "en",
            "value": "The pc-kernel snap build process hardcoded the --allow-insecure-repositories and --allow-unauthenticated apt options when creating the build chroot environment. This could allow an attacker who is able to perform a MITM attack between the build environment and the Ubuntu archive to install a malicious package within the build chroot. This issue affects pc-kernel versions prior to and including 2019-07-16"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.4,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-11521",
        "datePublished": "2019-08-20T12:26:10",
        "description": {
            "lang": "en",
            "value": "OX App Suite 7.10.1 allows Content Spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-11540",
        "datePublished": "2019-04-26T01:39:49",
        "description": {
            "lang": "en",
            "value": "In Pulse Secure Pulse Connect Secure version 9.0RX before 9.0R3.4 and 8.3RX before 8.3R7.1 and Pulse Policy Secure version 9.0RX before 9.0R3.2 and 5.4RX before 5.4R7.1, an unauthenticated, remote attacker can conduct a session hijacking attack."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.3,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-11554",
        "datePublished": "2019-12-06T15:07:02",
        "description": {
            "lang": "en",
            "value": "The Audible application through 2.34.0 for Android has Missing SSL Certificate Validation for Adobe SDKs, allowing MITM attackers to cause a denial of service."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-11644",
        "datePublished": "2019-05-17T20:05:35",
        "description": {
            "lang": "en",
            "value": "In the F-Secure installer in F-Secure SAFE for Windows before 17.6, F-Secure Internet Security before 17.6, F-Secure Anti-Virus before 17.6, F-Secure Client Security Standard and Premium before 14.10, F-Secure PSB Workstation Security before 12.01, and F-Secure Computer Protection Standard and Premium before 19.3, a local user can escalate their privileges through a DLL hijacking attack against the installer. The installer writes the file rm.exe to C:\\Windows\\Temp and then executes it. The rm.exe process then attempts to load several DLLs from its current directory. Non-admin users are able to write to this folder, so an attacker can create a malicious C:\\Windows\\Temp\\OLEACC.dll file. When an admin runs the installer, rm.exe will execute the attacker's DLL in an elevated security context."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-11650",
        "datePublished": "2019-07-10T18:02:45",
        "description": {
            "lang": "en",
            "value": "A potential Man in the Middle attack (MITM) was found in NetIQ Advanced Authentication Framework versions prior to 6.0."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-11674",
        "datePublished": "2019-10-22T14:42:32",
        "description": {
            "lang": "en",
            "value": "Man-in-the-middle vulnerability in Micro Focus Self Service Password Reset, affecting all versions prior to 4.4.0.4. The vulnerability could exploit invalid certificate validation and may result in a man-in-the-middle attack."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-11676",
        "datePublished": "2019-05-02T13:05:49",
        "description": {
            "lang": "en",
            "value": "The user defined DNS name in Zoho ManageEngine Firewall Analyzer before 12.3 Build 123224 is vulnerable to stored XSS attacks."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-11697",
        "datePublished": "2019-07-23T13:22:10",
        "description": {
            "lang": "en",
            "value": "If the ALT and \"a\" keys are pressed when users receive an extension installation prompt, the extension will be installed without the install prompt delay that keeps the prompt visible in order for users to accept or decline the installation. A malicious web page could use this with spoofing on the page to trick users into installing a malicious extension. This vulnerability affects Firefox < 67."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-11699",
        "datePublished": "2019-07-23T13:21:47",
        "description": {
            "lang": "en",
            "value": "A malicious page can briefly cause the wrong name to be highlighted as the domain name in the addressbar during page navigations. This could result in user confusion of which site is currently loaded for spoofing attacks. This vulnerability affects Firefox < 67."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-11717",
        "datePublished": "2019-07-23T13:18:07",
        "description": {
            "lang": "en",
            "value": "A vulnerability exists where the caret (\"^\") character is improperly escaped constructing some URIs due to it being used as a separator, allowing for possible spoofing of origin attributes. This vulnerability affects Firefox ESR < 60.8, Firefox < 68, and Thunderbird < 60.8."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-11721",
        "datePublished": "2019-07-23T13:17:26",
        "description": {
            "lang": "en",
            "value": "The unicode latin 'kra' character can be used to spoof a standard 'k' character in the addressbar. This allows for domain spoofing attacks as do not display as punycode text, allowing for user confusion. This vulnerability affects Firefox < 68."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-11770",
        "datePublished": "2019-06-14T13:53:59",
        "description": {
            "lang": "en",
            "value": "In Eclipse Buildship versions prior to 3.1.1, the build files indicate that this project is resolving dependencies over HTTP instead of HTTPS. Any of these artifacts could have been MITM to maliciously compromise them and infect the build artifacts that were produced. Additionally, if any of these JARs or other dependencies were compromised, any developers using these could continue to be infected past updating to fix this."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-12098",
        "datePublished": "2019-05-15T22:41:11",
        "description": {
            "lang": "en",
            "value": "In the client side of Heimdal before 7.6.0, failure to verify anonymous PKINIT PA-PKINIT-KX key exchange permits a man-in-the-middle attack. This issue is in krb5_init_creds_step in lib/krb5/init_creds_pw.c."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-12177",
        "datePublished": "2019-06-03T19:22:04",
        "description": {
            "lang": "en",
            "value": "Privilege escalation due to insecure directory permissions affecting ViveportDesktopService in HTC VIVEPORT before 1.0.0.36 allows local attackers to escalate privileges via DLL hijacking."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-12269",
        "datePublished": "2019-05-21T19:50:08",
        "description": {
            "lang": "en",
            "value": "Enigmail before 2.0.11 allows PGP signature spoofing: for an inline PGP message, an attacker can cause the product to display a \"correctly signed\" message indication, but display different unauthenticated text."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-12278",
        "datePublished": "2020-03-12T21:48:40",
        "description": {
            "lang": "en",
            "value": "Opera through 53 on Android allows Address Bar Spoofing. Characters from several languages are displayed in Right-to-Left order, due to mishandling of several Unicode characters. The rendering mechanism, in conjunction with the \"first strong character\" concept, may improperly operate on a numerical IP address or an alphabetic string, leading to a spoofed URL."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-12418",
        "datePublished": "2019-12-23T17:12:43",
        "description": {
            "lang": "en",
            "value": "When Apache Tomcat 9.0.0.M1 to 9.0.28, 8.5.0 to 8.5.47, 7.0.0 and 7.0.97 is configured with the JMX Remote Lifecycle Listener, a local attacker without access to the Tomcat process or configuration files is able to manipulate the RMI registry to perform a man-in-the-middle attack to capture user names and passwords used to access the JMX interface. The attacker can then use these credentials to access the JMX interface and gain complete control over the Tomcat instance."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-12435",
        "datePublished": "2019-06-19T11:56:01",
        "description": {
            "lang": "en",
            "value": "Samba 4.9.x before 4.9.9 and 4.10.x before 4.10.5 has a NULL pointer dereference, leading to Denial of Service. This is related to the AD DC DNS management server (dnsserver) RPC server process."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-12443",
        "datePublished": "2020-03-10T14:41:01",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in GitLab Community and Enterprise Edition 10.2 through 11.11. Multiple features contained Server-Side Request Forgery (SSRF) vulnerabilities caused by an insufficient validation to prevent DNS rebinding attacks."
        },
        "metrics": [],
        "tags": [
            "dns",
            "rebinding attack"
        ]
    },
    {
        "cveId": "CVE-2019-12500",
        "datePublished": "2019-05-31T11:55:23",
        "description": {
            "lang": "en",
            "value": "The Xiaomi M365 scooter 2019-02-12 before 1.5.1 allows spoofing of \"suddenly accelerate\" commands. This occurs because Bluetooth Low Energy commands have no server-side authentication check. Other affected commands include suddenly braking, locking, and unlocking."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-12511",
        "datePublished": "2020-02-24T18:16:26",
        "description": {
            "lang": "en",
            "value": "In NETGEAR Nighthawk X10-R9000 prior to 1.0.4.26, an attacker may execute arbitrary system commands as root by sending a specially-crafted MAC address to the \"NETGEAR Genie\" SOAP endpoint at AdvancedQoS:GetCurrentBandwidthByMAC. Although this requires QoS being enabled, advanced QoS being enabled, and a valid authentication JWT, additional vulnerabilities (CVE-2019-12510) allow an attacker to interact with the entire SOAP API without authentication. Additionally, DNS rebinding techniques may be used to exploit this vulnerability remotely. Exploiting this vulnerability is somewhat involved. The following limitations apply to the payload and must be overcome for successful exploitation: - No more than 17 characters may be used. - At least one colon must be included to prevent mangling. - A single-quote and meta-character must be used to break out of the existing command. - Parent command remnants after the injection point must be dealt with. - The payload must be in all-caps. Despite these limitations, it is still possible to gain access to an interactive root shell via this vulnerability. Since the web server assigns certain HTTP headers to environment variables with all-caps names, it is possible to insert a payload into one such header and reference the subsequent environment variable in the injection point."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-12621",
        "datePublished": "2019-08-21T18:00:28.606438Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in Cisco HyperFlex Software could allow an unauthenticated, remote attacker to perform a man-in-the-middle attack. The vulnerability is due to insufficient key management. An attacker could exploit this vulnerability by obtaining a specific encryption key for the cluster. A successful exploit could allow the attacker to perform a man-in-the-middle attack against other nodes in the cluster."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-12665",
        "datePublished": "2019-09-25T20:15:34.426881Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the HTTP client feature of Cisco IOS and IOS XE Software could allow an unauthenticated, remote attacker to read and modify data that should normally have been sent via an encrypted channel. The vulnerability is due to TCP port information not being considered when matching new requests to existing, persistent HTTP connections. An attacker could exploit this vulnerability by acting as a man-in-the-middle and then reading and/or modifying data that should normally have been sent through an encrypted channel."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 4.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-12749",
        "datePublished": "2019-06-11T16:11:45",
        "description": {
            "lang": "en",
            "value": "dbus before 1.10.28, 1.12.x before 1.12.16, and 1.13.x before 1.13.12, as used in DBusServer in Canonical Upstart in Ubuntu 14.04 (and in some, less common, uses of dbus-daemon), allows cookie spoofing because of symlink mishandling in the reference implementation of DBUS_COOKIE_SHA1 in the libdbus library. (This only affects the DBUS_COOKIE_SHA1 authentication mechanism.) A malicious client with write access to its own home directory could manipulate a ~/.dbus-keyrings symlink to cause a DBusServer with a different uid to read and write in unintended locations. In the worst case, this could result in the DBusServer reusing a cookie that is known to the malicious client, and treating that cookie as evidence that a subsequent client connection came from an attacker-chosen uid, allowing authentication bypass."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-12782",
        "datePublished": "2019-07-09T15:20:44",
        "description": {
            "lang": "en",
            "value": "An authorization bypass vulnerability in pinboard updates in ThoughtSpot 4.4.1 through 5.1.1 (before 5.1.2) allows a low-privilege user with write access to at least one pinboard to corrupt pinboards of another user in the application by spoofing GUIDs in pinboard update requests, effectively deleting them."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-12820",
        "datePublished": "2019-07-19T17:18:28",
        "description": {
            "lang": "en",
            "value": "A vulnerability was found in the app 2.0 of the Shenzhen Jisiwei i3 robot vacuum cleaner. Actions performed on the app such as changing a password, and personal information it communicates with the server, use unencrypted HTTP. As an example, while logging in through the app to a Jisiwei account, the login request is being sent in cleartext. The vulnerability exists in both the Android and iOS version of the app. An attacker could exploit this by using an MiTM attack on the local network to obtain someone's login credentials, which gives them full access to the robot vacuum cleaner."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-12855",
        "datePublished": "2019-06-16T11:11:43",
        "description": {
            "lang": "en",
            "value": "In words.protocols.jabber.xmlstream in Twisted through 19.2.1, XMPP support did not verify certificates when used with TLS, allowing an attacker to MITM connections."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-12936",
        "datePublished": "2019-06-23T22:35:30",
        "description": {
            "lang": "en",
            "value": "BlueStacks App Player 2, 3, and 4 before 4.90 allows DNS Rebinding for attacks on exposed IPC functions."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.1,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-13163",
        "datePublished": "2020-02-07T22:45:40",
        "description": {
            "lang": "en",
            "value": "The Fujitsu TLS library allows a man-in-the-middle attack. This affects Interstage Application Development Cycle Manager V10 and other versions, Interstage Application Server V12 and other versions, Interstage Business Application Manager V2 and other versions, Interstage Information Integrator V11 and other versions, Interstage Job Workload Server V8, Interstage List Works V10 and other versions, Interstage Studio V12 and other versions, Interstage Web Server Express V11, Linkexpress V5, Safeauthor V3, ServerView Resource Orchestrator V3, Systemwalker Cloud Business Service Management V1, Systemwalker Desktop Keeper V15, Systemwalker Desktop Patrol V15, Systemwalker IT Change Manager V14, Systemwalker Operation Manager V16 and other versions, Systemwalker Runbook Automation V15 and other versions, Systemwalker Security Control V1, and Systemwalker Software Configuration Manager V15."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-13167",
        "datePublished": "2020-03-13T18:24:17",
        "description": {
            "lang": "en",
            "value": "Multiple Stored XSS vulnerabilities were found in the Xerox Web Application, used by the Phaser 3320 V53.006.16.000 and other printers. Successful exploitation of this vulnerability can lead to session hijacking of the administrator in the web application or the execution of unwanted actions."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-13176",
        "datePublished": "2019-08-08T13:26:33",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in the 3CX Phone system (web) management console 12.5.44178.1002 through 12.5 SP2. The Content.MainForm.wgx component is affected by XXE via a crafted XML document in POST data. There is potential to use this for SSRF (reading local files, outbound HTTP, and outbound DNS)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-13198",
        "datePublished": "2020-03-13T18:08:38",
        "description": {
            "lang": "en",
            "value": "The web application of several Kyocera printers (such as the ECOSYS M5526cdw 2R7_2000.001.701) was affected by Stored XSS. Successful exploitation of this vulnerability can lead to session hijacking of the administrator in the web application or the execution of unwanted actions."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-13200",
        "datePublished": "2020-03-13T18:06:26",
        "description": {
            "lang": "en",
            "value": "The web application of several Kyocera printers (such as the ECOSYS M5526cdw 2R7_2000.001.701) was affected by Reflected XSS. Successful exploitation of this vulnerability can lead to session hijacking of the administrator in the web application or the execution of unwanted actions."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-13209",
        "datePublished": "2019-09-04T13:40:18",
        "description": {
            "lang": "en",
            "value": "Rancher 2 through 2.2.4 is vulnerable to a Cross-Site Websocket Hijacking attack that allows an exploiter to gain access to clusters managed by Rancher. The attack requires a victim to be logged into a Rancher server, and then to access a third-party site hosted by the exploiter. Once that is accomplished, the exploiter is able to execute commands against the cluster's Kubernetes API with the permissions and identity of the victim."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-13376",
        "datePublished": "2019-09-27T12:08:57",
        "description": {
            "lang": "en",
            "value": "phpBB version 3.2.7 allows the stealing of an Administration Control Panel session id by leveraging CSRF in the Remote Avatar feature. The CSRF Token Hijacking leads to stored XSS"
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-13398",
        "datePublished": "2019-07-08T00:01:43",
        "description": {
            "lang": "en",
            "value": "Dynacolor FCM-MB40 v1.2.0.0 devices allow remote attackers to execute arbitrary commands via a crafted parameter to a CGI script, as demonstrated by sed injection in cgi-bin/camctrl_save_profile.cgi (save parameter) and cgi-bin/ddns.cgi."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-13467",
        "datePublished": "2019-09-30T18:30:27",
        "description": {
            "lang": "en",
            "value": "Description: Western Digital SSD Dashboard before 2.5.1.0 and SanDisk SSD Dashboard before 2.5.1.0 applications are potentially vulnerable to man-in-the-middle attacks when the applications download resources from the Dashboard web service. This vulnerability may allow an attacker to substitute downloaded resources with arbitrary files."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-13498",
        "datePublished": "2019-07-29T16:01:19",
        "description": {
            "lang": "en",
            "value": "One Identity Cloud Access Manager 8.1.3 does not use HTTP Strict Transport Security (HSTS), which may allow man-in-the-middle (MITM) attacks. This issue is fixed in version 8.1.4."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-13611",
        "datePublished": "2019-07-15T23:17:14",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in python-engineio through 3.8.2. There is a Cross-Site WebSocket Hijacking (CSWSH) vulnerability that allows attackers to make WebSocket connections to a server by using a victim's credentials, because the Origin header is not restricted."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-13659",
        "datePublished": "2019-11-25T14:22:53",
        "description": {
            "lang": "en",
            "value": "IDN spoofing in Omnibox in Google Chrome prior to 77.0.3865.75 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13660",
        "datePublished": "2019-11-25T14:22:53",
        "description": {
            "lang": "en",
            "value": "UI spoofing in Chromium in Google Chrome prior to 77.0.3865.75 allowed a remote attacker to spoof notifications via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13661",
        "datePublished": "2019-11-25T14:22:53",
        "description": {
            "lang": "en",
            "value": "UI spoofing in Chromium in Google Chrome prior to 77.0.3865.75 allowed a remote attacker to spoof notifications via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13663",
        "datePublished": "2019-11-25T14:22:53",
        "description": {
            "lang": "en",
            "value": "IDN spoofing in Omnibox in Google Chrome prior to 77.0.3865.75 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13671",
        "datePublished": "2019-11-25T14:22:53",
        "description": {
            "lang": "en",
            "value": "UI spoofing in Blink in Google Chrome prior to 77.0.3865.75 allowed a remote attacker to spoof security UI via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13674",
        "datePublished": "2019-11-25T14:22:53",
        "description": {
            "lang": "en",
            "value": "IDN spoofing in Omnibox in Google Chrome prior to 77.0.3865.75 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13676",
        "datePublished": "2019-11-25T14:22:53",
        "description": {
            "lang": "en",
            "value": "Insufficient policy enforcement in Chromium in Google Chrome prior to 77.0.3865.75 allowed a remote attacker to perform domain spoofing via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13678",
        "datePublished": "2019-11-25T14:22:53",
        "description": {
            "lang": "en",
            "value": "Incorrect data validation in downloads in Google Chrome prior to 77.0.3865.75 allowed a remote attacker to perform domain spoofing via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13715",
        "datePublished": "2019-11-25T14:22:55",
        "description": {
            "lang": "en",
            "value": "Insufficient validation of untrusted input in Omnibox in Google Chrome prior to 78.0.3904.70 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13718",
        "datePublished": "2019-11-25T14:22:55",
        "description": {
            "lang": "en",
            "value": "Insufficient data validation in Omnibox in Google Chrome prior to 78.0.3904.70 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13739",
        "datePublished": "2019-12-10T21:01:47",
        "description": {
            "lang": "en",
            "value": "Insufficient policy enforcement in Omnibox in Google Chrome prior to 79.0.3945.79 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13740",
        "datePublished": "2019-12-10T21:01:47",
        "description": {
            "lang": "en",
            "value": "Incorrect security UI in sharing in Google Chrome prior to 79.0.3945.79 allowed a remote attacker to perform domain spoofing via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13756",
        "datePublished": "2019-12-10T21:01:54",
        "description": {
            "lang": "en",
            "value": "Incorrect security UI in printing in Google Chrome prior to 79.0.3945.79 allowed a remote attacker to perform domain spoofing via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13757",
        "datePublished": "2019-12-10T21:01:55",
        "description": {
            "lang": "en",
            "value": "Incorrect security UI in Omnibox in Google Chrome prior to 79.0.3945.79 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13759",
        "datePublished": "2019-12-10T21:01:56",
        "description": {
            "lang": "en",
            "value": "Incorrect security UI in interstitials in Google Chrome prior to 79.0.3945.79 allowed a remote attacker to perform domain spoofing via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13761",
        "datePublished": "2019-12-10T21:01:56",
        "description": {
            "lang": "en",
            "value": "Incorrect security UI in Omnibox in Google Chrome prior to 79.0.3945.79 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-13951",
        "datePublished": "2019-07-18T16:14:03",
        "description": {
            "lang": "en",
            "value": "The set_ipv4() function in zscan_rfc1035.rl in gdnsd 3.x before 3.2.1 has a stack-based buffer overflow via a long and malformed IPv4 address in zone data."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-13952",
        "datePublished": "2019-07-18T16:14:15",
        "description": {
            "lang": "en",
            "value": "The set_ipv6() function in zscan_rfc1035.rl in gdnsd before 2.4.3 and 3.x before 3.2.1 has a stack-based buffer overflow via a long and malformed IPv6 address in zone data."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-14305",
        "datePublished": "2019-08-26T14:19:54",
        "description": {
            "lang": "en",
            "value": "Several Ricoh printers have multiple buffer overflows parsing HTTP parameter settings for Wi-Fi, mDNS, POP3, SMTP, and notification alerts, which allow an attacker to cause a denial of service or code execution via crafted requests to the web server. Affected firmware versions depend on the printer models. One affected configuration is cpe:2.3:o:ricoh:sp_c250dn_firmware:-:*:*:*:*:*:*:* up to (including) 1.06 running on cpe:2.3:o:ricoh:sp_c250dn:-:*:*:*:*:*:*:*, cpe:2.3:o:ricoh:sp_c252dn:-:*:*:*:*:*:*:*. Another affected configuration is cpe:2.3:o:ricoh:sp_c250sf_firmware:-:*:*:*:*:*:*:* up to (including) 1.12 running on cpe:2.3:o:ricoh:sp_c250sf:-:*:*:*:*:*:*:*, cpe:2.3:o:ricoh:sp_c252sf:-:*:*:*:*:*:*:*."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-14394",
        "datePublished": "2019-07-30T14:03:11",
        "description": {
            "lang": "en",
            "value": "cPanel before 80.0.5 allows unsafe file operations in the context of the root account via the fetch_ssl_certificates_for_fqdns API (SEC-489)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-14412",
        "datePublished": "2019-07-30T14:18:55",
        "description": {
            "lang": "en",
            "value": "Maketext in cPanel before 78.0.2 allows format-string injection in the DCV check_domains_via_dns UAPI (SEC-474)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-14417",
        "datePublished": "2019-07-29T19:05:47",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Veritas Resiliency Platform (VRP) before 3.4 HF1. An arbitrary command execution vulnerability allows a malicious VRP user to execute commands with root privilege within the VRP virtual machine, related to DNS functionality."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.2,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-14513",
        "datePublished": "2019-08-01T20:47:48",
        "description": {
            "lang": "en",
            "value": "Improper bounds checking in Dnsmasq before 2.76 allows an attacker controlled DNS server to send large DNS packets that result in a read operation beyond the buffer allocated for the packet, a different vulnerability than CVE-2017-14491."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-14516",
        "datePublished": "2019-08-13T13:36:32",
        "description": {
            "lang": "en",
            "value": "The mAadhaar application 1.2.7 for Android lacks SSL Certificate Validation, leading to man-in-the-middle attacks against requests for FAQs or Help."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-14684",
        "datePublished": "2019-08-20T13:30:04",
        "description": {
            "lang": "en",
            "value": "A DLL hijacking vulnerability exists in Trend Micro Password Manager 5.0 in which, if exploited, would allow an attacker to load an arbitrary unsigned DLL into the signed service's process. This process is very similar, yet not identical to CVE-2019-14687."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-14686",
        "datePublished": "2019-08-21T19:42:17",
        "description": {
            "lang": "en",
            "value": "A DLL hijacking vulnerability exists in the Trend Micro Security's 2019 consumer family of products (v15) Folder Shield component and the standalone Trend Micro Ransom Buster (1.0) tool in which, if exploited, would allow an attacker to load a malicious DLL, leading to elevated privileges."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-14687",
        "datePublished": "2019-08-20T13:30:51",
        "description": {
            "lang": "en",
            "value": "A DLL hijacking vulnerability exists in Trend Micro Password Manager 5.0 in which, if exploited, would allow an attacker to load an arbitrary unsigned DLL into the signed service's process. This process is very similar, yet not identical to CVE-2019-14684."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-14726",
        "datePublished": "2019-09-10T15:19:50",
        "description": {
            "lang": "en",
            "value": "In CentOS-WebPanel.com (aka CWP) CentOS Web Panel 0.9.8.851, an insecure object reference allows an attacker to access and delete DNS records of a victim's account via an attacker account."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-14834",
        "datePublished": "2020-01-07T16:30:04",
        "description": {
            "lang": "en",
            "value": "A vulnerability was found in dnsmasq before version 2.81, where the memory leak allows remote attackers to cause a denial of service (memory consumption) via vectors involving DHCP response creation."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 3.7,
                "severity": "LOW"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-14845",
        "datePublished": "2019-10-08T18:43:24",
        "description": {
            "lang": "en",
            "value": "A vulnerability was found in OpenShift builds, versions 4.1 up to 4.3. Builds that extract source from a container image, bypass the TLS hostname verification. An attacker can take advantage of this flaw by launching a man-in-the-middle attack and injecting malicious content."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.7,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-14861",
        "datePublished": "2019-12-10T22:19:05",
        "description": {
            "lang": "en",
            "value": "All Samba versions 4.x.x before 4.9.17, 4.10.x before 4.10.11 and 4.11.x before 4.11.3 have an issue, where the (poorly named) dnsserver RPC pipe provides administrative facilities to modify DNS records and zones. Samba, when acting as an AD DC, stores DNS records in LDAP. In AD, the default permissions on the DNS partition allow creation of new records by authenticated users. This is used for example to allow machines to self-register in DNS. If a DNS record was created that case-insensitively matched the name of the zone, the ldb_qsort() and dns_name_compare() routines could be confused into reading memory prior to the list of DNS entries when responding to DnssrvEnumRecords() or DnssrvEnumRecords2() and so following invalid memory as a pointer."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-14929",
        "datePublished": "2019-10-28T12:11:44",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on Mitsubishi Electric Europe B.V. ME-RTU devices through 2.02 and INEA ME-RTU devices through 3.0. Stored cleartext passwords could allow an unauthenticated attacker to obtain configured username and password combinations on the RTU due to the weak credentials management on the RTU. An unauthenticated user can obtain the exposed password credentials to gain access to the following services: DDNS service, Mobile Network Provider, and OpenVPN service."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-14969",
        "datePublished": "2019-08-12T18:17:59",
        "description": {
            "lang": "en",
            "value": "Netwrix Auditor before 9.8 has insecure permissions on %PROGRAMDATA%\\Netwrix Auditor\\Logs\\ActiveDirectory\\ and sub-folders. In addition, the service Netwrix.ADA.StorageAuditService (which writes to that directory) does not perform proper impersonation, and thus the target file will have the same permissions as the invoking process (in this case, granting Authenticated Users full access over the target file). This vulnerability can be triggered by a low-privileged user to perform DLL Hijacking/Binary Planting attacks and ultimately execute code as NT AUTHORITY\\SYSTEM with the help of Symbolic Links."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-15006",
        "datePublished": "2019-12-19T00:50:12.007660Z",
        "description": {
            "lang": "en",
            "value": "There was a man-in-the-middle (MITM) vulnerability present in the Confluence Previews plugin in Confluence Server and Confluence Data Center. This plugin was used to facilitate communication with the Atlassian Companion application. The Confluence Previews plugin in Confluence Server and Confluence Data Center communicated with the Companion application via the atlassian-domain-for-localhost-connections-only.com domain name, the DNS A record of which points at 127.0.0.1. Additionally, a signed certificate for the domain was publicly distributed with the Companion application. An attacker in the position to control DNS resolution of their victim could carry out a man-in-the-middle (MITM) attack between Confluence Server (or Confluence Data Center) and the atlassian-domain-for-localhost-connections-only.com domain intended to be used with the Companion application. This certificate has been revoked, however, usage of the atlassian-domain-for-localhost-connections-only.com domain name was still present in Confluence Server and Confluence Data Center. An attacker could perform the described attack by denying their victim access to certificate revocation information, and carry out a man-in-the-middle (MITM) attack to observe files being edited using the Companion application and/or modify them, and access some limited user information."
        },
        "metrics": [],
        "tags": [
            "dns",
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-15022",
        "datePublished": "2019-10-09T20:20:28",
        "description": {
            "lang": "en",
            "value": "A security vulnerability exists in Zingbox Inspector versions 1.294 and earlier, that allows for the Inspector to be susceptible to ARP spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-15259",
        "datePublished": "2019-10-02T19:06:55.220464Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in Cisco Unified Contact Center Express (UCCX) Software could allow an unauthenticated, remote attacker to conduct an HTTP response splitting attack. The vulnerability is due to insufficient input validation of some parameters that are passed to the web server of the affected system. An attacker could exploit this vulnerability by convincing a user to follow a malicious link or by intercepting a user request on an affected device. A successful exploit could allow the attacker to perform cross-site scripting attacks, web cache poisoning, access sensitive browser-based information, and similar exploits."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.1,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2019-15261",
        "datePublished": "2019-10-16T18:36:39.319975Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the Point-to-Point Tunneling Protocol (PPTP) VPN packet processing functionality in Cisco Aironet Access Points (APs) could allow an unauthenticated, remote attacker to cause an affected device to reload, resulting in a denial of service (DoS) condition. The vulnerability is due to insufficient validation of Generic Routing Encapsulation (GRE) frames that pass through the data plane of an affected AP. An attacker could exploit this vulnerability by associating to a vulnerable AP, initiating a PPTP VPN connection to an arbitrary PPTP VPN server, and sending a malicious GRE frame through the data plane of the AP. A successful exploit could allow the attacker to cause an internal process of the targeted AP to crash, which in turn would cause the AP to reload. The AP reload would cause a DoS condition for clients that are associated with the AP."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.6,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "tunneling"
        ]
    },
    {
        "cveId": "CVE-2019-15312",
        "datePublished": "2020-07-01T19:23:25",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on Zolo Halo devices via the Linkplay firmware. There is a Zolo Halo DNS rebinding attack. The device was found to be vulnerable to DNS rebinding. Combined with one of the many /httpapi.asp endpoint command-execution security issues, the DNS rebinding attack could allow an attacker to compromise the victim device from the Internet."
        },
        "metrics": [],
        "tags": [
            "dns",
            "rebinding attack"
        ]
    },
    {
        "cveId": "CVE-2019-15344",
        "datePublished": "2019-11-14T16:24:41",
        "description": {
            "lang": "en",
            "value": "The Tecno Camon iClick Android device with a build fingerprint of TECNO/H633/TECNO-IN6:8.1.0/O11019/A-180409V96:user/release-keys contains a pre-installed platform app with a package name of com.lovelyfont.defcontainer (versionCode=7, versionName=7.0.8). This app contains an exported service named com.lovelyfont.manager.FontCoverService that allows any app co-located on the device to supply arbitrary commands to be executed as the system user. This app cannot be disabled by the user and the attack can be performed by a zero-permission app. In addition to the local attack surface, its accompanying app with a package name of com.ekesoo.lovelyhifonts makes network requests using HTTP and an attacker can perform a Man-in-the-Middle (MITM) attack on the connection to inject a command in a network response that will be executed as the system user by the com.lovelyfont.defcontainer app. Executing commands as the system user can allow a third-party app to video record the user's screen, factory reset the device, obtain the user's notifications, read the logcat logs, inject events in the Graphical User Interface (GUI), and obtains the user's text messages, and more. Executing commands as the system user can allow a third-party app to factory reset the device, obtain the user's notifications, read the logcat logs, inject events in the GUI, change the default Input Method Editor (IME) (e.g., keyboard) with one contained within the attacking app that contains keylogging functionality, and obtains the user's text messages, and more."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-15388",
        "datePublished": "2019-11-14T16:25:46",
        "description": {
            "lang": "en",
            "value": "The Coolpad 1851 Android device with a build fingerprint of Coolpad/android/android:8.1.0/O11019/1534834761:userdebug/release-keys contains a pre-installed platform app with a package name of com.lovelyfont.defcontainer (versionCode=7, versionName=7.1.13). This app contains an exported service named com.lovelyfont.manager.FontCoverService that allows any app co-located on the device to supply arbitrary commands to be executed as the system user. This app cannot be disabled by the user and the attack can be performed by a zero-permission app. In addition to the local attack surface, its accompanying app with a package name of com.ekesoo.lovelyhifonts makes network requests using HTTP and an attacker can perform a Man-in-the-Middle (MITM) attack on the connection to inject a command in a network response that will be executed as the system user by the com.lovelyfont.defcontainer app. Executing commands as the system user can allow a third-party app to video record the user's screen, factory reset the device, obtain the user's notifications, read the logcat logs, inject events in the Graphical User Interface (GUI), and obtains the user's text messages, and more. Executing commands as the system user can allow a third-party app to factory reset the device, obtain the user's notifications, read the logcat logs, inject events in the GUI, change the default Input Method Editor (IME) (e.g., keyboard) with one contained within the attacking app that contains keylogging functionality, and obtains the user's text messages, and more."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-15389",
        "datePublished": "2019-11-14T16:25:47",
        "description": {
            "lang": "en",
            "value": "The Haier A6 Android device with a build fingerprint of Haier/A6/A6:8.1.0/O11019/1534219877:userdebug/release-keys contains a pre-installed platform app with a package name of com.lovelyfont.defcontainer (versionCode=7, versionName=7.1.13). This app contains an exported service named com.lovelyfont.manager.FontCoverService that allows any app co-located on the device to supply arbitrary commands to be executed as the system user. This app cannot be disabled by the user and the attack can be performed by a zero-permission app. In addition to the local attack surface, its accompanying app with a package name of com.ekesoo.lovelyhifonts makes network requests using HTTP and an attacker can perform a Man-in-the-Middle (MITM) attack on the connection to inject a command in a network response that will be executed as the system user by the com.lovelyfont.defcontainer app. Executing commands as the system user can allow a third-party app to video record the user's screen, factory reset the device, obtain the user's notifications, read the logcat logs, inject events in the Graphical User Interface (GUI), and obtains the user's text messages, and more. Executing commands as the system user can allow a third-party app to factory reset the device, obtain the user's notifications, read the logcat logs, inject events in the GUI, change the default Input Method Editor (IME) (e.g., keyboard) with one contained within the attacking app that contains keylogging functionality, and obtains the user's text messages, and more."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-15616",
        "datePublished": "2020-02-04T19:08:57",
        "description": {
            "lang": "en",
            "value": "Dangling remote share attempts in Nextcloud 16 allow a DNS pollution when running long."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-15628",
        "datePublished": "2019-12-02T15:45:14",
        "description": {
            "lang": "en",
            "value": "Trend Micro Security (Consumer) 2020 (v16.0.1221 and below) is affected by a DLL hijacking vulnerability that could allow an attacker to use a specific service as an execution and/or persistence mechanism which could execute a malicious program each time the service is started."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-15718",
        "datePublished": "2019-09-04T11:04:31",
        "description": {
            "lang": "en",
            "value": "In systemd 240, bus_open_system_watch_bind_with_description in shared/bus-util.c (as used by systemd-resolved to connect to the system D-Bus instance), calls sd_bus_set_trusted, which disables access controls for incoming D-Bus messages. An unprivileged user can exploit this by executing D-Bus methods that should be restricted to privileged users, in order to change the system's DNS resolver settings."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-15795",
        "datePublished": "2020-03-26T13:00:21.299320Z",
        "description": {
            "lang": "en",
            "value": "python-apt only checks the MD5 sums of downloaded files in `Version.fetch_binary()` and `Version.fetch_source()` of apt/package.py in version 1.9.0ubuntu1 and earlier. This allows a man-in-the-middle attack which could potentially be used to install altered packages and has been fixed in versions 1.9.0ubuntu1.2, 1.6.5ubuntu0.1, 1.1.0~beta1ubuntu0.16.04.7, 0.9.3.5ubuntu3+esm2, and 0.8.3ubuntu7.5."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4.7,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-15843",
        "datePublished": "2019-09-18T14:29:44",
        "description": {
            "lang": "en",
            "value": "A malicious file upload vulnerability was discovered in Xiaomi Millet mobile phones 1-6.3.9.3. A particular condition involving a man-in-the-middle attack may lead to partial data leakage or malicious file writing."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-16001",
        "datePublished": "2019-11-26T03:41:26.437971Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the loading mechanism of specific dynamic link libraries in Cisco Webex Teams for Windows could allow an authenticated, local attacker to perform a DLL hijacking attack. To exploit this vulnerability, the attacker would need to have valid credentials on the Windows system. The vulnerability is due to insufficient validation of the resources loaded by the application at run time. An attacker could exploit this vulnerability by crafting a malicious DLL file and placing it in a specific location on the targeted system. The malicious DLL file would execute when the vulnerable application is launched. A successful exploit could allow the attacker to execute arbitrary code on the target machine with the privileges of another user account."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-16026",
        "datePublished": "2020-01-26T04:45:20.821598Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the implementation of the Stream Control Transmission Protocol (SCTP) on Cisco Mobility Management Entity (MME) could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an eNodeB that is connected to an affected device. The vulnerability is due to insufficient input validation of SCTP traffic. An attacker could exploit this vulnerability by leveraging a man-in-the-middle position between the eNodeB and the MME and then sending a crafted SCTP message to the MME. A successful exploit would cause the MME to stop sending SCTP messages to the eNodeB, triggering a DoS condition."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-16057",
        "datePublished": "2019-09-16T11:58:14",
        "description": {
            "lang": "en",
            "value": "The login_mgr.cgi script in D-Link DNS-320 through 2.05.B10 is vulnerable to remote command injection."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-16209",
        "datePublished": "2019-11-08T17:19:12",
        "description": {
            "lang": "en",
            "value": "A vulnerability, in The ReportsTrustManager class of Brocade SANnav versions before v2.0, could allow an attacker to perform a man-in-the-middle attack against Secure Sockets Layer(SSL)connections."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-16238",
        "datePublished": "2019-09-12T15:53:03",
        "description": {
            "lang": "en",
            "value": "Afterlogic Aurora through 8.3.9-build-a3 has XSS that can be leveraged for session hijacking by retrieving the session cookie from the administrator login."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-16252",
        "datePublished": "2020-06-12T22:15:51",
        "description": {
            "lang": "en",
            "value": "Missing SSL Certificate Validation in the Nutfind.com application through 3.9.12 for Android allows a man-in-the-middle attacker to sniff and manipulate all API requests, including login credentials and location data."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-16407",
        "datePublished": "2019-10-02T18:11:42",
        "description": {
            "lang": "en",
            "value": "JetBrains ReSharper installers for versions before 2019.2 had a DLL Hijacking vulnerability."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-16546",
        "datePublished": "2019-11-21T14:11:23",
        "description": {
            "lang": "en",
            "value": "Jenkins Google Compute Engine Plugin 4.1.1 and earlier does not verify SSH host keys when connecting agents created by the plugin, enabling man-in-the-middle attacks."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-16549",
        "datePublished": "2019-12-17T14:40:45",
        "description": {
            "lang": "en",
            "value": "Jenkins Maven Release Plugin 0.16.1 and earlier does not configure the XML parser to prevent XML external entity (XXE) attacks, allowing man-in-the-middle attackers to have Jenkins parse crafted XML documents."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-16651",
        "datePublished": "2021-09-20T13:26:26",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on Virgin Media Super Hub 3 (based on ARRIS TG2492) devices. Because their SNMP commands have insufficient protection mechanisms, it is possible to use JavaScript and DNS rebinding to leak the WAN IP address of a user (if they are using certain VPN implementations, this would decloak them)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-16732",
        "datePublished": "2019-12-13T20:08:07",
        "description": {
            "lang": "en",
            "value": "Unencrypted HTTP communications for firmware upgrades in Petalk AI and PF-103 allow man-in-the-middle attackers to run arbitrary code as the root user."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-16754",
        "datePublished": "2019-09-24T17:50:13",
        "description": {
            "lang": "en",
            "value": "RIOT 2019.07 contains a NULL pointer dereference in the MQTT-SN implementation (asymcute), potentially allowing an attacker to crash a network node running RIOT. This requires spoofing an MQTT server response. To do so, the attacker needs to know the MQTT MsgID of a pending MQTT protocol message and the ephemeral port used by RIOT's MQTT implementation. Additionally, the server IP address is required for spoofing the packet."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-16771",
        "datePublished": "2019-12-06T19:00:20",
        "description": {
            "lang": "en",
            "value": "Versions of Armeria 0.85.0 through and including 0.96.0 are vulnerable to HTTP response splitting, which allows remote attackers to inject arbitrary HTTP headers via CRLF sequences when unsanitized data is used to populate the headers of an HTTP response. This vulnerability has been patched in 0.97.0. Potential impacts of this vulnerability include cross-user defacement, cache poisoning, Cross-site scripting (XSS), and page hijacking."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning",
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-16789",
        "datePublished": "2019-12-26T16:40:12",
        "description": {
            "lang": "en",
            "value": "In Waitress through version 1.4.0, if a proxy server is used in front of waitress, an invalid request may be sent by an attacker that bypasses the front-end and is parsed differently by waitress leading to a potential for HTTP request smuggling. Specially crafted requests containing special whitespace characters in the Transfer-Encoding header would get parsed by Waitress as being a chunked request, but a front-end server would use the Content-Length instead as the Transfer-Encoding header is considered invalid due to containing invalid characters. If a front-end server does HTTP pipelining to a backend Waitress server this could lead to HTTP request splitting which may lead to potential cache poisoning or unexpected information disclosure. This issue is fixed in Waitress 1.4.1 through more strict HTTP field validation."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.1,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2019-17066",
        "datePublished": "2020-05-18T21:53:20",
        "description": {
            "lang": "en",
            "value": "In Ivanti WorkSpace Control before 10.4.40.0, a user can elevate rights on the system by hijacking certain user registries. This is possible because pwrgrid.exe first checks the Current User registry hives (HKCU) when starting an application with elevated rights."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-17567",
        "datePublished": "2021-06-10T07:10:19",
        "description": {
            "lang": "en",
            "value": "Apache HTTP Server versions 2.4.6 to 2.4.46 mod_proxy_wstunnel configured on an URL that is not necessarily Upgraded by the origin server was tunneling the whole connection regardless, thus allowing for subsequent requests on the same connection to pass through with no HTTP validation, authentication or authorization possibly configured."
        },
        "metrics": [],
        "tags": [
            "tunneling"
        ]
    },
    {
        "cveId": "CVE-2019-17636",
        "datePublished": "2020-03-10T14:30:14",
        "description": {
            "lang": "en",
            "value": "In Eclipse Theia versions 0.3.9 through 0.15.0, one of the default pre-packaged Theia extensions is \"Mini-Browser\", published as \"@theia/mini-browser\" on npmjs.com. This extension, for its own needs, exposes a HTTP endpoint that allows to read the content of files on the host's filesystem, given their path, without restrictions on the requester's origin. This design is vulnerable to being exploited remotely through a DNS rebinding attack or a drive-by download of a carefully crafted exploit."
        },
        "metrics": [],
        "tags": [
            "dns",
            "rebinding attack"
        ]
    },
    {
        "cveId": "CVE-2019-17654",
        "datePublished": "2020-03-15T22:20:58",
        "description": {
            "lang": "en",
            "value": "An Insufficient Verification of Data Authenticity vulnerability in FortiManager 6.2.1, 6.2.0, 6.0.6 and below may allow an unauthenticated attacker to perform a Cross-Site WebSocket Hijacking (CSWSH) attack."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-17665",
        "datePublished": "2019-10-16T19:41:54",
        "description": {
            "lang": "en",
            "value": "NSA Ghidra before 9.0.2 is vulnerable to DLL hijacking because it loads jansi.dll from the current working directory."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-18267",
        "datePublished": "2019-12-18T19:37:46",
        "description": {
            "lang": "en",
            "value": "An issue was found in GE S2020/S2020G Fast Switch 61850, S2020/S2020G Fast Switch 61850 Versions 07A03 and prior. An attacker can inject arbitrary Javascript in a specially crafted HTTP request that may be reflected back in the HTTP response. The device is also vulnerable to a stored cross-site scripting vulnerability that may allow session hijacking, disclosure of sensitive data, cross-site request forgery (CSRF) attacks, and remote code execution."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-18375",
        "datePublished": "2020-04-09T23:16:17",
        "description": {
            "lang": "en",
            "value": "The ASG and ProxySG management consoles are susceptible to a session hijacking vulnerability. A remote attacker, with access to the appliance management interface, can hijack the session of a currently logged-in user and access the management console."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-18670",
        "datePublished": "2019-12-17T15:10:05",
        "description": {
            "lang": "en",
            "value": "In the Quick Access Service (QAAdminAgent.exe) in Acer Quick Access V2.01.3000 through 2.01.3027 and V3.00.3000 through V3.00.3008, a REGULAR user can load an arbitrary unsigned DLL into the signed service's process, which is running as NT AUTHORITY\\SYSTEM. This is a DLL Hijacking vulnerability (including search order hijacking, which searches for the missing DLL in the PATH environment variable), which is caused by an uncontrolled search path element for nvapi.dll, atiadlxx.dll, or atiadlxy.dll."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-18833",
        "datePublished": "2019-12-17T13:53:06",
        "description": {
            "lang": "en",
            "value": "Barco ClickShare Button R9861500D01 devices before 1.9.0 allow Information exposure (issue 2 of 2).. The encryption key of the media content which is shared between a ClickShare Button and a ClickShare Base Unit is randomly generated for each new session and communicated over a TLS connection. An attacker who is able to perform a Man-in-the-Middle attack between the TLS connection, is able to obtain the encryption key."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-18863",
        "datePublished": "2020-03-02T17:52:37",
        "description": {
            "lang": "en",
            "value": "A key length vulnerability in the implementation of the SRTP 128-bit key on Mitel 6800 and 6900 SIP series phones, versions 5.1.0.2051 SP2 and earlier, could allow an attacker to launch a man-in-the-middle attack when SRTP is used in a call. A successful exploit may allow the attacker to intercept sensitive information."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-18905",
        "datePublished": "2020-04-03T11:00:16.880502Z",
        "description": {
            "lang": "en",
            "value": "A Insufficient Verification of Data Authenticity vulnerability in autoyast2 of SUSE Linux Enterprise Server 12, SUSE Linux Enterprise Server 15 allows remote attackers to MITM connections when deprecated and unused functionality of autoyast is used to create images. This issue affects: SUSE Linux Enterprise Server 12 autoyast2 version 4.1.9-3.9.1 and prior versions. SUSE Linux Enterprise Server 15 autoyast2 version 4.0.70-3.20.1 and prior versions."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-19101",
        "datePublished": "2020-04-29T02:07:32",
        "description": {
            "lang": "en",
            "value": "A missing secure communication definition and an incomplete TLS validation in the upgrade service in B&R Automation Studio versions 4.0.x, 4.1.x, 4.2.x, < 4.3.11SP, < 4.4.9SP, < 4.5.5SP, < 4.6.4 and < 4.7.2 enable unauthenticated users to perform MITM attacks via the B&R upgrade server."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-19225",
        "datePublished": "2020-03-04T18:07:23",
        "description": {
            "lang": "en",
            "value": "A Broken Access Control vulnerability in the D-Link DSL-2680 web administration interface (Firmware EU_1.03) allows an attacker to change DNS servers without being authenticated on the admin interface by submitting a crafted Forms/dns_1 POST request."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-19326",
        "datePublished": "2020-07-15T18:54:55",
        "description": {
            "lang": "en",
            "value": "Silverstripe CMS sites through 4.4.4 which have opted into HTTP Cache Headers on responses served by the framework's HTTP layer can be vulnerable to web cache poisoning. Through modifying the X-Original-Url and X-HTTP-Method-Override headers, responses with malicious HTTP headers can return unexpected responses to other consumers of this cached response. Most other headers associated with web cache poisoning are already disabled through request hostname forgery whitelists."
        },
        "metrics": [],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2019-19331",
        "datePublished": "2019-12-16T00:00:00",
        "description": {
            "lang": "en",
            "value": "knot-resolver before version 4.3.0 is vulnerable to denial of service through high CPU utilization. DNS replies with very many resource records might be processed very inefficiently, in extreme cases taking even several CPU seconds for each such uncached message. For example, a few thousand A records can be squashed into one DNS message (limit is 64kB)."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-19364",
        "datePublished": "2019-12-04T18:42:20",
        "description": {
            "lang": "en",
            "value": "A weak malicious user can escalate its privilege whenever CatalystProductionSuite.2019.1.exe (version 1.1.0.21) and CatalystBrowseSuite.2019.1.exe (version 1.1.0.21) installers run. The vulnerability is in the form of DLL Hijacking. The installers try to load DLLs that dont exist from its current directory; by doing so, an attacker can quickly escalate its privileges."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-19495",
        "datePublished": "2020-01-08T17:05:54",
        "description": {
            "lang": "en",
            "value": "The web interface on the Technicolor TC7230 STEB 01.25 is vulnerable to DNS rebinding, which allows a remote attacker to configure the cable modem via JavaScript in a victim's browser. The attacker can then configure the cable modem to port forward the modem's internal TELNET server, allowing external access to a root shell."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-19751",
        "datePublished": "2024-04-30T00:00:00",
        "description": {
            "lang": "en",
            "value": "easyMINE before 2019-12-05 ships with SSH host keys baked into the installation image, which allows man-in-the-middle attacks and makes identification of all public IPv4 nodes trivial with Shodan.io."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-19752",
        "datePublished": "2024-04-30T00:00:00",
        "description": {
            "lang": "en",
            "value": "nvOC through 3.2 ships with SSH host keys baked into the installation image, which allows man-in-the-middle attacks and makes identification of all public IPv4 nodes trivial with Shodan.io. NOTE: as of 2019-12-01, the vendor indicated plans to fix this in the next image build."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-19753",
        "datePublished": "2024-04-30T00:00:00",
        "description": {
            "lang": "en",
            "value": "SimpleMiningOS through v1259 ships with SSH host keys baked into the installation image, which allows man-in-the-middle attacks and makes identification of all public IPv4 nodes trivial with Shodan.io. NOTE: the vendor indicated that they have no plans to fix this, and discourage deployment using public IPv4."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-19754",
        "datePublished": "2024-04-30T00:00:00",
        "description": {
            "lang": "en",
            "value": "HiveOS through 0.6-102@191212 ships with SSH host keys baked into the installation image, which allows man-in-the-middle attacks and makes identification of all public IPv4 nodes trivial with Shodan.io. NOTE: as of 2019-09-26, the vendor indicated that they would consider fixing this."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-19755",
        "datePublished": "2024-04-30T00:00:00",
        "description": {
            "lang": "en",
            "value": "ethOS through 1.3.3 ships with SSH host keys baked into the installation image, which allows man-in-the-middle attacks and makes identification of all public IPv4 nodes trivial with Shodan.io. NOTE: as of 2019-12-01, the vendor indicated that they plan to fix this."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-19794",
        "datePublished": "2019-12-13T21:46:59",
        "description": {
            "lang": "en",
            "value": "The miekg Go DNS package before 1.1.25, as used in CoreDNS before 1.6.6 and other products, improperly generates random numbers because math/rand is used. The TXID becomes predictable, leading to response forgeries."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-19891",
        "datePublished": "2020-01-13T17:39:53",
        "description": {
            "lang": "en",
            "value": "An encryption key vulnerability on Mitel SIP-DECT wireless devices 8.0 and 8.1 could allow an attacker to launch a man-in-the-middle attack. A successful exploit may allow the attacker to intercept sensitive information."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-19922",
        "datePublished": "2019-12-22T19:07:16",
        "description": {
            "lang": "en",
            "value": "kernel/sched/fair.c in the Linux kernel before 5.3.9, when cpu.cfs_quota_us is used (e.g., with Kubernetes), allows attackers to cause a denial of service against non-cpu-bound applications by generating a workload that triggers unwanted slice expiration, aka CID-de53fd7aedb1. (In other words, although this slice expiration would typically be seen with benign workloads, it is possible that an attacker could calculate how many stray requests are required to force an entire Kubernetes cluster into a low-performance state caused by slice expiration, and ensure that a DDoS attack sent that number of stray requests. An attack does not affect the stability of the kernel; it only causes mismanagement of application execution.)"
        },
        "metrics": [],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2019-19941",
        "datePublished": "2020-03-16T15:19:52",
        "description": {
            "lang": "en",
            "value": "Missing hostname validation in Swisscom Centro Grande before 6.16.12 allows a remote attacker to inject its local IP address as a domain entry in the DNS service of the router via crafted hostnames in DHCP requests, causing XSS."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-19942",
        "datePublished": "2020-03-16T15:24:46",
        "description": {
            "lang": "en",
            "value": "Missing output sanitation in Swisscom Centro Grande Centro Grande before 6.16.12, Centro Business 1.0 (ADB) before 7.10.18, and Centro Business 2.0 before 8.02.04 allows a remote attacker to perform DNS spoofing against the web interface via crafted hostnames in DHCP requests."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dns spoofing",
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-19956",
        "datePublished": "2019-12-24T15:12:57",
        "description": {
            "lang": "en",
            "value": "xmlParseBalancedChunkMemoryRecover in parser.c in libxml2 before 2.9.10 has a memory leak related to newDoc->oldNs."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-1040",
        "datePublished": "2019-06-12T13:49:40",
        "description": {
            "lang": "en",
            "value": "A tampering vulnerability exists in Microsoft Windows when a man-in-the-middle attacker is able to successfully bypass the NTLM MIC (Message Integrity Check) protection, aka 'Windows NTLM Tampering Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-1075",
        "datePublished": "2019-07-15T18:56:20",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in ASP.NET Core that could lead to an open redirect, aka 'ASP.NET Core Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1090",
        "datePublished": "2019-07-15T18:56:21",
        "description": {
            "lang": "en",
            "value": "An elevation of privilege vulnerability exists in the way that the dnsrslvr.dll handles objects in memory, aka 'Windows dnsrlvr.dll Elevation of Privilege Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-1105",
        "datePublished": "2019-07-29T14:07:59",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in the way Microsoft Outlook for Android software parses specifically crafted email messages, aka 'Outlook for Android Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1109",
        "datePublished": "2019-07-29T14:08:33",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft Office Javascript does not check the validity of the web page making a request to Office documents.An attacker who successfully exploited this vulnerability could read or write information in Office documents.The security update addresses the vulnerability by correcting the way that Microsoft Office Javascript verifies trusted web pages., aka 'Microsoft Office Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1137",
        "datePublished": "2019-07-29T14:14:05",
        "description": {
            "lang": "en",
            "value": "A cross-site-scripting (XSS) vulnerability exists when Microsoft Exchange Server does not properly sanitize a specially crafted web request to an affected Exchange server, aka 'Microsoft Exchange Server Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1166",
        "datePublished": "2019-10-10T13:28:40",
        "description": {
            "lang": "en",
            "value": "A tampering vulnerability exists in Microsoft Windows when a man-in-the-middle attacker is able to successfully bypass the NTLM MIC (Message Integrity Check) protection, aka 'Windows NTLM Tampering Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-1202",
        "datePublished": "2019-08-14T20:55:05",
        "description": {
            "lang": "en",
            "value": "An information disclosure vulnerability exists in the way Microsoft SharePoint handles session objects. An authenticated attacker who successfully exploited the vulnerability could hijack the session of another user.\nTo exploit this vulnerability, the attacker could run a specially crafted application.\nThe security update corrects how SharePoint handles session objects to prevent user session hijacking.\n"
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-1218",
        "datePublished": "2019-08-14T20:55:05",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in the way Microsoft Outlook iOS software parses specifically crafted email messages. An authenticated attacker could exploit the vulnerability by sending a specially crafted email message to a victim.\nThe attacker who successfully exploited this vulnerability could then perform cross-site scripting attacks on the affected systems and run scripts in the security context of the current user.\nThe security update addresses the vulnerability by correcting how Outlook iOS parses specially crafted email messages.\n"
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1234",
        "datePublished": "2019-11-12T18:52:47",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Azure Stack fails to validate certain requests, aka 'Azure Stack Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1259",
        "datePublished": "2019-09-11T21:24:59",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in Microsoft SharePoint when it improperly handles requests to authorize applications, resulting in cross-site request forgery (CSRF).To exploit this vulnerability, an attacker would need to create a page specifically designed to cause a cross-site request, aka 'Microsoft SharePoint Spoofing Vulnerability'. This CVE ID is unique from CVE-2019-1261."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1261",
        "datePublished": "2019-09-11T21:24:59",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in Microsoft SharePoint when it improperly handles requests to authorize applications, resulting in cross-site request forgery (CSRF).To exploit this vulnerability, an attacker would need to create a page specifically designed to cause a cross-site request, aka 'Microsoft SharePoint Spoofing Vulnerability'. This CVE ID is unique from CVE-2019-1259."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1266",
        "datePublished": "2019-09-11T21:24:59",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in Microsoft Exchange Server when Outlook Web App (OWA) fails to properly handle web requests, aka 'Microsoft Exchange Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1318",
        "datePublished": "2019-10-10T13:28:41",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Transport Layer Security (TLS) accesses non- Extended Master Secret (EMS) sessions, aka 'Microsoft Windows Transport Layer Security Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1328",
        "datePublished": "2019-10-10T13:28:41",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server, aka 'Microsoft SharePoint Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1338",
        "datePublished": "2019-10-10T13:28:41",
        "description": {
            "lang": "en",
            "value": "A security feature bypass vulnerability exists in Microsoft Windows when a man-in-the-middle attacker is able to successfully bypass the NTLMv2 protection if a client is also sending LMv2 responses, aka 'Windows NTLM Security Feature Bypass Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-1357",
        "datePublished": "2019-10-10T13:28:42",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft Browsers improperly handle browser cookies, aka 'Microsoft Browser Spoofing Vulnerability'. This CVE ID is unique from CVE-2019-0608."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1445",
        "datePublished": "2019-11-12T18:53:17",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Office Online does not validate origin in cross-origin communications handlers correctly, aka 'Microsoft Office Online Spoofing Vulnerability'. This CVE ID is unique from CVE-2019-1447."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1447",
        "datePublished": "2019-11-12T18:53:18",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Office Online does not validate origin in cross-origin communications handlers correctly, aka 'Microsoft Office Online Spoofing Vulnerability'. This CVE ID is unique from CVE-2019-1445."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1460",
        "datePublished": "2020-01-24T20:50:28",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in the way Microsoft Outlook for Android software parses specifically crafted email messages, aka 'Outlook for Android Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1486",
        "datePublished": "2019-12-10T21:41:06",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in Visual Studio Live Share when a guest connected to a Live Share session is redirected to an arbitrary URL specified by the session host, aka 'Visual Studio Live Share Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1490",
        "datePublished": "2019-12-10T21:41:08",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when a Skype for Business Server does not properly sanitize a specially crafted request, aka 'Skype for Business Server Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1659",
        "datePublished": "2019-02-21T15:00:00Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the Identity Services Engine (ISE) integration feature of Cisco Prime Infrastructure (PI) could allow an unauthenticated, remote attacker to perform a man-in-the-middle attack against the Secure Sockets Layer (SSL) tunnel established between ISE and PI. The vulnerability is due to improper validation of the server SSL certificate when establishing the SSL tunnel with ISE. An attacker could exploit this vulnerability by using a crafted SSL certificate and could then intercept communications between the ISE and PI. A successful exploit could allow the attacker to view and alter potentially sensitive information that the ISE maintains about clients that are connected to the network. This vulnerability affects Cisco Prime Infrastructure Software Releases 2.2 through 3.4.0 when the PI server is integrated with ISE, which is disabled by default."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.4,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-1680",
        "datePublished": "2019-02-07T21:00:00Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in Cisco Webex Business Suite could allow an unauthenticated, remote attacker to inject arbitrary text into a user's browser. The vulnerability is due to improper validation of input. An attacker could exploit this vulnerability by convincing a targeted user to view a malicious URL. A successful exploit could allow the attacker to inject arbitrary text into the user's browser. The attacker could use the content injection to conduct spoofing attacks. Versions prior than 3.0.9 are affected."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 4.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-1738",
        "datePublished": "2019-03-27T23:15:14.394105Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the Network-Based Application Recognition (NBAR) feature of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated, remote attacker to cause an affected device to reload. This vulnerability is due to a parsing issue on DNS packets. An attacker could exploit these vulnerabilities by sending crafted DNS packets through routers that are running an affected version and have NBAR enabled. A successful exploit could allow the attacker to cause the affected device to reload, resulting in a denial of service (DoS) condition."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.6,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-1739",
        "datePublished": "2019-03-27T23:20:12.539060Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the Network-Based Application Recognition (NBAR) feature of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated, remote attacker to cause an affected device to reload. This vulnerability is due to a parsing issue on DNS packets. An attacker could exploit this vulnerability by sending crafted DNS packets through routers that are running an affected version and have NBAR enabled. A successful exploit could allow the attacker to cause the affected device to reload, resulting in a denial of service (DoS) condition."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.6,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-1740",
        "datePublished": "2019-03-27T23:25:18.976554Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the Network-Based Application Recognition (NBAR) feature of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated, remote attacker to cause an affected device to reload. This vulnerability are due to a parsing issue on DNS packets. An attacker could exploit this vulnerability by sending crafted DNS packets through routers that are running an affected version and have NBAR enabled. A successful exploit could allow the attacker to cause the affected device to reload, resulting in a denial of service (DoS) condition."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.6,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-1748",
        "datePublished": "2019-03-27T23:50:13.064650Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the Cisco Network Plug-and-Play (PnP) agent of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated, remote attacker to gain unauthorized access to sensitive data. The vulnerability exists because the affected software insufficiently validates certificates. An attacker could exploit this vulnerability by supplying a crafted certificate to an affected device. A successful exploit could allow the attacker to conduct man-in-the-middle attacks to decrypt and modify confidential information on user connections to the affected software."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.4,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-1757",
        "datePublished": "2019-03-28T00:20:21.311211Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the Cisco Smart Call Home feature of Cisco IOS and IOS XE Software could allow an unauthenticated, remote attacker to gain unauthorized read access to sensitive data using an invalid certificate. The vulnerability is due to insufficient certificate validation by the affected software. An attacker could exploit this vulnerability by supplying a crafted certificate to an affected device. A successful exploit could allow the attacker to conduct man-in-the-middle attacks to decrypt confidential information on user connections to the affected software."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-1828",
        "datePublished": "2019-04-04T15:30:19.808325Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the web-based management interface of Cisco Small Business RV320 and RV325 Dual Gigabit WAN VPN Routers could allow an unauthenticated, remote attacker to access administrative credentials. The vulnerability exists because affected devices use weak encryption algorithms for user credentials. An attacker could exploit this vulnerability by conducting a man-in-the-middle attack and decrypting intercepted credentials. A successful exploit could allow the attacker to gain access to an affected device with administrator privileges. This vulnerability affects Cisco Small Business RV320 and RV325 Dual Gigabit WAN VPN Routers running firmware releases prior to 1.4.2.22."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-1866",
        "datePublished": "2020-04-13T16:55:12.071433Z",
        "description": {
            "lang": "en",
            "value": "Cisco Webex Business Suite before 39.1.0 contains a vulnerability that could allow an unauthenticated, remote attacker to affect the integrity of the application. The vulnerability is due to improper validation of host header values. An attacker with a privileged network position, either a man-in-the-middle or by intercepting wireless network traffic, could exploit this vulnerability to manipulate header values sent by a client to the affected application. The attacker could cause the application to use input from the header to redirect a user from the Cisco Webex Meetings Online site to an arbitrary site of the attacker's choosing."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 3.1,
                "severity": "LOW"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-1940",
        "datePublished": "2019-07-17T20:25:27.044870Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the Web Services Management Agent (WSMA) feature of Cisco Industrial Network Director (IND) could allow an unauthenticated, remote attacker to gain unauthorized read access to sensitive data using an invalid X.509 certificate. The vulnerability is due to insufficient X.509 certificate validation when establishing a WSMA connection. An attacker could exploit this vulnerability by supplying a crafted X.509 certificate during the WSMA connection setup phase. A successful exploit could allow the attacker to conduct man-in-the-middle attacks to decrypt confidential information on WSMA connections to the affected software. At the time of publication, this vulnerability affected Cisco IND Software releases prior to 1.7."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-1948",
        "datePublished": "2019-08-21T18:30:24.142204Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in Cisco Webex Meetings Mobile (iOS) could allow an unauthenticated, remote attacker to gain unauthorized read access to sensitive data by using an invalid Secure Sockets Layer (SSL) certificate. The vulnerability is due to insufficient SSL certificate validation by the affected software. An attacker could exploit this vulnerability by supplying a crafted SSL certificate to an affected device. A successful exploit could allow the attacker to conduct man-in-the-middle attacks to decrypt confidential information on user connections to the affected software."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-20030",
        "datePublished": "2020-07-29T17:29:58",
        "description": {
            "lang": "en",
            "value": "An attacker with knowledge of the modem access number on a NEC UM8000 voicemail system may use SSH tunneling or standard Linux utilities to gain access to the system's LAN port. All versions are affected."
        },
        "metrics": [],
        "tags": [
            "tunneling"
        ]
    },
    {
        "cveId": "CVE-2019-20057",
        "datePublished": "2019-12-29T18:28:26",
        "description": {
            "lang": "en",
            "value": "com.proxyman.NSProxy.HelperTool in Privileged Helper Tool in Proxyman for macOS 1.11.0 and earlier allows an attacker to change the System Proxy and redirect all traffic to an attacker-controlled computer, enabling MITM attacks."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-20072",
        "datePublished": "2019-12-29T23:29:43",
        "description": {
            "lang": "en",
            "value": "On Netis DL4323 devices, XSS exists via the form2Ddns.cgi hostname parameter (Dynamic DNS Configuration)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-20076",
        "datePublished": "2019-12-29T23:28:52",
        "description": {
            "lang": "en",
            "value": "On Netis DL4323 devices, XSS exists via the form2Ddns.cgi username parameter (DynDns settings of the Dynamic DNS Configuration)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-20082",
        "datePublished": "2021-12-28T12:50:05",
        "description": {
            "lang": "en",
            "value": "ASUS RT-N53 3.0.0.4.376.3754 devices have a buffer overflow via a long lan_dns1_x or lan_dns2_x parameter to Advanced_LAN_Content.asp."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-20203",
        "datePublished": "2020-01-01T21:59:46",
        "description": {
            "lang": "en",
            "value": "The Authorized Addresses feature in the Postie plugin 1.9.40 for WordPress allows remote attackers to publish posts by spoofing the From information of an email message."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-20329",
        "datePublished": "2020-01-02T23:51:00",
        "description": {
            "lang": "en",
            "value": "OpenLambda 2019-09-10 allows DNS rebinding attacks against the OL server for the REST API on TCP port 5000."
        },
        "metrics": [],
        "tags": [
            "dns",
            "rebinding attack"
        ]
    },
    {
        "cveId": "CVE-2019-20400",
        "datePublished": "2020-02-06T03:10:26.194619Z",
        "description": {
            "lang": "en",
            "value": "The usage of Tomcat in Jira before version 8.5.2 allows local attackers with permission to write a dll file to a directory in the global path environmental variable can inject code into via a DLL hijacking vulnerability."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-20406",
        "datePublished": "2020-02-06T03:10:28.891775Z",
        "description": {
            "lang": "en",
            "value": "The usage of Tomcat in Confluence on the Microsoft Windows operating system before version 7.0.5, and from version 7.1.0 before version 7.1.1 allows local system attackers who have permission to write a DLL file in a directory in the global path environmental variable variable to inject code & escalate their privileges via a DLL hijacking vulnerability."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-20419",
        "datePublished": "2020-07-03T01:20:11.452807Z",
        "description": {
            "lang": "en",
            "value": "Affected versions of Atlassian Jira Server and Data Center allow remote attackers to execute arbitrary code via a DLL hijacking vulnerability in Tomcat. The affected versions are before version 8.5.5, and from version 8.6.0 before 8.7.2."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-20456",
        "datePublished": "2020-02-16T19:00:22",
        "description": {
            "lang": "en",
            "value": "Goverlan Reach Console before 9.50, Goverlan Reach Server before 3.50, and Goverlan Client Agent before 9.20.50 have an Untrusted Search Path that leads to Command Injection and Local Privilege Escalation via DLL hijacking."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-20459",
        "datePublished": "2024-11-07T00:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on Epson Expression Home XP255 20.08.FM10I8 devices. With the SNMPv1 public community, all values can be read, and with the epson community, all the changeable values can be written/updated, as demonstrated by permanently disabling the network card or changing the DNS servers."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-20488",
        "datePublished": "2020-03-02T15:06:24",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on NETGEAR WNR1000V4 1.1.0.54 devices. Multiple actions within the web management interface (setup.cgi) are vulnerable to command injection, allowing remote attackers to execute arbitrary commands, as demonstrated by shell metacharacters in the sysDNSHost parameter."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-20769",
        "datePublished": "2020-04-17T13:32:34",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in LG PC Suite for LG G3 and earlier (aka LG PC Suite v5.3.27 and earlier). DLL Hijacking can occur via a Trojan horse DLL in the current working directory. The LG ID is LVE-MOT-190001 (November 2019)."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-20781",
        "datePublished": "2020-04-29T13:08:35",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in LG Bridge before April 2019 on Windows. DLL Hijacking can occur."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-25017",
        "datePublished": "2021-02-02T17:23:58",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in rcp in MIT krb5-appl through 1.0.3. Due to the rcp implementation being derived from 1983 rcp, the server chooses which files/directories are sent to the client. However, the rcp client only performs cursory validation of the object name returned (only directory traversal attacks are prevented). A malicious rcp server (or Man-in-The-Middle attacker) can overwrite arbitrary files in the rcp client target directory. If recursive operation (-r) is performed, the server can manipulate subdirectories as well (for example, to overwrite the .ssh/authorized_keys file). This issue is similar to CVE-2019-6111 and CVE-2019-7283. NOTE: MIT krb5-appl is not supported upstream but is shipped by a few Linux distributions. The affected code was removed from the supported MIT Kerberos 5 (aka krb5) product many years ago, at version 1.8."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-25031",
        "datePublished": "2021-04-27T05:18:17",
        "description": {
            "lang": "en",
            "value": "Unbound before 1.9.5 allows configuration injection in create_unbound_ad_servers.sh upon a successful man-in-the-middle attack against a cleartext HTTP session. NOTE: The vendor does not consider this a vulnerability of the Unbound software. create_unbound_ad_servers.sh is a contributed script from the community that facilitates automatic configuration creation. It is not part of the Unbound installation"
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-25034",
        "datePublished": "2021-04-27T05:17:43",
        "description": {
            "lang": "en",
            "value": "Unbound before 1.9.5 allows an integer overflow in sldns_str2wire_dname_buf_origin, leading to an out-of-bounds write. NOTE: The vendor disputes that this is a vulnerability. Although the code may be vulnerable, a running Unbound installation cannot be remotely or locally exploited"
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-25035",
        "datePublished": "2021-04-27T05:17:34",
        "description": {
            "lang": "en",
            "value": "Unbound before 1.9.5 allows an out-of-bounds write in sldns_bget_token_par. NOTE: The vendor disputes that this is a vulnerability. Although the code may be vulnerable, a running Unbound installation cannot be remotely or locally exploited"
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-25038",
        "datePublished": "2021-04-27T05:17:03",
        "description": {
            "lang": "en",
            "value": "Unbound before 1.9.5 allows an integer overflow in a size calculation in dnscrypt/dnscrypt.c. NOTE: The vendor disputes that this is a vulnerability. Although the code may be vulnerable, a running Unbound installation cannot be remotely or locally exploited"
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-2033",
        "datePublished": "2019-04-19T19:36:54",
        "description": {
            "lang": "en",
            "value": "In create_hdr of dnssd_clientstub.c, there is a possible use after free. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation. Product: Android. Versions: Android-9. Android ID: A-121327565."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-2111",
        "datePublished": "2019-07-08T17:37:18",
        "description": {
            "lang": "en",
            "value": "In loop of DnsTlsSocket.cpp, there is a possible heap memory corruption due to a use after free. This could lead to remote code execution in the netd server with no additional execution privileges needed. User interaction is not needed for exploitation. Product: Android. Versions: Android-9. Android ID: A-122856181."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-3462",
        "datePublished": "2019-01-28T21:00:00Z",
        "description": {
            "lang": "en",
            "value": "Incorrect sanitation of the 302 redirect field in HTTP transport method of apt versions 1.4.8 and earlier can lead to content injection by a MITM attacker, potentially leading to remote code execution on the target machine."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-3498",
        "datePublished": "2019-01-09T22:00:00",
        "description": {
            "lang": "en",
            "value": "In Django 1.11.x before 1.11.18, 2.0.x before 2.0.10, and 2.1.x before 2.1.5, an Improper Neutralization of Special Elements in Output Used by a Downstream Component issue exists in django.views.defaults.page_not_found(), leading to content spoofing (in a 404 error page) if a user fails to recognize that a crafted URL has malicious content."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-3587",
        "datePublished": "2019-01-23T15:00:00",
        "description": {
            "lang": "en",
            "value": "DLL Search Order Hijacking vulnerability in Microsoft Windows client in McAfee Total Protection (MTP) Prior to 16.0.18 allows local users to execute arbitrary code via execution from a compromised folder."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.2,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-3613",
        "datePublished": "2020-06-10T11:12:49.485244Z",
        "description": {
            "lang": "en",
            "value": "DLL Search Order Hijacking vulnerability in McAfee Agent (MA) prior to 5.6.4 allows attackers with local access to execute arbitrary code via execution from a compromised folder."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-3646",
        "datePublished": "2019-09-13T13:05:30.972134Z",
        "description": {
            "lang": "en",
            "value": "DLL Search Order Hijacking vulnerability in Microsoft Windows client in McAfee Total Protection (MTP) Free Antivirus Trial 16.0.R18 and earlier allows local users to execute arbitrary code via execution from a compromised folder placed by an attacker with administrator rights."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-3667",
        "datePublished": "2019-12-11T06:25:17",
        "description": {
            "lang": "en",
            "value": "DLL Search Order Hijacking vulnerability in the Microsoft Windows client in McAfee Tech Check 3.0.0.17 and earlier allows local users to execute arbitrary code via the local folder placed there by an attacker."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.6,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-3702",
        "datePublished": "2019-05-13T16:54:22",
        "description": {
            "lang": "en",
            "value": "A Remote Code Execution issue in the DNS Query Web UI in Lifesize Icon LS_RM3_3.7.0 (2421) allows remote authenticated attackers to execute arbitrary commands via a crafted DNS Query address field in a JSON API request."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-3751",
        "datePublished": "2019-09-03T16:52:53.854744Z",
        "description": {
            "lang": "en",
            "value": "Dell EMC Enterprise Copy Data Management (eCDM) versions 1.0, 1.1, 2.0, 2.1, and 3.0 contain a certificate validation vulnerability. An unauthenticated remote attacker may potentially exploit this vulnerability to carry out a man-in-the-middle attack by supplying a crafted certificate and intercepting the victim's traffic to view or modify a victims data in transit."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-3777",
        "datePublished": "2019-03-07T19:00:00Z",
        "description": {
            "lang": "en",
            "value": "Pivotal Application Service (PAS), versions 2.2.x prior to 2.2.12, 2.3.x prior to 2.3.7 and 2.4.x prior to 2.4.3, contain apps manager that uses a cloud controller proxy that fails to verify SSL certs. A remote unauthenticated attacker that could hijack the Cloud Controller's DNS record could intercept access tokens sent to the Cloud Controller, giving the attacker access to the user's resources in the Cloud Controller"
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-3801",
        "datePublished": "2019-04-25T20:17:37.272844Z",
        "description": {
            "lang": "en",
            "value": "Cloud Foundry cf-deployment, versions prior to 7.9.0, contain java components that are using an insecure protocol to fetch dependencies when building. A remote unauthenticated malicious attacker could hijack the DNS entry for the dependency, and inject malicious code into the component."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.7,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-3806",
        "datePublished": "2019-01-29T17:00:00",
        "description": {
            "lang": "en",
            "value": "An issue has been found in PowerDNS Recursor versions after 4.1.3 before 4.1.9 where Lua hooks are not properly applied to queries received over TCP in some specific combination of settings, possibly bypassing security policies enforced using Lua."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-3807",
        "datePublished": "2019-01-29T17:00:00",
        "description": {
            "lang": "en",
            "value": "An issue has been found in PowerDNS Recursor versions 4.1.x before 4.1.9 where records in the answer section of responses received from authoritative servers with the AA flag not set were not properly validated, allowing an attacker to bypass DNSSEC validation."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 3.7,
                "severity": "LOW"
            }
        ],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2019-3841",
        "datePublished": "2019-03-25T17:03:28",
        "description": {
            "lang": "en",
            "value": "Kubevirt/virt-cdi-importer, versions 1.4.0 to 1.5.3 inclusive, were reported to disable TLS certificate validation when importing data into PVCs from container registries. This could enable man-in-the-middle attacks between a container registry and the virt-cdi-component, leading to possible undetected tampering of trusted container image content."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.4,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-3870",
        "datePublished": "2019-04-09T15:17:43",
        "description": {
            "lang": "en",
            "value": "A vulnerability was found in Samba from version (including) 4.9 to versions before 4.9.6 and 4.10.2. During the creation of a new Samba AD DC, files are created in a private subdirectory of the install location. This directory is typically mode 0700, that is owner (root) only access. However in some upgraded installations it will have other permissions, such as 0755, because this was the default before Samba 4.8. Within this directory, files are created with mode 0666, which is world-writable, including a sample krb5.conf, and the list of DNS names and servicePrincipalName values to update."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.1,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-3871",
        "datePublished": "2019-03-21T20:42:35",
        "description": {
            "lang": "en",
            "value": "A vulnerability was found in PowerDNS Authoritative Server before 4.0.7 and before 4.1.7. An insufficient validation of data coming from the user when building a HTTP request from a DNS query in the HTTP Connector of the Remote backend, allowing a remote user to cause a denial of service by making the server connect to an invalid endpoint, or possibly information disclosure by making the server connect to an internal endpoint and somehow extracting meaningful information about the response"
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-3875",
        "datePublished": "2019-06-12T13:51:38",
        "description": {
            "lang": "en",
            "value": "A vulnerability was found in keycloak before 6.0.2. The X.509 authenticator supports the verification of client certificates through the CRL, where the CRL list can be obtained from the URL provided in the certificate itself (CDP) or through the separately configured path. The CRL are often available over the network through unsecured protocols ('http' or 'ldap') and hence the caller should verify the signature and possibly the certification path. Keycloak currently doesn't validate signatures on CRL, which can result in a possibility of various attacks like man-in-the-middle."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-3978",
        "datePublished": "2019-10-28T21:32:57",
        "description": {
            "lang": "en",
            "value": "RouterOS versions 6.45.6 Stable, 6.44.5 Long-term, and below allow remote unauthenticated attackers to trigger DNS queries via port 8291. The queries are sent from the router to a server of the attacker's choice. The DNS responses are cached by the router, potentially resulting in cache poisoning"
        },
        "metrics": [],
        "tags": [
            "dns",
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2019-3979",
        "datePublished": "2019-10-28T21:33:25",
        "description": {
            "lang": "en",
            "value": "RouterOS versions 6.45.6 Stable, 6.44.5 Long-term, and below are vulnerable to a DNS unrelated data attack. The router adds all A records to its DNS cache even when the records are unrelated to the domain that was queried. Therefore, a remote attacker controlled DNS server can poison the router's DNS cache via malicious responses with additional and untrue records."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-4131",
        "datePublished": "2019-07-11T19:55:18.677605Z",
        "description": {
            "lang": "en",
            "value": "IBM Application Performance Management (IBM Monitoring 8.1.4) could allow a remote attacker to induce the application to perform server-side DNS lookups of arbitrary domain names. IBM X-Force ID: 158270."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-4150",
        "datePublished": "2019-06-25T15:45:29.935158Z",
        "description": {
            "lang": "en",
            "value": "IBM Security Access Manager 9.0.1 through 9.0.6 does not validate, or incorrectly validates, a certificate which could allow an attacker to spoof a trusted entity by using a man-in-the-middle (MITM) attack. IBM X-Force ID: 158510."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 3.7,
                "severity": "LOW"
            }
        ],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-4186",
        "datePublished": "2019-09-05T14:50:15.588572Z",
        "description": {
            "lang": "en",
            "value": "IBM Jazz for Service Management 1.1.3 is vulnerable to HTTP header injection, caused by incorrect trust in the HTTP Host header during caching. By sending a specially crafted HTTP GET request, a remote attacker could exploit this vulnerability to inject arbitrary HTTP headers, which will allow the attacker to conduct various attacks against the vulnerable system, including cross-site scripting, cache poisoning or session hijacking. IBM X-force ID: 158976."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning",
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-4216",
        "datePublished": "2019-11-22T15:21:22.930321Z",
        "description": {
            "lang": "en",
            "value": "IBM SmartCloud Analytics 1.3.1 through 1.3.5 is vulnerable to possible host header injection attack that could lead to HTTP cache poisoning or firewall bypass. IBM X-Force ID: 159187."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 4.6,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2019-4264",
        "datePublished": "2019-05-29T15:10:24.408232Z",
        "description": {
            "lang": "en",
            "value": "IBM QRadar SIEM 7.2.8 WinCollect could allow an attacker to obtain sensitive information by spoofing a trusted entity using man in the middle techniques due to not validating or incorrectly validating a certificate. IBM X-Force ID: 160072."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-4396",
        "datePublished": "2019-10-25T16:30:36.075959Z",
        "description": {
            "lang": "en",
            "value": "IBM Cloud Orchestrator 2.4 through 2.4.0.5 and 2.5 through 2.5.0.9 is vulnerable to HTTP response splitting attacks, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability to inject arbitrary HTTP headers and cause the server to return a split response, once the URL is clicked. This would allow the attacker to perform further attacks, such as Web cache poisoning or cross-site scripting, and possibly obtain sensitive information. IBM X-Force ID: 162236."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2019-4461",
        "datePublished": "2019-10-25T16:30:37.444055Z",
        "description": {
            "lang": "en",
            "value": "IBM Cloud Orchestrator 2.4 through 2.4.0.5 and 2.5 through 2.5.0.9 is vulnerable to HTTP Response Splitting caused by improper caching of content. This would allow the attacker to perform further attacks, such as Web Cache poisoning, cross-site scripting and possibly obtain sensitive information. IBM X-Force ID: 163682."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2019-4545",
        "datePublished": "2020-10-08T13:20:16.109123Z",
        "description": {
            "lang": "en",
            "value": "IBM QRadar SIEM 7.3 and 7.4 when configured to use Active Directory Authentication may be susceptible to spoofing attacks. IBM X-Force ID: 165877."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-4552",
        "datePublished": "2020-10-15T12:40:20.849636Z",
        "description": {
            "lang": "en",
            "value": "IBM Security Access Manager 9.0.7 and IBM Security Verify Access 10.0.0 are vulnerable to HTTP response splitting attacks. A remote attacker could exploit this vulnerability using specially-crafted URL to cause the server to return a split response, once the URL is clicked. This would allow the attacker to perform further attacks, such as Web cache poisoning, cross-site scripting, and possibly obtain sensitive information. IBM X-Force ID: 165960."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.1,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2019-4588",
        "datePublished": "2021-05-26T16:20:16.443799Z",
        "description": {
            "lang": "en",
            "value": "IBM Db2 for Linux, UNIX and Windows (includes Db2 Connect Server) 9.7, 10.1, 10.5, 11.1, and 11.5 could allow a local user to execute arbitrary code and conduct DLL hijacking attacks."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.4,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-4617",
        "datePublished": "2020-03-16T15:25:19.609949Z",
        "description": {
            "lang": "en",
            "value": "IBM Cloud Automation Manager 3.2.1.0 does not renew a session variable after a successful authentication which could lead to session fixation/hijacking vulnerability. This could force a user to utilize a cookie that may be known to an attacker. IBM X-Force ID: 168645."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-4654",
        "datePublished": "2020-04-15T15:13:54.596024Z",
        "description": {
            "lang": "en",
            "value": "IBM QRadar 7.3.0 to 7.3.3 Patch 2 does not validate, or incorrectly validates, a certificate which could allow an attacker to spoof a trusted entity by using a man-in-the-middle (MITM) attack. IBM X-ForceID: 170965."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 3.7,
                "severity": "LOW"
            }
        ],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-4732",
        "datePublished": "2020-02-03T16:45:18.286953Z",
        "description": {
            "lang": "en",
            "value": "IBM SDK, Java Technology Edition Version 7.0.0.0 through 7.0.10.55, 7.1.0.0 through 7.1.4.55, and 8.0.0.0 through 8.0.6.0 could allow a local authenticated attacker to execute arbitrary code on the system, caused by DLL search order hijacking vulnerability in Microsoft Windows client. By placing a specially-crafted file in a compromised folder, an attacker could exploit this vulnerability to execute arbitrary code on the system. IBM X-Force ID: 172618."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.2,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-5071",
        "datePublished": "2019-11-21T16:15:49",
        "description": {
            "lang": "en",
            "value": "An exploitable command injection vulnerability exists in the /goform/WanParameterSetting functionality of Tenda AC9 Router AC1200 Smart Dual-Band Gigabit WiFi Route (AC9V1.0 Firmware V15.03.05.16multiTRU). A specially crafted HTTP POST request can cause a command injection in the DNS1 post parameters, resulting in code execution. An attacker can send HTTP POST request with command to trigger this vulnerability."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-5072",
        "datePublished": "2019-11-21T16:16:06",
        "description": {
            "lang": "en",
            "value": "An exploitable command injection vulnerability exists in the /goform/WanParameterSetting functionality of Tenda AC9 Router AC1200 Smart Dual-Band Gigabit WiFi Route (AC9V1.0 Firmware V15.03.05.16multiTRU). A specially crafted HTTP POST request can cause a command injection in the DNS2 post parameters, resulting in code execution. An attacker can send HTTP POST request with command to trigger this vulnerability."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-5101",
        "datePublished": "2019-11-18T17:59:12",
        "description": {
            "lang": "en",
            "value": "An exploitable information leak vulnerability exists in the ustream-ssl library of OpenWrt, versions 18.06.4 and 15.05.1. When connecting to a remote server, the server's SSL certificate is checked but no action is taken when the certificate is invalid. An attacker could exploit this behavior by performing a man-in-the-middle attack, providing any certificate, leading to the theft of all the data sent by the client during the first request.An exploitable information leak vulnerability exists in the ustream-ssl library of OpenWrt, versions 18.06.4 and 15.05.1. When connecting to a remote server, the server's SSL certificate is checked but no action is taken when the certificate is invalid. An attacker could exploit this behavior by performing a man-in-the-middle attack, providing any certificate, leading to the theft of all the data sent by the client during the first request. After an SSL connection is initialized via _ustream_ssl_init, and after any data (e.g. the client's HTTP request) is written to the stream using ustream_printf, the code eventually enters the function _ustream_ssl_poll, which is used to dispatch the read/write events"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-5102",
        "datePublished": "2019-11-18T17:59:30",
        "description": {
            "lang": "en",
            "value": "An exploitable information leak vulnerability exists in the ustream-ssl library of OpenWrt, versions 18.06.4 and 15.05.1. When connecting to a remote server, the server's SSL certificate is checked but no action is taken when the certificate is invalid. An attacker could exploit this behavior by performing a man-in-the-middle attack, providing any certificate, leading to the theft of all the data sent by the client during the first request.An exploitable information leak vulnerability exists in the ustream-ssl library of OpenWrt, versions 18.06.4 and 15.05.1. When connecting to a remote server, the server's SSL certificate is checked but no action is taken when the certificate is invalid. An attacker could exploit this behavior by performing a man-in-the-middle attack, providing any certificate, leading to the theft of all the data sent by the client during the first request."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-5167",
        "datePublished": "2020-03-10T22:25:48",
        "description": {
            "lang": "en",
            "value": "An exploitable command injection vulnerability exists in the iocheckd service I/O-Check function of the WAGO PFC 200 version 03.02.02(14). At 0x1e3f0 the extracted dns value from the xml file is used as an argument to /etc/config-tools/edit_dns_server %s dns-server-nr=%d dns-server-name=<contents of dns node> using sprintf(). This command is later executed via a call to system(). This is done in a loop and there is no limit to how many dns entries will be parsed from the xml file."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-5168",
        "datePublished": "2020-03-10T22:25:57",
        "description": {
            "lang": "en",
            "value": "An exploitable command injection vulnerability exists in the iocheckd service I/O-Check function of the WAGO PFC 200 version 03.02.02(14). An attacker can send a specially crafted XML cache file At 0x1e8a8 the extracted domainname value from the xml file is used as an argument to /etc/config-tools/edit_dns_server domain-name=<contents of domainname node> using sprintf().This command is later executed via a call to system()."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-5177",
        "datePublished": "2020-03-11T23:25:07",
        "description": {
            "lang": "en",
            "value": "An exploitable stack buffer overflow vulnerability vulnerability exists in the iocheckd service I/O-Check functionality of WAGO PFC 200 Firmware version 03.02.02(14). The destination buffer sp+0x440 is overflowed with the call to sprintf() for any domainname values that are greater than 1024-len(/etc/config-tools/edit_dns_server domain-name=) in length. A domainname value of length 0x3fa will cause the service to crash."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-5215",
        "datePublished": "2019-06-04T18:44:57",
        "description": {
            "lang": "en",
            "value": "There is a man-in-the-middle (MITM) vulnerability on Huawei P30 smartphones versions before ELE-AL00 9.1.0.162(C01E160R1P12/C01E160R2P1), and P30 Pro versions before VOG-AL00 9.1.0.162 (C01E160R1P12/C01E160R2P1). When users establish connection and transfer data through Huawei Share, an attacker could sniff, spoof and do a series of operations to intrude the Huawei Share connection and launch a man-in-the-middle attack to obtain and tamper the data. (Vulnerability ID: HWPSIRT-2019-03109)"
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-5245",
        "datePublished": "2019-06-13T15:41:16",
        "description": {
            "lang": "en",
            "value": "HiSuite 9.1.0.300 versions and earlier contains a DLL hijacking vulnerability. This vulnerability exists due to some DLL file is loaded by HiSuite improperly. And it allows an attacker to load this DLL file of the attacker's choosing that could execute arbitrary code."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-5254",
        "datePublished": "2019-12-13T22:51:29",
        "description": {
            "lang": "en",
            "value": "Certain Huawei products (AP2000;IPS Module;NGFW Module;NIP6300;NIP6600;NIP6800;S5700;SVN5600;SVN5800;SVN5800-C;SeMG9811;Secospace AntiDDoS8000;Secospace USG6300;Secospace USG6500;Secospace USG6600;USG6000V;eSpace U1981) have an out-of-bounds read vulnerability. An attacker who logs in to the board may send crafted messages from the internal network port or tamper with inter-process message packets to exploit this vulnerability. Due to insufficient validation of the message, successful exploit may cause the affected board to be abnormal."
        },
        "metrics": [],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2019-5255",
        "datePublished": "2019-12-13T22:48:31",
        "description": {
            "lang": "en",
            "value": "Certain Huawei products (AP2000;IPS Module;NGFW Module;NIP6300;NIP6600;NIP6800;S5700;SVN5600;SVN5800;SVN5800-C;SeMG9811;Secospace AntiDDoS8000;Secospace USG6300;Secospace USG6500;Secospace USG6600;USG6000V;eSpace U1981) have a DoS vulnerability. An attacker may send crafted messages from a FTP client to exploit this vulnerability. Due to insufficient validation of the message, successful exploit may cause the system out-of-bounds read and result in a denial of service condition of the affected service."
        },
        "metrics": [],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2019-5256",
        "datePublished": "2019-12-13T22:45:34",
        "description": {
            "lang": "en",
            "value": "Certain Huawei products (AP2000;IPS Module;NGFW Module;NIP6300;NIP6600;NIP6800;S5700;SVN5600;SVN5800;SVN5800-C;SeMG9811;Secospace AntiDDoS8000;Secospace USG6300;Secospace USG6500;Secospace USG6600;USG6000V;eSpace U1981) have a null pointer dereference vulnerability. The system dereferences a pointer that it expects to be valid, but is NULL. A local attacker could exploit this vulnerability by sending crafted parameters. A successful exploit could cause a denial of service and the process reboot."
        },
        "metrics": [],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2019-5258",
        "datePublished": "2019-12-13T22:41:04",
        "description": {
            "lang": "en",
            "value": "Certain Huawei products (AP2000;IPS Module;NGFW Module;NIP6300;NIP6600;NIP6800;S5700;SVN5600;SVN5800;SVN5800-C;SeMG9811;Secospace AntiDDoS8000;Secospace USG6300;Secospace USG6500;Secospace USG6600;USG6000V;eSpace U1981) have a buffer overflow vulnerability. An attacker who logs in to the board may send crafted messages from the internal network port or tamper with inter-process message packets to exploit this vulnerability. Due to insufficient validation of the message, successful exploit may cause the affected board to be abnormal."
        },
        "metrics": [],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2019-5280",
        "datePublished": "2019-08-13T20:35:24",
        "description": {
            "lang": "en",
            "value": "The SIP TLS module of Huawei CloudLink Phone 7900 with V600R019C10 has a TLS certificate verification vulnerability. Due to insufficient verification of specific parameters of the TLS server certificate, attackers can perform man-in-the-middle attacks, leading to the affected phones registered abnormally, affecting the availability of IP phones."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-5456",
        "datePublished": "2019-07-30T20:19:48",
        "description": {
            "lang": "en",
            "value": "SMTP MITM refers to a malicious actor setting up an SMTP proxy server between the UniFi Controller version <= 5.10.21 and their actual SMTP server to record their SMTP credentials for malicious use later."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-5464",
        "datePublished": "2020-01-28T02:23:14",
        "description": {
            "lang": "en",
            "value": "A flawed DNS rebinding protection issue was discovered in GitLab CE/EE 10.2 and later in the `url_blocker.rb` which could result in SSRF where the library is utilized."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-5506",
        "datePublished": "2019-10-09T18:20:00",
        "description": {
            "lang": "en",
            "value": "Clustered Data ONTAP versions 9.0 and higher do not enforce hostname verification under certain circumstances making them susceptible to impersonation via man-in-the-middle attacks."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-5512",
        "datePublished": "2019-04-09T19:29:56",
        "description": {
            "lang": "en",
            "value": "VMware Workstation (15.x before 15.0.3, 14.x before 14.1.6) running on Windows does not handle COM classes appropriately. Successful exploitation of this issue may allow hijacking of COM classes used by the VMX process, on a Windows host, leading to elevation of privilege."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-5526",
        "datePublished": "2019-05-15T15:18:12",
        "description": {
            "lang": "en",
            "value": "VMware Workstation (15.x before 15.1.0) contains a DLL hijacking issue because some DLL files are improperly loaded by the application. Successful exploitation of this issue may allow attackers with normal user privileges to escalate their privileges to administrator on a windows host where Workstation is installed."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-5537",
        "datePublished": "2019-10-28T15:04:08",
        "description": {
            "lang": "en",
            "value": "Sensitive information disclosure vulnerability resulting from a lack of certificate validation during the File-Based Backup and Restore operations of VMware vCenter Server Appliance (6.7 before 6.7u3a and 6.5 before 6.5u3d) may allow a malicious actor to intercept sensitive data in transit over FTPS and HTTPS. A malicious actor with man-in-the-middle positioning between vCenter Server Appliance and a backup target may be able to intercept sensitive data in transit during File-Based Backup and Restore operations."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-5538",
        "datePublished": "2019-10-28T15:52:37",
        "description": {
            "lang": "en",
            "value": "Sensitive information disclosure vulnerability resulting from a lack of certificate validation during the File-Based Backup and Restore operations of VMware vCenter Server Appliance (6.7 before 6.7u3a and 6.5 before 6.5u3d) may allow a malicious actor to intercept sensitive data in transit over SCP. A malicious actor with man-in-the-middle positioning between vCenter Server Appliance and a backup target may be able to intercept sensitive data in transit during File-Based Backup and Restore operations."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-5539",
        "datePublished": "2019-12-23T19:20:50",
        "description": {
            "lang": "en",
            "value": "VMware Workstation (15.x prior to 15.5.1) and Horizon View Agent (7.10.x prior to 7.10.1 and 7.5.x prior to 7.5.4) contain a DLL hijacking vulnerability due to insecure loading of a DLL by Cortado Thinprint. Successful exploitation of this issue may allow attackers with normal user privileges to escalate their privileges to administrator on a Windows machine where Workstation or View Agent is installed."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-5592",
        "datePublished": "2019-08-23T19:52:17",
        "description": {
            "lang": "en",
            "value": "Multiple padding oracle vulnerabilities (Zombie POODLE, GOLDENDOODLE, OpenSSL 0-length) in the CBC padding implementation of FortiOS IPS engine version 5.000 to 5.006, 4.000 to 4.036, 4.200 to 4.219, 3.547 and below, when configured with SSL Deep Inspection policies and with the IPS sensor enabled, may allow an attacker to decipher TLS connections going through the FortiGate via monitoring the traffic in a Man-in-the-middle position."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-5647",
        "datePublished": "2020-01-22T18:00:22.724972Z",
        "description": {
            "lang": "en",
            "value": "The Chrome Plugin for Rapid7 AppSpider can incorrectly keep browser sessions active after recording a macro, even after a restart of the Chrome browser. This behavior could make future session hijacking attempts easier, since the user could believe a session was closed when it was not. This issue affects Rapid7 AppSpider version 3.8.213 and prior versions, and is fixed in version 3.8.215."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-5729",
        "datePublished": "2019-03-19T17:34:28",
        "description": {
            "lang": "en",
            "value": "Splunk-SDK-Python before 1.6.6 does not properly verify untrusted TLS server certificates, which could result in man-in-the-middle attacks."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-5794",
        "datePublished": "2019-05-23T19:14:51",
        "description": {
            "lang": "en",
            "value": "Incorrect handling of cancelled requests in Navigation in Google Chrome prior to 73.0.3683.75 allowed a remote attacker to perform domain spoofing via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-5801",
        "datePublished": "2019-05-23T19:19:27",
        "description": {
            "lang": "en",
            "value": "Incorrect eliding of URLs in Omnibox in Google Chrome on iOS prior to 73.0.3683.75 allowed a remote attacker to perform domain spoofing via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-5802",
        "datePublished": "2019-05-23T19:19:56",
        "description": {
            "lang": "en",
            "value": "Incorrect handling of download origins in Navigation in Google Chrome prior to 73.0.3683.75 allowed a remote attacker to perform domain spoofing via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-5804",
        "datePublished": "2019-05-23T19:21:29",
        "description": {
            "lang": "en",
            "value": "Incorrect command line processing in Chrome in Google Chrome prior to 73.0.3683.75 allowed a local attacker to perform domain spoofing via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-5812",
        "datePublished": "2019-06-27T16:13:43",
        "description": {
            "lang": "en",
            "value": "Inadequate security UI in iOS UI in Google Chrome prior to 74.0.3729.108 allowed a remote attacker to perform domain spoofing via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-5834",
        "datePublished": "2019-06-27T16:13:44",
        "description": {
            "lang": "en",
            "value": "Insufficient data validation in Blink in Google Chrome prior to 75.0.3770.80 allowed a remote attacker to perform domain spoofing via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-5961",
        "datePublished": "2019-07-05T13:20:17",
        "description": {
            "lang": "en",
            "value": "The Android App 'Tootdon for Mastodon' version 3.4.1 and earlier does not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-5982",
        "datePublished": "2019-07-05T13:20:18",
        "description": {
            "lang": "en",
            "value": "Improper download file verification vulnerability in VAIO Update 7.3.0.03150 and earlier allows remote attackers to conduct a man-in-the-middle attack via a malicous wireless LAN access point. A successful exploitation may result in a malicious file being downloaded/executed."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-6015",
        "datePublished": "2019-10-04T17:55:42",
        "description": {
            "lang": "en",
            "value": "FON2601E-SE, FON2601E-RE, FON2601E-FSW-S, and FON2601E-FSW-B with firmware versions 1.1.7 and earlier contain an issue where they may behave as open resolvers. If this vulnerability is exploited, FON routers may be leveraged for DNS amplification attacks to some other entities."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dns amplification attack",
            "amplification attack"
        ]
    },
    {
        "cveId": "CVE-2019-6032",
        "datePublished": "2019-12-26T15:16:50",
        "description": {
            "lang": "en",
            "value": "The NTV News24 prior to Ver.3.0.0 does not verify X.509 certificates from SSL servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-6109",
        "datePublished": "2019-01-31T00:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in OpenSSH 7.9. Due to missing character encoding in the progress display, a malicious server (or Man-in-The-Middle attacker) can employ crafted object names to manipulate the client output, e.g., by using ANSI control codes to hide additional files being transferred. This affects refresh_progress_meter() in progressmeter.c."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-6110",
        "datePublished": "2019-01-31T00:00:00",
        "description": {
            "lang": "en",
            "value": "In OpenSSH 7.9, due to accepting and displaying arbitrary stderr output from the server, a malicious server (or Man-in-The-Middle attacker) can manipulate the client output, for example to use ANSI control codes to hide additional files being transferred."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-6111",
        "datePublished": "2019-01-31T00:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in OpenSSH 7.9. Due to the scp implementation being derived from 1983 rcp, the server chooses which files/directories are sent to the client. However, the scp client only performs cursory validation of the object name returned (only directory traversal attacks are prevented). A malicious scp server (or Man-in-The-Middle attacker) can overwrite arbitrary files in the scp client target directory. If recursive operation (-r) is performed, the server can manipulate subdirectories as well (for example, to overwrite the .ssh/authorized_keys file)."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-6251",
        "datePublished": "2019-01-14T07:00:00",
        "description": {
            "lang": "en",
            "value": "WebKitGTK and WPE WebKit prior to version 2.24.1 are vulnerable to address bar spoofing upon certain JavaScript redirections. An attacker could cause malicious web content to be displayed as if for a trusted URI. This is similar to the CVE-2018-8383 issue in Microsoft Edge."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-6256",
        "datePublished": "2019-01-14T07:00:00",
        "description": {
            "lang": "en",
            "value": "A Denial of Service issue was discovered in the LIVE555 Streaming Media libraries as used in Live555 Media Server 0.93. It can cause an RTSPServer crash in handleHTTPCmd_TunnelingPOST, when RTSP-over-HTTP tunneling is supported, via x-sessioncookie HTTP headers in a GET request and a POST request within the same TCP session. This occurs because of a call to an incorrect virtual function pointer in the readSocket function in GroupsockHelper.cpp."
        },
        "metrics": [],
        "tags": [
            "tunneling"
        ]
    },
    {
        "cveId": "CVE-2019-6468",
        "datePublished": "2019-10-09T14:17:14.488494Z",
        "description": {
            "lang": "en",
            "value": "In BIND Supported Preview Edition, an error in the nxdomain-redirect feature can occur in versions which support EDNS Client Subnet (ECS) features. In those versions which have ECS support, enabling nxdomain-redirect is likely to lead to BIND exiting due to assertion failure. Versions affected: BIND Supported Preview Edition version 9.10.5-S1 -> 9.11.5-S5. ONLY BIND Supported Preview Edition releases are affected."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-6469",
        "datePublished": "2019-10-09T14:17:14.528095Z",
        "description": {
            "lang": "en",
            "value": "An error in the EDNS Client Subnet (ECS) feature for recursive resolvers can cause BIND to exit with an assertion failure when processing a response that has malformed RRSIGs. Versions affected: BIND 9.10.5-S1 -> 9.11.6-S1 of BIND 9 Supported Preview Edition."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-6475",
        "datePublished": "2019-10-17T19:17:36.355066Z",
        "description": {
            "lang": "en",
            "value": "Mirror zones are a BIND feature allowing recursive servers to pre-cache zone data provided by other servers. A mirror zone is similar to a zone of type secondary, except that its data is subject to DNSSEC validation before being used in answers, as if it had been looked up via traditional recursion, and when mirror zone data cannot be validated, BIND falls back to using traditional recursion instead of the mirror zone. However, an error in the validity checks for the incoming zone data can allow an on-path attacker to replace zone data that was validated with a configured trust anchor with forged data of the attacker's choosing. The mirror zone feature is most often used to serve a local copy of the root zone. If an attacker was able to insert themselves into the network path between a recursive server using a mirror zone and a root name server, this vulnerability could then be used to cause the recursive server to accept a copy of falsified root zone data. This affects BIND versions 9.14.0 up to 9.14.6, and 9.15.0 up to 9.15.4."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2019-6531",
        "datePublished": "2019-04-02T19:15:11",
        "description": {
            "lang": "en",
            "value": "An attacker could retrieve passwords from a HTTP GET request from the Kunbus PR100088 Modbus gateway versions prior to Release R02 (or Software Version 1.1.13166) if the attacker is in an MITM position."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-6593",
        "datePublished": "2019-02-26T15:00:00Z",
        "description": {
            "lang": "en",
            "value": "On BIG-IP 11.5.1-11.5.4, 11.6.1, and 12.1.0, a virtual server configured with a Client SSL profile may be vulnerable to a chosen ciphertext attack against CBC ciphers. When exploited, this may result in plaintext recovery of encrypted messages through a man-in-the-middle (MITM) attack, despite the attacker not having gained access to the server's private key itself. (CVE-2019-6593 also known as Zombie POODLE and GOLDENDOODLE.)"
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-6609",
        "datePublished": "2019-04-15T14:43:15",
        "description": {
            "lang": "en",
            "value": "Platform dependent weakness. This issue only impacts iSeries platforms. On these platforms, in BIG-IP (LTM, AAM, AFM, Analytics, APM, ASM, DNS, Edge Gateway, FPS, GTM, Link Controller, PEM, WebAccelerator) versions 14.0.0-14.1.0.1, 13.0.0-13.1.1.3, and 12.1.1 HF2-12.1.4, the secureKeyCapable attribute was not set which causes secure vault to not use the F5 hardware support to store the unit key. Instead the unit key is stored in plaintext on disk as would be the case for Z100 systems. Additionally this causes the unit key to be stored in UCS files taken on these platforms."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-6612",
        "datePublished": "2019-05-03T17:56:16",
        "description": {
            "lang": "en",
            "value": "On BIG-IP 14.0.0-14.1.0.1, 13.0.0-13.1.1.4, 12.1.0-12.1.4, 11.6.1-11.6.3.4, and 11.5.2-11.5.8, DNS query TCP connections that are aborted before receiving a response from a DNS cache may cause TMM to restart."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-6663",
        "datePublished": "2019-11-15T20:40:26",
        "description": {
            "lang": "en",
            "value": "The BIG-IP 15.0.0-15.0.1, 14.0.0-14.1.2.2, 13.1.0-13.1.3.1, 12.1.0-12.1.5, and 11.5.1-11.6.5.1, BIG-IQ 7.0.0, 6.0.0-6.1.0, and 5.2.0-5.4.0, iWorkflow 2.3.0, and Enterprise Manager 3.1.1 configuration utility is vulnerable to Anti DNS Pinning (DNS Rebinding) attack."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-6821",
        "datePublished": "2019-05-22T19:42:06",
        "description": {
            "lang": "en",
            "value": "CWE-330: Use of Insufficiently Random Values vulnerability, which could cause the hijacking of the TCP connection when using Ethernet communication in Modicon M580 firmware versions prior to V2.30, and all firmware versions of Modicon M340, Modicon Premium, Modicon Quantum."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-6961",
        "datePublished": "2019-06-20T13:43:44",
        "description": {
            "lang": "en",
            "value": "Incorrect access control in actionHandlerUtility.php in the RDK RDKB-20181217-1 WebUI module allows a logged in user to control DDNS, QoS, RIP, and other privileged configurations (intended only for the network operator) by sending an HTTP POST to the PHP backend, because the page filtering for non-superuser (in header.php) is done only for GET requests and not for direct AJAX calls."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-6964",
        "datePublished": "2019-06-20T13:50:35",
        "description": {
            "lang": "en",
            "value": "A heap-based buffer over-read in Service_SetParamStringValue in cosa_x_cisco_com_ddns_dml.c of the RDK RDKB-20181217-1 CcspPandM module may allow attackers with login credentials to achieve information disclosure and code execution by crafting an AJAX call responsible for DDNS configuration with an exactly 64-byte username, password, or domain, for which the buffer size is insufficient for the final '\\0' character. This is related to the CcspCommonLibrary and WebUI modules."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-7093",
        "datePublished": "2019-05-24T18:45:19",
        "description": {
            "lang": "en",
            "value": "Creative Cloud Desktop Application (installer) versions 4.7.0.400 and earlier have an insecure library loading (dll hijacking) vulnerability. Successful exploitation could lead to privilege escalation."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-7283",
        "datePublished": "2019-01-31T18:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in rcp in NetKit through 0.17. For an rcp operation, the server chooses which files/directories are sent to the client. However, the rcp client only performs cursory validation of the object name returned. A malicious rsh server (or Man-in-The-Middle attacker) can overwrite arbitrary files in a directory on the rcp client machine. This is similar to CVE-2019-6111."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-7284",
        "datePublished": "2019-12-18T17:33:15",
        "description": {
            "lang": "en",
            "value": "This issue was addressed with improved checks. This issue is fixed in iOS 12.2. Processing a maliciously crafted mail message may lead to S/MIME signature spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-7323",
        "datePublished": "2019-02-04T16:00:00Z",
        "description": {
            "lang": "en",
            "value": "GUP (generic update process) in LightySoft LogMX before 7.4.0 does not properly verify the authenticity of updates, which allows man-in-the-middle attackers to execute arbitrary code via a Trojan horse update. The update process relies on cleartext HTTP. The attacker could replace the LogMXUpdater.class file."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-7350",
        "datePublished": "2019-02-04T19:00:00Z",
        "description": {
            "lang": "en",
            "value": "Session fixation exists in ZoneMinder through 1.32.3, as an attacker can fixate his own session cookies to the next logged-in user, thereby hijacking the victim's account. This occurs because a set of multiple cookies (between 3 and 5) is being generated when a user successfully logs in, and these sets overlap for successive logins."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-7390",
        "datePublished": "2019-02-05T00:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in /bin/goahead on D-Link DIR-823G devices with firmware 1.02B03. There is incorrect access control allowing remote attackers to hijack the DNS service configuration of all clients in the WLAN, without authentication, via the SetWanSettings HNAP API."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-7399",
        "datePublished": "2019-02-17T04:00:00",
        "description": {
            "lang": "en",
            "value": "Amazon Fire OS before 5.3.6.4 allows a man-in-the-middle attack against HTTP requests for \"Terms of Use\" and Privacy pages."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-7590",
        "datePublished": "2019-07-19T20:56:07.852988Z",
        "description": {
            "lang": "en",
            "value": "ExacqVision Servers services 'exacqVisionServer', 'dvrdhcpserver' and 'mdnsresponder' have an unquoted service path. If an authenticated user is able to insert code in their system root path it potentially can be executed during the application startup. This could allow the authenticated user to elevate privileges on the system. This issue affects: Exacq Technologies, Inc. exacqVision Server 9.6; 9.8. This issue does not affect: Exacq Technologies, Inc. exacqVision Server version 9.4 and prior versions; 19.03. It is not known whether this issue affects: Exacq Technologies, Inc. exacqVision Server versions prior to 8.4."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.7,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-7628",
        "datePublished": "2019-02-08T03:00:00",
        "description": {
            "lang": "en",
            "value": "Pagure 5.2 leaks API keys by e-mailing them to users. Few e-mail servers validate TLS certificates, so it is easy for man-in-the-middle attackers to read these e-mails and gain access to Pagure on behalf of other users. This issue is found in the API token expiration reminder cron job in files/api_key_expire_mail.py; disabling that job is also a viable solution. (E-mailing a substring of the API key was an attempted, but rejected, solution.)"
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-7642",
        "datePublished": "2019-03-25T21:29:04",
        "description": {
            "lang": "en",
            "value": "D-Link routers with the mydlink feature have some web interfaces without authentication requirements. An attacker can remotely obtain users' DNS query logs and login logs. Vulnerable targets include but are not limited to the latest firmware versions of DIR-817LW (A1-1.04), DIR-816L (B1-2.06), DIR-816 (B1-2.06?), DIR-850L (A1-1.09), and DIR-868L (A1-1.10)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-7722",
        "datePublished": "2019-02-11T14:00:00",
        "description": {
            "lang": "en",
            "value": "PMD 5.8.1 and earlier processes XML external entities in ruleset files it parses as part of the analysis process, allowing attackers tampering it (either by direct modification or MITM attacks when using remote rulesets) to perform information disclosure, denial of service, or request forgery attacks. (PMD 6.x is unaffected because of a 2017-09-15 change.)"
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-7728",
        "datePublished": "2019-02-22T13:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in the Bosch Smart Camera App before 1.3.1 for Android. Due to improperly implemented TLS certificate checks, a malicious actor could potentially succeed in executing a man-in-the-middle attack for some connections. (The Bosch Smart Home App is not affected. iOS Apps are not affected.)"
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-7870",
        "datePublished": "2019-08-14T14:45:06",
        "description": {
            "lang": "en",
            "value": "Adobe Character Animator versions 2.1 and earlier have an insecure library loading (dll hijacking) vulnerability. Successful exploitation could lead to arbitrary code execution."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-7931",
        "datePublished": "2019-08-14T14:52:25",
        "description": {
            "lang": "en",
            "value": "Adobe Premiere Pro CC versions 13.1.2 and earlier have an insecure library loading (dll hijacking) vulnerability. Successful exploitation could lead to arbitrary code execution."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-7956",
        "datePublished": "2019-07-18T21:47:32",
        "description": {
            "lang": "en",
            "value": "Adobe Dreamweaver direct download installer versions 19.0 and below, 18.0 and below have an Insecure Library Loading (DLL hijacking) vulnerability. Successful exploitation could lead to Privilege Escalation in the context of the current user."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-7960",
        "datePublished": "2019-11-14T15:05:47",
        "description": {
            "lang": "en",
            "value": "Adobe Animate CC versions 19.2.1 and earlier have an insecure library loading (dll hijacking) vulnerability. Successful exploitation could lead to privilege escalation."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-7961",
        "datePublished": "2019-08-14T14:48:19",
        "description": {
            "lang": "en",
            "value": "Adobe Prelude CC versions 8.1 and earlier have an insecure library loading (dll hijacking) vulnerability. Successful exploitation could lead to arbitrary code execution."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-7962",
        "datePublished": "2019-11-14T15:07:57",
        "description": {
            "lang": "en",
            "value": "Adobe Illustrator CC versions 23.1 and earlier have an insecure library loading (dll hijacking) vulnerability. Successful exploitation could lead to privilege escalation."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-8062",
        "datePublished": "2019-08-14T14:41:10",
        "description": {
            "lang": "en",
            "value": "Adobe After Effects versions 16 and earlier have an insecure library loading (dll hijacking) vulnerability. Successful exploitation could lead to arbitrary code execution."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-8076",
        "datePublished": "2019-09-12T18:05:20",
        "description": {
            "lang": "en",
            "value": "Adobe application manager installer version 10.0 have an Insecure Library Loading (DLL hijacking) vulnerability. Successful exploitation could lead to Arbitrary Code Execution in the context of the current user."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-8282",
        "datePublished": "2019-06-07T14:21:01",
        "description": {
            "lang": "en",
            "value": "Gemalto Admin Control Center, all versions prior to 7.92, uses cleartext HTTP to communicate with www3.safenet-inc.com to obtain language packs. This allows attacker to do man-in-the-middle (MITM) attack and replace original language pack by malicious one."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-8345",
        "datePublished": "2019-02-15T14:00:00Z",
        "description": {
            "lang": "en",
            "value": "The Help feature in the ES File Explorer File Manager application 4.1.9.7.4 for Android allows session hijacking by a Man-in-the-middle attacker on the local network because HTTPS is not used, and an attacker's web site is displayed in a WebView with no information about the URL."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-8642",
        "datePublished": "2020-10-27T19:38:49",
        "description": {
            "lang": "en",
            "value": "An issue existed in the handling of S-MIME certificates. This issue was addressed with improved validation of S-MIME certificates. This issue is fixed in macOS Mojave 10.14.4, Security Update 2019-002 High Sierra, Security Update 2019-002 Sierra. Processing a maliciously crafted mail message may lead to S/MIME signature spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-8654",
        "datePublished": "2019-12-18T17:33:20",
        "description": {
            "lang": "en",
            "value": "An inconsistent user interface issue was addressed with improved state management. This issue is fixed in Safari 13.0.1. Visiting a malicious website may lead to user interface spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-8670",
        "datePublished": "2019-12-18T17:33:20",
        "description": {
            "lang": "en",
            "value": "An inconsistent user interface issue was addressed with improved state management. This issue is fixed in macOS Mojave 10.14.6, Safari 12.1.2. Visiting a malicious website may lead to address bar spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-8727",
        "datePublished": "2019-12-18T17:33:22",
        "description": {
            "lang": "en",
            "value": "A logic issue was addressed with improved state management. This issue is fixed in iOS 13. Visiting a malicious website may lead to address bar spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-8950",
        "datePublished": "2019-02-20T04:00:00Z",
        "description": {
            "lang": "en",
            "value": "The backdoor account dnsekakf2$$ in /bin/login on DASAN H665 devices with firmware 1.46p1-0028 allows an attacker to login to the admin account via TELNET."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-9022",
        "datePublished": "2019-02-22T23:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in PHP 7.x before 7.1.26, 7.2.x before 7.2.14, and 7.3.x before 7.3.2. dns_get_record misparses a DNS response, which can allow a hostile DNS server to cause PHP to misuse memcpy, leading to read operations going past the buffer allocated for DNS data. This affects php_parserr in ext/standard/dns.c for DNS_CAA and DNS_ANY queries."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-9116",
        "datePublished": "2019-02-25T07:00:00",
        "description": {
            "lang": "en",
            "value": "DLL hijacking is possible in Sublime Text 3 version 3.1.1 build 3176 on 32-bit Windows platforms because a Trojan horse api-ms-win-core-fibers-l1-1-1.dll or api-ms-win-core-localization-l1-2-1.dll file may be loaded if a victim uses sublime_text.exe to open a .txt file within an attacker's %LOCALAPPDATA%\\Temp\\sublime_text folder. NOTE: the vendor's position is \"This does not appear to be a bug with Sublime Text, but rather one with Windows that has been patched."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-9146",
        "datePublished": "2019-02-25T18:00:00",
        "description": {
            "lang": "en",
            "value": "Jamf Self Service 10.9.0 allows man-in-the-middle attackers to obtain a root shell by leveraging the \"publish Bash shell scripts\" feature to insert \"/Applications/Utilities/Terminal app/Contents/MacOS/Terminal\" into the TCP data stream."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-9380",
        "datePublished": "2019-09-27T18:05:17",
        "description": {
            "lang": "en",
            "value": "In the settings UI, there is a possible spoofing vulnerability due to a missing permission check. This could lead to a user mistakenly changing permission settings with no additional execution privileges needed. User interaction is needed for exploitation. Product: AndroidVersions: Android-10Android ID: A-123700098"
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-9486",
        "datePublished": "2019-04-30T18:27:33",
        "description": {
            "lang": "en",
            "value": "STRATO HiDrive Desktop Client 5.0.1.0 for Windows suffers from a SYSTEM privilege escalation vulnerability through the HiDriveMaintenanceService service. This service establishes a NetNamedPipe endpoint that allows applications to connect and call publicly exposed methods. An attacker can inject and execute code by hijacking the insecure communications with the service. This vulnerability also affects Telekom MagentaCLOUD through 5.7.0.0 and 1&1 Online Storage through 6.1.0.0."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2019-9686",
        "datePublished": "2019-03-11T16:00:00",
        "description": {
            "lang": "en",
            "value": "pacman before 5.1.3 allows directory traversal when installing a remote package via a specified URL \"pacman -U <url>\" due to an unsanitized file name received from a Content-Disposition header. pacman renames the downloaded package file to match the name given in this header. However, pacman did not sanitize this name, which may contain slashes, before calling rename(). A malicious server (or a network MitM if downloading over HTTP) can send a Content-Disposition header to make pacman place the file anywhere in the filesystem, potentially leading to arbitrary root code execution. Notably, this bypasses pacman's package signature checking. This occurs in curl_download_internal in lib/libalpm/dload.c."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2019-9700",
        "datePublished": "2019-07-16T18:37:07",
        "description": {
            "lang": "en",
            "value": "Norton Password Manager, prior to 6.3.0.2082, may be susceptible to an address spoofing issue. This type of issue may allow an attacker to disguise their origin IP address in order to obfuscate the source of network traffic."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-9747",
        "datePublished": "2019-03-13T19:00:00Z",
        "description": {
            "lang": "en",
            "value": "In tinysvcmdns through 2018-01-16, a maliciously crafted mDNS (Multicast DNS) packet triggers an infinite loop while parsing an mDNS query. When mDNS compressed labels point to each other, the function uncompress_nlabel goes into an infinite loop trying to analyze the packet with an mDNS query. As a result, the mDNS server hangs after receiving the malicious mDNS packet. NOTE: the product's web site states \"This project is un-maintained, and has been since 2013. ... There are known vulnerabilities ... You are advised to NOT use this library for any new projects / products.\""
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-9748",
        "datePublished": "2019-03-13T19:00:00Z",
        "description": {
            "lang": "en",
            "value": "In tinysvcmdns through 2018-01-16, an mDNS server processing a crafted packet can perform arbitrary data read operations up to 16383 bytes from the start of the buffer. This can lead to a segmentation fault in uncompress_nlabel in mdns.c and a crash of the server (depending on the memory protection of the CPU and the operating system), or disclosure of memory content via error messages or a server response. NOTE: the product's web site states \"This project is un-maintained, and has been since 2013. ... There are known vulnerabilities ... You are advised to NOT use this library for any new projects / products.\""
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2019-9750",
        "datePublished": "2019-03-13T19:00:00Z",
        "description": {
            "lang": "en",
            "value": "In IoTivity through 1.3.1, the CoAP server interface can be used for Distributed Denial of Service attacks using source IP address spoofing and UDP-based traffic amplification. The reflected traffic is 6 times bigger than spoofed requests. This occurs because the construction of a \"4.01 Unauthorized\" response is mishandled. NOTE: the vendor states \"While this is an interesting attack, there is no plan for maintainer to fix, as we are migrating to IoTivity Lite.\""
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2019-9798",
        "datePublished": "2019-04-26T16:13:22",
        "description": {
            "lang": "en",
            "value": "On Android systems, Firefox can load a library from APITRACE_LIB, which is writable by all users and applications. This could allow malicious third party applications to execute a man-in-the-middle attack if a malicious code was written to that location and loaded. *Note: This issue only affects Android. Other operating systems are unaffected.*. This vulnerability affects Firefox < 66."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-9803",
        "datePublished": "2019-04-26T16:13:22",
        "description": {
            "lang": "en",
            "value": "The Upgrade-Insecure-Requests (UIR) specification states that if UIR is enabled through Content Security Policy (CSP), navigation to a same-origin URL must be upgraded to HTTPS. Firefox will incorrectly navigate to an HTTP URL rather than perform the security upgrade requested by the CSP in some circumstances, allowing for potential man-in-the-middle attacks on the linked resources. This vulnerability affects Firefox < 66."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2019-9843",
        "datePublished": "2019-03-15T23:00:00",
        "description": {
            "lang": "en",
            "value": "In DiffPlug Spotless before 1.20.0 (library and Maven plugin) and before 3.20.0 (Gradle plugin), the XML parser would resolve external entities over both HTTP and HTTPS and didn't respect the resolveExternalEntities setting. For example, this allows disclosure of file contents to a MITM attacker if a victim performs a spotlessApply operation on an untrusted XML file."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    }
]