[
    {
        "cveId": "CVE-2020-0028",
        "datePublished": "2020-02-13T14:22:35",
        "description": {
            "lang": "en",
            "value": "In notifyNetworkTested and related functions of NetworkMonitor.java, there is a possible bypass of private DNS settings. This could lead to remote information disclosure with no additional execution privileges needed. User interaction is needed for exploitation.Product: AndroidVersions: Android-9Android ID: A-122652057"
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-0299",
        "datePublished": "2020-09-18T15:04:07",
        "description": {
            "lang": "en",
            "value": "In Bluetooth, there is a possible spoofing of bluetooth device metadata due to a missing permission check. This could lead to local escalation of privilege with User execution privileges needed. User interaction is not needed for exploitation.Product: AndroidVersions: Android-11Android ID: A-145130119"
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-0379",
        "datePublished": "2020-09-17T15:24:02",
        "description": {
            "lang": "en",
            "value": "In the Bluetooth service, there is a possible spoofing attack due to a logic error. This could lead to remote information disclosure of sensitive information with no additional execution privileges needed. User interaction is needed for exploitation.Product: AndroidVersions: Android-8.0 Android-8.1 Android-9 Android-10 Android-11Android ID: A-150156492"
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-0387",
        "datePublished": "2020-09-17T18:28:21",
        "description": {
            "lang": "en",
            "value": "In manifest files of the SmartSpace package, there is a possible tapjacking vector due to a missing permission check. This could lead to local escalation of privilege and account hijacking with no additional execution privileges needed. User interaction is needed for exploitation.Product: AndroidVersions: Android kernelAndroid ID: A-156046804"
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-0601",
        "datePublished": "2020-01-14T23:11:20",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in the way Windows CryptoAPI (Crypt32.dll) validates Elliptic Curve Cryptography (ECC) certificates.An attacker could exploit the vulnerability by using a spoofed code-signing certificate to sign a malicious executable, making it appear the file was from a trusted, legitimate source, aka 'Windows CryptoAPI Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-0647",
        "datePublished": "2020-01-14T23:11:39",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Office Online does not validate origin in cross-origin communications correctly, aka 'Microsoft Office Online Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-0664",
        "datePublished": "2020-09-11T17:08:17",
        "description": {
            "lang": "en",
            "value": "<p>An information disclosure vulnerability exists when Active Directory integrated DNS (ADIDNS) mishandles objects in memory. An authenticated attacker who successfully exploited this vulnerability would be able to read sensitive information about the target system.</p>\n<p>To exploit this condition, an authenticated attacker would need to send a specially crafted request to the AD|DNS service. Note that the information disclosure vulnerability by itself would not be sufficient for an attacker to compromise a system. However, an attacker could combine this vulnerability with additional vulnerabilities to further exploit the system.</p>\n<p>The update addresses the vulnerability by correcting how Active Directory integrated DNS (ADIDNS) handles objects in memory.</p>\n"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-0695",
        "datePublished": "2020-02-11T21:23:01",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Office Online Server does not validate origin in cross-origin communications correctly, aka 'Microsoft Office Online Server Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-0718",
        "datePublished": "2020-09-11T17:08:18",
        "description": {
            "lang": "en",
            "value": "<p>A remote code execution vulnerability exists when Active Directory integrated DNS (ADIDNS) mishandles objects in memory. An authenticated attacker who successfully exploited the vulnerability could run arbitrary code in the context of the Local System Account</p>\n<p>To exploit the vulnerability, an authenticated attacker could send malicious requests to an Active Directory integrated DNS (ADIDNS) server.</p>\n<p>The update addresses the vulnerability by correcting how Active Directory integrated DNS (ADIDNS) handles objects in memory.</p>\n"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-0761",
        "datePublished": "2020-09-11T17:08:19",
        "description": {
            "lang": "en",
            "value": "<p>A remote code execution vulnerability exists when Active Directory integrated DNS (ADIDNS) mishandles objects in memory. An authenticated attacker who successfully exploited the vulnerability could run arbitrary code in the context of the Local System Account</p>\n<p>To exploit the vulnerability, an authenticated attacker could send malicious requests to an Active Directory integrated DNS (ADIDNS) server.</p>\n<p>The update addresses the vulnerability by correcting how Active Directory integrated DNS (ADIDNS) handles objects in memory.</p>\n"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-0836",
        "datePublished": "2020-09-11T17:08:23",
        "description": {
            "lang": "en",
            "value": "<p>A denial of service vulnerability exists in Windows DNS when it fails to properly handle queries. An attacker who successfully exploited this vulnerability could cause the DNS service to become nonresponsive.</p>\n<p>To exploit the vulnerability, an authenticated attacker could send malicious DNS queries to a target, resulting in a denial of service.</p>\n<p>The update addresses the vulnerability by correcting how Windows DNS processes queries.</p>\n"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-0839",
        "datePublished": "2020-09-11T17:08:24",
        "description": {
            "lang": "en",
            "value": "<p>An elevation of privilege vulnerability exists in the way that the dnsrslvr.dll handles objects in memory. An attacker who successfully exploited the vulnerability could execute code with elevated permissions.</p>\n<p>To exploit the vulnerability, a locally authenticated attacker could run a specially crafted application.</p>\n<p>The security update addresses the vulnerability by ensuring the dnsrslvr.dll properly handles objects in memory.</p>\n"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-0856",
        "datePublished": "2020-09-11T17:08:25",
        "description": {
            "lang": "en",
            "value": "<p>An information disclosure vulnerability exists when Active Directory integrated DNS (ADIDNS) mishandles objects in memory. An authenticated attacker who successfully exploited this vulnerability would be able to read sensitive information about the target system.</p>\n<p>To exploit this condition, an authenticated attacker would need to send a specially crafted request to the AD|DNS service. Note that the information disclosure vulnerability by itself would not be sufficient for an attacker to compromise a system. However, an attacker could combine this vulnerability with additional vulnerabilities to further exploit the system.</p>\n<p>The update addresses the vulnerability by correcting how Active Directory integrated DNS (ADIDNS) handles objects in memory.</p>\n"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-0884",
        "datePublished": "2020-03-12T15:48:53",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in Microsoft Visual Studio as it includes a reply URL that is not secured by SSL, aka 'Microsoft Visual Studio Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-0903",
        "datePublished": "2020-03-12T15:48:58",
        "description": {
            "lang": "en",
            "value": "A cross-site-scripting (XSS) vulnerability exists when Microsoft Exchange Server does not properly sanitize a specially crafted web request to an affected Exchange server, aka 'Microsoft Exchange Server Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-0972",
        "datePublished": "2020-04-15T15:13:09",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server, aka 'Microsoft SharePoint Spoofing Vulnerability'. This CVE ID is unique from CVE-2020-0975, CVE-2020-0976, CVE-2020-0977."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-0975",
        "datePublished": "2020-04-15T15:13:10",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server, aka 'Microsoft SharePoint Spoofing Vulnerability'. This CVE ID is unique from CVE-2020-0972, CVE-2020-0976, CVE-2020-0977."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-0976",
        "datePublished": "2020-04-15T15:13:11",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server, aka 'Microsoft SharePoint Spoofing Vulnerability'. This CVE ID is unique from CVE-2020-0972, CVE-2020-0975, CVE-2020-0977."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-0977",
        "datePublished": "2020-04-15T15:13:11",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server, aka 'Microsoft SharePoint Spoofing Vulnerability'. This CVE ID is unique from CVE-2020-0972, CVE-2020-0975, CVE-2020-0976."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-0993",
        "datePublished": "2020-04-15T15:13:17",
        "description": {
            "lang": "en",
            "value": "A denial of service vulnerability exists in Windows DNS when it fails to properly handle queries, aka 'Windows DNS Denial of Service Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-10030",
        "datePublished": "2020-05-19T15:52:20",
        "description": {
            "lang": "en",
            "value": "An issue has been found in PowerDNS Recursor 4.1.0 up to and including 4.3.0. It allows an attacker (with enough privileges to change the system's hostname) to cause disclosure of uninitialized memory content via a stack-based out-of-bounds read. It only occurs on systems where gethostname() does not have '\\0' termination of the returned string if the hostname is larger than the supplied buffer. (Linux systems are not affected because the buffer is always large enough. OpenBSD systems are not affected because the returned hostname always has '\\0' termination.) Under some conditions, this issue can lead to the writing of one '\\0' byte out-of-bounds on the stack, causing a denial of service or possibly arbitrary code execution."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-10039",
        "datePublished": "2020-07-14T13:18:04",
        "description": {
            "lang": "en",
            "value": "A vulnerability has been identified in SICAM MMU (All versions < V2.05), SICAM SGU (All versions), SICAM T (All versions < V2.18). An attacker in a privileged network position between a legitimate user and the web server might be able to conduct a Man-in-the-middle attack and gain read and write access to the transmitted data."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-10112",
        "datePublished": "2020-03-06T20:33:53",
        "description": {
            "lang": "en",
            "value": "Citrix Gateway 11.1, 12.0, and 12.1 allows Cache Poisoning. NOTE: Citrix disputes this as not a vulnerability. By default, Citrix ADC only caches static content served under certain URL paths for Citrix Gateway usage. No dynamic content is served under these paths, which implies that those cached pages would not change based on parameter values. All other data traffic going through Citrix Gateway are NOT cached by default"
        },
        "metrics": [],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-10115",
        "datePublished": "2020-03-17T14:35:51",
        "description": {
            "lang": "en",
            "value": "cPanel before 84.0.20, when PowerDNS is used, allows arbitrary code execution as root via dnsadmin. (SEC-537)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-10134",
        "datePublished": "2020-05-19T15:50:14.117011Z",
        "description": {
            "lang": "en",
            "value": "Pairing in Bluetooth® Core v5.2 and earlier may permit an unauthenticated attacker to acquire credentials with two pairing devices via adjacent access when the unauthenticated user initiates different pairing methods in each peer device and an end-user erroneously completes both pairing procedures with the MITM using the confirmation number of one peer as the passkey of the other. An adjacent, unauthenticated attacker could be able to initiate any Bluetooth operation on either attacked device exposed by the enabled Bluetooth profiles. This exposure may be limited when the user must authorize certain access explicitly, but so long as a user assumes that it is the intended remote device requesting permissions, device-local protections may be weakened."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-10136",
        "datePublished": "2020-06-02T08:35:12.921954Z",
        "description": {
            "lang": "en",
            "value": "IP-in-IP protocol specifies IP Encapsulation within IP standard (RFC 2003, STD 1) that decapsulate and route IP-in-IP traffic is vulnerable to spoofing, access-control bypass and other unexpected behavior due to the lack of validation to verify network packets before decapsulation and routing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-10209",
        "datePublished": "2020-12-29T23:43:53",
        "description": {
            "lang": "en",
            "value": "Command Injection in the CPE WAN Management Protocol (CWMP) registration in Amino Communications AK45x series, AK5xx series, AK65x series, Aria6xx series, Aria7/AK7Xx series and Kami7B allows man-in-the-middle attackers to execute arbitrary commands with root level privileges."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-10212",
        "datePublished": "2020-03-06T23:30:11",
        "description": {
            "lang": "en",
            "value": "upload.php in Responsive FileManager 9.13.4 and 9.14.0 allows SSRF via the url parameter because file-extension blocking is mishandled and because it is possible for a DNS hostname to resolve to an internal IP address. For example, an SSRF attempt may succeed if a .ico filename is added to the PATH_INFO. Also, an attacker could create a DNS hostname that resolves to the 0.0.0.0 IP address for DNS pinning. NOTE: this issue exists because of an incomplete fix for CVE-2018-14728."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-10215",
        "datePublished": "2020-03-07T00:30:05",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on D-Link DIR-825 Rev.B 2.10 devices. They allow remote attackers to execute arbitrary commands via the dns_query_name parameter in a dns_query.cgi POST request. TRENDnet TEW-632BRP 1.010B32 is also affected."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-10282",
        "datePublished": "2020-07-03T14:30:15.587513Z",
        "description": {
            "lang": "en",
            "value": "The Micro Air Vehicle Link (MAVLink) protocol presents no authentication mechanism on its version 1.0 (nor authorization) whichs leads to a variety of attacks including identity spoofing, unauthorized access, PITM attacks and more. According to literature, version 2.0 optionally allows for package signing which mitigates this flaw. Another source mentions that MAVLink 2.0 only provides a simple authentication system based on HMAC. This implies that the flying system overall should add the same symmetric key into all devices of network. If not the case, this may cause a security issue, that if one of the devices and its symmetric key are compromised, the whole authentication system is not reliable."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 9.8,
                "severity": "CRITICAL"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-10715",
        "datePublished": "2020-09-16T18:00:27",
        "description": {
            "lang": "en",
            "value": "A content spoofing vulnerability was found in the openshift/console 3.11 and 4.x. This flaw allows an attacker to craft a URL and inject arbitrary text onto the error page that appears to be from the OpenShift instance. This attack could potentially convince a user that the inserted text is legitimate."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-10749",
        "datePublished": "2020-06-03T13:45:39",
        "description": {
            "lang": "en",
            "value": "A vulnerability was found in all versions of containernetworking/plugins before version 0.8.6, that allows malicious containers in Kubernetes clusters to perform man-in-the-middle (MitM) attacks. A malicious container can exploit this flaw by sending rogue IPv6 router advertisements to the host or other containers, to redirect traffic to the malicious container."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-10800",
        "datePublished": "2020-03-21T14:06:56",
        "description": {
            "lang": "en",
            "value": "lix through 15.8.7 allows man-in-the-middle attackers to execute arbitrary code by modifying the HTTP client-server data stream so that the Location header is associated with attacker-controlled executable content in the postDownload field."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-10881",
        "datePublished": "2020-03-25T19:15:23",
        "description": {
            "lang": "en",
            "value": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of TP-Link Archer A7 Firmware Ver: 190726 AC1750 routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the handling of DNS responses. A crafted DNS message can trigger an overflow of a fixed-length, stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the root user. Was ZDI-CAN-9660."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 9.8,
                "severity": "CRITICAL"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-10885",
        "datePublished": "2020-03-25T19:15:25",
        "description": {
            "lang": "en",
            "value": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of TP-Link Archer A7 Firmware Ver: 190726 AC1750 routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the handling of DNS responses. The issue results from the lack of proper validation of DNS reponses prior to further processing. An attacker can leverage this in conjunction with other vulnerabilities to execute code in the context of the root user. Was ZDI-CAN-9661."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.1,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-10995",
        "datePublished": "2020-05-19T16:04:12",
        "description": {
            "lang": "en",
            "value": "PowerDNS Recursor from 4.1.0 up to and including 4.3.0 does not sufficiently defend against amplification attacks. An issue in the DNS protocol has been found that allow malicious parties to use recursive DNS services to attack third party authoritative name servers. The attack uses a crafted reply by an authoritative name server to amplify the resulting traffic between the recursive and other authoritative name servers. Both types of service can suffer degraded performance as an effect. This is triggered by random subdomains in the NSDNAME in NS records. PowerDNS Recursor 4.1.16, 4.2.2 and 4.3.1 contain a mitigation to limit the impact of this DNS protocol issue."
        },
        "metrics": [],
        "tags": [
            "dns",
            "amplification attack"
        ]
    },
    {
        "cveId": "CVE-2020-11003",
        "datePublished": "2020-04-14T23:10:12",
        "description": {
            "lang": "en",
            "value": "Oasis before version 2.15.0 has a potential DNS rebinding or CSRF vulnerability. If you're running a vulnerable application on your computer and an attacker can trick you into visiting a malicious website, they could use DNS rebinding and CSRF attacks to read/write to vulnerable applications. This has been patched in 2.15.0."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-11024",
        "datePublished": "2020-04-29T20:55:13",
        "description": {
            "lang": "en",
            "value": "In Moonlight iOS/tvOS before 4.0.1, the pairing process is vulnerable to a man-in-the-middle attack. The bug has been fixed in Moonlight v4.0.1 for iOS and tvOS."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.1,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-11079",
        "datePublished": "2020-05-28T18:40:12",
        "description": {
            "lang": "en",
            "value": "node-dns-sync (npm module dns-sync) through 0.2.0 allows execution of arbitrary commands . This issue may lead to remote code execution if a client of the library calls the vulnerable method with untrusted input. This has been fixed in 0.2.1."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.6,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-11091",
        "datePublished": "2020-06-03T22:55:13",
        "description": {
            "lang": "en",
            "value": "In Weave Net before version 2.6.3, an attacker able to run a process as root in a container is able to respond to DNS requests from the host and thereby insert themselves as a fake service. In a cluster with an IPv4 internal network, if IPv6 is not totally disabled on the host (via ipv6.disable=1 on the kernel cmdline), it will be either unconfigured or configured on some interfaces, but it's pretty likely that ipv6 forwarding is disabled, ie /proc/sys/net/ipv6/conf//forwarding == 0. Also by default, /proc/sys/net/ipv6/conf//accept_ra == 1. The combination of these 2 sysctls means that the host accepts router advertisements and configure the IPv6 stack using them. By sending rogue router advertisements, an attacker can reconfigure the host to redirect part or all of the IPv6 traffic of the host to the attacker controlled container. Even if there was no IPv6 traffic before, if the DNS returns A (IPv4) and AAAA (IPv6) records, many HTTP libraries will try to connect via IPv6 first then fallback to IPv4, giving an opportunity to the attacker to respond. If by chance you also have on the host a vulnerability like last year's RCE in apt (CVE-2019-3462), you can now escalate to the host. Weave Net version 2.6.3 disables the accept_ra option on the veth devices that it creates."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-11551",
        "datePublished": "2020-05-18T15:45:30",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on NETGEAR Orbi Tri-Band Business WiFi Add-on Satellite (SRS60) AC3000 V2.5.1.106, Outdoor Satellite (RBS50Y) V2.5.1.106, and Pro Tri-Band Business WiFi Router (SRR60) AC3000 V2.5.1.106. The administrative SOAP interface allows an unauthenticated remote write of arbitrary Wi-Fi configuration data such as authentication details (e.g., the Web-admin password), network settings, DNS settings, system administration interface configuration, etc."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 9.6,
                "severity": "CRITICAL"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-11581",
        "datePublished": "2020-04-06T20:03:38",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Pulse Secure Pulse Connect Secure (PCS) through 2020-04-06. The applet in tncc.jar, executed on macOS, Linux, and Solaris clients when a Host Checker policy is enforced, allows a man-in-the-middle attacker to perform OS command injection attacks (against a client) via shell metacharacters to the doCustomRemediateInstructions method, because Runtime.getRuntime().exec() is used."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-11582",
        "datePublished": "2020-04-06T20:03:20",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Pulse Secure Pulse Connect Secure (PCS) through 2020-04-06. The applet in tncc.jar, executed on macOS, Linux, and Solaris clients when a Host Checker policy is enforced, launches a TCP server that accepts local connections on a random port. This can be reached by local HTTP clients, because up to 25 invalid lines are ignored, and because DNS rebinding can occur. (This server accepts, for example, a setcookie command that might be relevant to CVE-2020-11581 exploitation.)"
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-11614",
        "datePublished": "2020-06-11T16:49:26",
        "description": {
            "lang": "en",
            "value": "Mids' Reborn Hero Designer 2.6.0.7 downloads the update manifest, as well as update files, over cleartext HTTP. Additionally, the application does not perform file integrity validation for files after download. An attacker can perform a man-in-the-middle attack against this connection and replace executable files with malicious versions, which the operating system then executes under the context of the user running Hero Designer."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-11617",
        "datePublished": "2020-08-31T14:20:55",
        "description": {
            "lang": "en",
            "value": "The RSS application on THOMSON THT741FTA 2.2.1 and Philips DTR3502BFTA DVB-T2 2.2.1 set-top boxes doesn't validate the SSL certificates of RSS servers, which allows a man-in-the-middle attacker to modify the data delivered to the client."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-11634",
        "datePublished": "2021-07-15T19:18:48",
        "description": {
            "lang": "en",
            "value": "The Zscaler Client Connector for Windows prior to 2.1.2.105 had a DLL hijacking vulnerability caused due to the configuration of OpenSSL. A local adversary may be able to execute arbitrary code in the SYSTEM context."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-11691",
        "datePublished": "2020-04-22T13:52:41",
        "description": {
            "lang": "en",
            "value": "In JetBrains Hub before 2020.1.12099, content spoofing in the Hub OAuth error message was possible."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-11896",
        "datePublished": "2020-06-17T10:21:31",
        "description": {
            "lang": "en",
            "value": "The Treck TCP/IP stack before 6.0.1.66 allows Remote Code Execution, related to IPv4 tunneling."
        },
        "metrics": [],
        "tags": [
            "tunneling"
        ]
    },
    {
        "cveId": "CVE-2020-11900",
        "datePublished": "2020-06-17T10:30:24",
        "description": {
            "lang": "en",
            "value": "The Treck TCP/IP stack before 6.0.1.41 has an IPv4 tunneling Double Free."
        },
        "metrics": [],
        "tags": [
            "tunneling"
        ]
    },
    {
        "cveId": "CVE-2020-11901",
        "datePublished": "2020-06-17T10:34:01",
        "description": {
            "lang": "en",
            "value": "The Treck TCP/IP stack before 6.0.1.66 allows Remote Code execution via a single invalid DNS response."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-11902",
        "datePublished": "2020-06-17T10:36:19",
        "description": {
            "lang": "en",
            "value": "The Treck TCP/IP stack before 6.0.1.66 has an IPv6OverIPv4 tunneling Out-of-bounds Read."
        },
        "metrics": [],
        "tags": [
            "tunneling"
        ]
    },
    {
        "cveId": "CVE-2020-11957",
        "datePublished": "2020-06-09T18:26:54",
        "description": {
            "lang": "en",
            "value": "The Bluetooth Low Energy implementation in Cypress PSoC Creator BLE 4.2 component versions before 3.64 generates a random number (Pairing Random) with significantly less entropy than the specified 128 bits during BLE pairing. This is the case for both authenticated and unauthenticated pairing with both LE Secure Connections as well as LE Legacy Pairing. A predictable or brute-forceable random number allows an attacker (in radio range) to perform a MITM attack during BLE pairing."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-11985",
        "datePublished": "2020-08-07T15:36:31",
        "description": {
            "lang": "en",
            "value": "IP address spoofing when proxying using mod_remoteip and mod_rewrite For configurations using proxying with mod_remoteip and certain mod_rewrite rules, an attacker could spoof their IP address for logging and PHP scripts. Note this issue was fixed in Apache HTTP Server 2.4.24 but was retrospectively allocated a low severity CVE in 2020."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-12040",
        "datePublished": "2020-06-29T13:45:58",
        "description": {
            "lang": "en",
            "value": "Sigma Spectrum Infusion System v's6.x (model 35700BAX) and Baxter Spectrum Infusion System Version(s) 8.x (model 35700BAX2) at the application layer uses an unauthenticated clear-text communication channel to send and receive system status and operational data. This could allow an attacker that has circumvented network security measures to view sensitive non-private data or to perform a man-in-the-middle attack."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-12105",
        "datePublished": "2020-04-23T16:15:29",
        "description": {
            "lang": "en",
            "value": "OpenConnect through 8.08 mishandles negative return values from X509_check_ function calls, which might assist attackers in performing man-in-the-middle attacks."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-12127",
        "datePublished": "2020-10-02T08:13:20",
        "description": {
            "lang": "en",
            "value": "An information disclosure vulnerability in the /cgi-bin/ExportAllSettings.sh endpoint of the WAVLINK WN530H4 M30H4.V5030.190403 allows an attacker to leak router settings, including cleartext login details, DNS settings, and other sensitive information without authentication."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-12244",
        "datePublished": "2020-05-19T13:51:39",
        "description": {
            "lang": "en",
            "value": "An issue has been found in PowerDNS Recursor 4.1.0 through 4.3.0 where records in the answer section of a NXDOMAIN response lacking an SOA were not properly validated in SyncRes::processAnswer, allowing an attacker to bypass DNSSEC validation."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2020-12431",
        "datePublished": "2020-05-21T16:16:21",
        "description": {
            "lang": "en",
            "value": "A Windows privilege change issue was discovered in Splashtop Software Updater before 1.5.6.16. Insecure permissions on the configuration file and named pipe allow for local privilege escalation to NT AUTHORITY/SYSTEM, by forcing a permission change to any Splashtop files and directories, with resultant DLL hijacking. This product is bundled with Splashtop Streamer (before 3.3.8.0) and Splashtop Business (before 3.3.8.0)."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-12618",
        "datePublished": "2020-08-20T22:48:25",
        "description": {
            "lang": "en",
            "value": "eM Client before 7.2.33412.0 automatically imported S/MIME certificates and thereby silently replaced existing ones. This allowed a man-in-the-middle attacker to obtain an email-validated S/MIME certificate from a trusted CA and replace the public key of the entity to be impersonated. This enabled the attacker to decipher further communication. The entire attack could be accomplished by sending a single email."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-12619",
        "datePublished": "2020-08-20T22:44:46",
        "description": {
            "lang": "en",
            "value": "MailMate before 1.11 automatically imported S/MIME certificates and thereby silently replaced existing ones. This allowed a man-in-the-middle attacker to obtain an email-validated S/MIME certificate from a trusted CA and replace the public key of the entity to be impersonated. This enabled the attacker to decipher further communication. The entire attack could be accomplished by sending a single email."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-12620",
        "datePublished": "2020-07-30T13:03:37",
        "description": {
            "lang": "en",
            "value": "Pi-hole 4.4 allows a user able to write to /etc/pihole/dns-servers.conf to escalate privileges through command injection (shell metacharacters after an IP address)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-12663",
        "datePublished": "2020-05-19T13:48:46",
        "description": {
            "lang": "en",
            "value": "Unbound before 1.10.1 has an infinite loop via malformed DNS answers received from upstream servers."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-12667",
        "datePublished": "2020-05-19T00:00:00",
        "description": {
            "lang": "en",
            "value": "Knot Resolver before 5.1.1 allows traffic amplification via a crafted DNS answer from an attacker-controlled server, aka an \"NXNSAttack\" issue. This is triggered by random subdomains in the NSDNAME in NS records."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-12714",
        "datePublished": "2020-06-11T01:46:15",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in CipherMail Community Gateway Virtual Appliances and Professional/Enterprise Gateway Virtual Appliances versions 1.0.1 through 4.7.1-0 and CipherMail Webmail Messenger Virtual Appliances 1.1.1 through 3.1.1-0. A Diffie-Hellman parameter of insufficient size could allow man-in-the-middle compromise of communications between CipherMail products and external SMTP clients."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-12891",
        "datePublished": "2022-02-04T22:29:12.020774Z",
        "description": {
            "lang": "en",
            "value": "AMD Radeon Software may be vulnerable to DLL Hijacking through path variable. An unprivileged user may be able to drop its malicious DLL file in any location which is in path environment variable."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-13163",
        "datePublished": "2020-05-19T21:22:57",
        "description": {
            "lang": "en",
            "value": "em-imap 0.5 uses the library eventmachine in an insecure way that allows an attacker to perform a man-in-the-middle attack against users of the library. The hostname in a TLS server certificate is not verified."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-13250",
        "datePublished": "2020-06-11T19:16:12",
        "description": {
            "lang": "en",
            "value": "HashiCorp Consul and Consul Enterprise include an HTTP API (introduced in 1.2.0) and DNS (introduced in 1.4.3) caching feature that was vulnerable to denial of service. Fixed in 1.6.6 and 1.7.4."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-13482",
        "datePublished": "2020-05-25T21:49:30",
        "description": {
            "lang": "en",
            "value": "EM-HTTP-Request 1.1.5 uses the library eventmachine in an insecure way that allows an attacker to perform a man-in-the-middle attack against users of the library. The hostname in a TLS server certificate is not verified."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-13529",
        "datePublished": "2021-05-10T15:08:34",
        "description": {
            "lang": "en",
            "value": "An exploitable denial-of-service vulnerability exists in Systemd 245. A specially crafted DHCP FORCERENEW packet can cause a server running the DHCP client to be vulnerable to a DHCP ACK spoofing attack. An attacker can forge a pair of FORCERENEW and DCHP ACK packets to reconfigure the server."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.1,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-13601",
        "datePublished": "2021-05-24T21:40:28.696374Z",
        "description": {
            "lang": "en",
            "value": "Possible read out of bounds in dns read. Zephyr versions >= 1.14.2, >= 2.3.0 contain Out-of-bounds Read (CWE-125). For more information, see https://github.com/zephyrproject-rtos/zephyr/security/advisories/GHSA-mm57-9hqw-qh44"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 9,
                "severity": "CRITICAL"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-13771",
        "datePublished": "2020-11-12T17:13:04",
        "description": {
            "lang": "en",
            "value": "Various components in Ivanti Endpoint Manager through 2020.1.1 rely on Windows search order when loading a (nonexistent) library file, allowing (under certain conditions) one to gain code execution (and elevation of privileges to the level of privilege held by the vulnerable component such as NT AUTHORITY\\SYSTEM) via DLL hijacking. This affects ldiscn32.exe, IpmiRedirectionService.exe, LDAPWhoAmI.exe, and ldprofile.exe."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-13946",
        "datePublished": "2020-09-01T20:49:32",
        "description": {
            "lang": "en",
            "value": "In Apache Cassandra, all versions prior to 2.1.22, 2.2.18, 3.0.22, 3.11.8 and 4.0-beta2, it is possible for a local attacker without access to the Apache Cassandra process or configuration files to manipulate the RMI registry to perform a man-in-the-middle attack and capture user names and passwords used to access the JMX interface. The attacker can then use these credentials to access the JMX interface and perform unauthorised operations. Users should also be aware of CVE-2019-2684, a JRE vulnerability that enables this issue to be exploited remotely."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-13955",
        "datePublished": "2020-10-09T12:33:50",
        "description": {
            "lang": "en",
            "value": "HttpUtils#getURLConnection method disables explicitly hostname verification for HTTPS connections making clients vulnerable to man-in-the-middle attacks. Calcite uses internally this method to connect with Druid and Splunk so information leakage may happen when using the respective Calcite adapters. The method itself is in a utility class so people may use it to create vulnerable HTTPS connections for other applications. From Apache Calcite 1.26 onwards, the hostname verification will be performed using the default JVM truststore."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-13960",
        "datePublished": "2020-06-08T19:26:41",
        "description": {
            "lang": "en",
            "value": "D-Link DSL 2730-U IN_1.10 and IN_1.11 and DIR-600M 3.04 devices have the domain.name string in the DNS resolver search path by default, which allows remote attackers to provide valid DNS responses (and also offer Internet services such as HTTP) for names that otherwise would have had an NXDOMAIN error, by registering a subdomain of the domain.name domain name."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-14002",
        "datePublished": "2020-06-29T00:00:00",
        "description": {
            "lang": "en",
            "value": "PuTTY 0.68 through 0.73 has an Observable Discrepancy leading to an information leak in the algorithm negotiation. This allows man-in-the-middle attackers to target initial connection attempts (where no host key for the server has been cached by the client)."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-14075",
        "datePublished": "2020-06-15T03:36:58",
        "description": {
            "lang": "en",
            "value": "TRENDnet TEW-827DRU devices through 2.06B04 contain multiple command injections in apply.cgi via the action pppoe_connect, ru_pppoe_connect, or dhcp_connect with the key wan_ifname (or wan0_dns), allowing an authenticated user to run arbitrary commands on the device."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-14093",
        "datePublished": "2020-06-15T04:06:04",
        "description": {
            "lang": "en",
            "value": "Mutt before 1.14.3 allows an IMAP fcc/postpone man-in-the-middle attack via a PREAUTH response."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-14102",
        "datePublished": "2021-01-13T22:33:05",
        "description": {
            "lang": "en",
            "value": "There is command injection when ddns processes the hostname, which causes the administrator user to obtain the root privilege of the router. This affects Xiaomi router AX1800rom version < 1.0.336 and Xiaomi route RM1800 root version < 1.0.26."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-14145",
        "datePublished": "2020-06-29T17:33:36",
        "description": {
            "lang": "en",
            "value": "The client side in OpenSSH 5.7 through 8.4 has an Observable Discrepancy leading to an information leak in the algorithm negotiation. This allows man-in-the-middle attackers to target initial connection attempts (where no host key for the server has been cached by the client). NOTE: some reports state that 8.5 and 8.6 are also affected."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-14162",
        "datePublished": "2020-07-30T13:05:32",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Pi-Hole through 5.0. The local www-data user has sudo privileges to execute the pihole core script as root without a password, which could allow an attacker to obtain root access via shell metacharacters to this script's setdns command."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-14168",
        "datePublished": "2020-07-01T01:35:27.144694Z",
        "description": {
            "lang": "en",
            "value": "The email client in Jira Server and Data Center before version 7.13.16, from 8.5.0 before 8.5.7, from 8.8.0 before 8.8.2, and from 8.9.0 before 8.9.1 allows remote attackers to access outgoing emails between a Jira instance and the SMTP server via man-in-the-middle (MITM) vulnerability."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-14171",
        "datePublished": "2020-07-09T17:17:29.210940Z",
        "description": {
            "lang": "en",
            "value": "Atlassian Bitbucket Server from version 4.9.0 before version 7.2.4 allows remote attackers to intercept unencrypted repository import requests via a Man-in-the-Middle (MITM) attack."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-14196",
        "datePublished": "2020-07-01T17:03:04",
        "description": {
            "lang": "en",
            "value": "In PowerDNS Recursor versions up to and including 4.3.1, 4.2.2 and 4.1.16, the ACL restricting access to the internal web server is not properly enforced."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-14312",
        "datePublished": "2021-02-05T23:16:33",
        "description": {
            "lang": "en",
            "value": "A flaw was found in the default configuration of dnsmasq, as shipped with Fedora versions prior to 31 and in all versions Red Hat Enterprise Linux, where it listens on any interface and accepts queries from addresses outside of its local subnet. In particular, the option `local-service` is not enabled. Running dnsmasq in this manner may inadvertently make it an open resolver accessible from any address on the internet. This flaw allows an attacker to conduct a Distributed Denial of Service (DDoS) against other systems."
        },
        "metrics": [],
        "tags": [
            "dns",
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2020-14368",
        "datePublished": "2020-12-14T20:05:10",
        "description": {
            "lang": "en",
            "value": "A flaw was found in Eclipse Che in versions prior to 7.14.0 that impacts CodeReady Workspaces. When configured with cookies authentication, Theia IDE doesn't properly set the SameSite value, allowing a Cross-Site Request Forgery (CSRF) and consequently allowing a cross-site WebSocket hijack on Theia IDE. This flaw allows an attacker to gain full access to the victim's workspace through the /services endpoint. To perform a successful attack, the attacker conducts a Man-in-the-middle attack (MITM) and tricks the victim into executing a request via an untrusted link, which performs the CSRF and the Socket hijack. The highest threat from this vulnerability is to confidentiality, integrity, as well as system availability."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-14383",
        "datePublished": "2020-12-02T00:00:00",
        "description": {
            "lang": "en",
            "value": "A flaw was found in samba's DNS server. An authenticated user could use this flaw to the RPC server to crash. This RPC server, which also serves protocols other than dnsserver, will be restarted after a short delay, but it is easy for an authenticated non administrative attacker to crash it again as soon as it returns. The Samba DNS server itself will continue to operate, but many RPC services will not."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-14387",
        "datePublished": "2021-05-27T19:44:53",
        "description": {
            "lang": "en",
            "value": "A flaw was found in rsync in versions since 3.2.0pre1. Rsync improperly validates certificate with host mismatch vulnerability. A remote, unauthenticated attacker could exploit the flaw by performing a man-in-the-middle attack using a valid certificate for another hostname which could compromise confidentiality and integrity of data transmitted using rsync-ssl. The highest threat from this vulnerability is to data confidentiality and integrity. This flaw affects rsync versions before 3.2.4."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-14954",
        "datePublished": "2020-06-21T16:55:41",
        "description": {
            "lang": "en",
            "value": "Mutt before 1.14.4 and NeoMutt before 2020-06-19 have a STARTTLS buffering issue that affects IMAP, SMTP, and POP3. When a server sends a \"begin TLS\" response, the client reads additional data (e.g., from a man-in-the-middle attacker) and evaluates it in a TLS context, aka \"response injection.\""
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-14971",
        "datePublished": "2020-06-23T13:41:31",
        "description": {
            "lang": "en",
            "value": "Pi-hole through 5.0 allows code injection in piholedhcp (the Static DHCP Leases section) by modifying Teleporter backup files and then restoring them. This occurs in settings.php. To exploit this, an attacker would request a backup of limited files via teleporter.php. These are placed into a .tar.gz archive. The attacker then modifies the host parameter in dnsmasq.d files, and then compresses and uploads these files again."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-15047",
        "datePublished": "2020-06-25T10:49:09",
        "description": {
            "lang": "en",
            "value": "MSA/SMTP.cpp in Trojita before 0.8 ignores certificate-verification errors, which allows man-in-the-middle attackers to spoof SMTP servers."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-15104",
        "datePublished": "2020-07-14T22:05:14",
        "description": {
            "lang": "en",
            "value": "In Envoy before versions 1.12.6, 1.13.4, 1.14.4, and 1.15.0 when validating TLS certificates, Envoy would incorrectly allow a wildcard DNS Subject Alternative Name apply to multiple subdomains. For example, with a SAN of *.example.com, Envoy would incorrectly allow nested.subdomain.example.com, when it should only allow subdomain.example.com. This defect applies to both validating a client TLS certificate in mTLS, and validating a server TLS certificate for upstream connections. This vulnerability is only applicable to situations where an untrusted entity can obtain a signed wildcard TLS certificate for a domain of which you only intend to trust a subdomain of. For example, if you intend to trust api.mysubdomain.example.com, and an untrusted actor can obtain a signed TLS certificate for *.example.com or *.com. Configurations are vulnerable if they use verify_subject_alt_name in any Envoy version, or if they use match_subject_alt_names in version 1.14 or later. This issue has been fixed in Envoy versions 1.12.6, 1.13.4, 1.14.4, 1.15.0."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4.6,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-15129",
        "datePublished": "2020-07-30T15:20:15",
        "description": {
            "lang": "en",
            "value": "In Traefik before versions 1.7.26, 2.2.8, and 2.3.0-rc3, there exists a potential open redirect vulnerability in Traefik's handling of the \"X-Forwarded-Prefix\" header. The Traefik API dashboard component doesn't validate that the value of the header \"X-Forwarded-Prefix\" is a site relative path and will redirect to any header provided URI. Successful exploitation of an open redirect can be used to entice victims to disclose sensitive information. Active Exploitation of this issue is unlikely as it would require active header injection, however the Traefik team addressed this issue nonetheless to prevent abuse in e.g. cache poisoning scenarios."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.1,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-15133",
        "datePublished": "2020-07-31T17:40:21",
        "description": {
            "lang": "en",
            "value": "In faye-websocket before version 0.11.0, there is a lack of certification validation in TLS handshakes. The `Faye::WebSocket::Client` class uses the `EM::Connection#start_tls` method in EventMachine to implement the TLS handshake whenever a `wss:` URL is used for the connection. This method does not implement certificate verification by default, meaning that it does not check that the server presents a valid and trusted TLS certificate for the expected hostname. That means that any `wss:` connection made using this library is vulnerable to a man-in-the-middle attack, since it does not confirm the identity of the server it is connected to. For further background information on this issue, please see the referenced GitHub Advisory. Upgrading `faye-websocket` to v0.11.0 is recommended."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-15134",
        "datePublished": "2020-07-31T17:40:15",
        "description": {
            "lang": "en",
            "value": "Faye before version 1.4.0, there is a lack of certification validation in TLS handshakes. Faye uses em-http-request and faye-websocket in the Ruby version of its client. Those libraries both use the `EM::Connection#start_tls` method in EventMachine to implement the TLS handshake whenever a `wss:` URL is used for the connection. This method does not implement certificate verification by default, meaning that it does not check that the server presents a valid and trusted TLS certificate for the expected hostname. That means that any `https:` or `wss:` connection made using these libraries is vulnerable to a man-in-the-middle attack, since it does not confirm the identity of the server it is connected to. The first request a Faye client makes is always sent via normal HTTP, but later messages may be sent via WebSocket. Therefore it is vulnerable to the same problem that these underlying libraries are, and we needed both libraries to support TLS verification before Faye could claim to do the same. Your client would still be insecure if its initial HTTPS request was verified, but later WebSocket connections were not. This is fixed in Faye v1.4.0, which enables verification by default. For further background information on this issue, please see the referenced GitHub Advisory."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-15136",
        "datePublished": "2020-08-06T22:45:14",
        "description": {
            "lang": "en",
            "value": "In ectd before versions 3.4.10 and 3.3.23, gateway TLS authentication is only applied to endpoints detected in DNS SRV records. When starting a gateway, TLS authentication will only be attempted on endpoints identified in DNS SRV records for a given domain, which occurs in the discoverEndpoints function. No authentication is performed against endpoints provided in the --endpoints flag. This has been fixed in versions 3.4.10 and 3.3.23 with improved documentation and deprecation of the functionality."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-15145",
        "datePublished": "2020-08-14T16:35:13",
        "description": {
            "lang": "en",
            "value": "In Composer-Setup for Windows before version 6.0.0, if the developer's computer is shared with other users, a local attacker may be able to exploit the following scenarios. 1. A local regular user may modify the existing `C:\\ProgramData\\ComposerSetup\\bin\\composer.bat` in order to get elevated command execution when composer is run by an administrator. 2. A local regular user may create a specially crafted dll in the `C:\\ProgramData\\ComposerSetup\\bin` folder in order to get Local System privileges. See: https://itm4n.github.io/windows-server-netman-dll-hijacking. 3. If the directory of the php.exe selected by the user is not in the system path, it is added without checking that it is admin secured, as per Microsoft guidelines. See: https://msrc-blog.microsoft.com/2018/04/04/triaging-a-dll-planting-vulnerability."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.7,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-15185",
        "datePublished": "2020-09-17T21:30:13",
        "description": {
            "lang": "en",
            "value": "In Helm before versions 2.16.11 and 3.3.2, a Helm repository can contain duplicates of the same chart, with the last one always used. If a repository is compromised, this lowers the level of access that an attacker needs to inject a bad chart into a repository. To perform this attack, an attacker must have write access to the index file (which can occur during a MITM attack on a non-SSL connection). This issue has been patched in Helm 3.3.2 and 2.16.11. A possible workaround is to manually review the index file in the Helm repository cache before installing software."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 2.2,
                "severity": "LOW"
            }
        ],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-15186",
        "datePublished": "2020-09-17T21:40:13",
        "description": {
            "lang": "en",
            "value": "In Helm before versions 2.16.11 and 3.3.2 plugin names are not sanitized properly. As a result, a malicious plugin author could use characters in a plugin name that would result in unexpected behavior, such as duplicating the name of another plugin or spoofing the output to `helm --help`. This issue has been patched in Helm 3.3.2. A possible workaround is to not install untrusted Helm plugins. Examine the `name` field in the `plugin.yaml` file for a plugin, looking for characters outside of the [a-zA-Z0-9._-] range."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 3.4,
                "severity": "LOW"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-15187",
        "datePublished": "2020-09-17T21:50:12",
        "description": {
            "lang": "en",
            "value": "In Helm before versions 2.16.11 and 3.3.2, a Helm plugin can contain duplicates of the same entry, with the last one always used. If a plugin is compromised, this lowers the level of access that an attacker needs to modify a plugin's install hooks, causing a local execution attack. To perform this attack, an attacker must have write access to the git repository or plugin archive (.tgz) while being downloaded (which can occur during a MITM attack on a non-SSL connection). This issue has been patched in Helm 2.16.11 and Helm 3.3.2. As a possible workaround make sure to install plugins using a secure connection protocol like SSL."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 3,
                "severity": "LOW"
            }
        ],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-15260",
        "datePublished": "2021-03-10T22:30:16",
        "description": {
            "lang": "en",
            "value": "PJSIP is a free and open source multimedia communication library written in C language implementing standard based protocols such as SIP, SDP, RTP, STUN, TURN, and ICE. In version 2.10 and earlier, PJSIP transport can be reused if they have the same IP address + port + protocol. However, this is insufficient for secure transport since it lacks remote hostname authentication. Suppose we have created a TLS connection to `sip.foo.com`, which has an IP address `100.1.1.1`. If we want to create a TLS connection to another hostname, say `sip.bar.com`, which has the same IP address, then it will reuse that existing connection, even though `100.1.1.1` does not have certificate to authenticate as `sip.bar.com`. The vulnerability allows for an insecure interaction without user awareness. It affects users who need access to connections to different destinations that translate to the same address, and allows man-in-the-middle attack if attacker can route a connection to another destination such as in the case of DNS spoofing."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns",
            "Man-in-the-middle",
            "dns spoofing",
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-15387",
        "datePublished": "2021-06-09T15:24:45",
        "description": {
            "lang": "en",
            "value": "The host SSH servers of Brocade Fabric OS before Brocade Fabric OS v7.4.2h, v8.2.1c, v8.2.2, v9.0.0, and Brocade SANnav before v2.1.1 utilize keys of less than 2048 bits, which may be vulnerable to man-in-the-middle attacks and/or insecure SSH communications."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-15474",
        "datePublished": "2020-07-01T10:54:08",
        "description": {
            "lang": "en",
            "value": "In nDPI through 3.2, there is a stack overflow in extractRDNSequence in lib/protocols/tls.c."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-15486",
        "datePublished": "2020-08-26T15:14:59",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on Dr Trust ECG Pen 2.00.08 devices. Because the Bluetooth LE support is implemented without a requirement for pairing or security, any attacker can access the GATT server of the device and can sniff the data being broadcasted while a measurement is being done. Also, saved data can also be extracted over a Bluetooth connection. In addition, an attacker can launch a man-in-the-middle attack against data integrity."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-15526",
        "datePublished": "2020-07-09T16:40:52",
        "description": {
            "lang": "en",
            "value": "In Redgate SQL Monitor 7.1.4 through 10.1.6 (inclusive), the scope for disabling some TLS security certificate checks can extend beyond that defined by various options on the Configuration > Notifications pages to disable certificate checking for alert notifications. These TLS security checks are also ignored during monitoring of VMware machines. This would make SQL Monitor vulnerable to potential man-in-the-middle attacks when sending alert notification emails, posting to Slack or posting to webhooks. The vulnerability is fixed in version 10.1.7."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-15589",
        "datePublished": "2020-10-02T19:13:23",
        "description": {
            "lang": "en",
            "value": "A design issue was discovered in GetInternetRequestHandle, InternetSendRequestEx and InternetSendRequestByBitrate in the client side of Zoho ManageEngine Desktop Central 10.0.552.W and Remote Access Plus before 10.1.2119.1. By exploiting this issue, an attacker-controlled server can force the client to skip TLS certificate validation, leading to a man-in-the-middle attack against HTTPS and unauthenticated remote code execution."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-15682",
        "datePublished": "2020-10-22T20:32:25",
        "description": {
            "lang": "en",
            "value": "When a link to an external protocol was clicked, a prompt was presented that allowed the user to choose what application to open it in. An attacker could induce that prompt to be associated with an origin they didn't control, resulting in a spoofing attack. This was fixed by changing external protocol prompts to be tab-modal while also ensuring they could not be incorrectly associated with a different origin. This vulnerability affects Firefox < 82."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-15722",
        "datePublished": "2020-07-21T17:10:21",
        "description": {
            "lang": "en",
            "value": "In version 12.1.0.1004 and below of 360 Total Security,when TPI calls the browser process, there exists a local privilege escalation vulnerability. An attacker who could exploit DLL hijacking could execute arbitrary code on the Local system."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-15723",
        "datePublished": "2020-07-21T17:04:50",
        "description": {
            "lang": "en",
            "value": "In the version 12.1.0.1004 and below of 360 Total Security, when the main process of 360 Total Security calls GameChrome.exe, there exists a local privilege escalation vulnerability. An attacker who could exploit DLL hijacking to bypass the hips could execute arbitrary code on the Local system."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-15724",
        "datePublished": "2020-07-21T17:36:16",
        "description": {
            "lang": "en",
            "value": "In the version 12.1.0.1005 and below of 360 Total Security, when the Gamefolde calls GameChrome.exe, there exists a local privilege escalation vulnerability. An attacker who could exploit DLL hijacking to bypass the hips could execute arbitrary code on the Local system."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-15767",
        "datePublished": "2020-09-18T13:44:06",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Gradle Enterprise before 2020.2.5. The cookie used to convey the CSRF prevention token is not annotated with the “secure” attribute, which allows an attacker with the ability to MITM plain HTTP requests to obtain it, if the user mistakenly uses a HTTP instead of HTTPS address to access the server. This cookie value could then be used to perform CSRF."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-15795",
        "datePublished": "2021-04-22T20:42:19",
        "description": {
            "lang": "en",
            "value": "A vulnerability has been identified in APOGEE PXC Compact (BACnet) (All versions < V3.5.5), APOGEE PXC Compact (P2 Ethernet) (All versions < V2.8.20), APOGEE PXC Modular (BACnet) (All versions < V3.5.5), APOGEE PXC Modular (P2 Ethernet) (All versions < V2.8.20), Nucleus NET (All versions < V5.2), Nucleus Source Code (Versions including affected DNS modules), TALON TC Compact (BACnet) (All versions < V3.5.5), TALON TC Modular (BACnet) (All versions < V3.5.5). The DNS domain name label parsing functionality does not properly validate the names in DNS-responses. The parsing of malformed responses could result in a write past the end of an allocated structure. An attacker with a privileged position in the network could leverage this vulnerability to execute code in the context of the current process or cause a denial-of-service condition."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.1,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-15802",
        "datePublished": "2020-09-11T13:07:22",
        "description": {
            "lang": "en",
            "value": "Devices supporting Bluetooth before 5.1 may allow man-in-the-middle attacks, aka BLURtooth. Cross Transport Key Derivation in Bluetooth Core Specification v4.2 and v5.0 may permit an unauthenticated user to establish a bonding with one transport, either LE or BR/EDR, and replace a bonding already established on the opposing transport, BR/EDR or LE, potentially overwriting an authenticated key with an unauthenticated key, or a key with greater entropy with one with less."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-15810",
        "datePublished": "2020-09-02T16:34:04",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Squid before 4.13 and 5.x before 5.0.4. Due to incorrect data validation, HTTP Request Smuggling attacks may succeed against HTTP and HTTPS traffic. This leads to cache poisoning. This allows any client, including browser scripts, to bypass local security and poison the proxy cache and any downstream caches with content from an arbitrary source. When configured for relaxed header parsing (the default), Squid relays headers containing whitespace characters to upstream servers. When this occurs as a prefix to a Content-Length header, the frame length specified will be ignored by Squid (allowing for a conflicting length to be used from another Content-Length header) but relayed upstream."
        },
        "metrics": [],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-15811",
        "datePublished": "2020-09-02T16:35:04",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Squid before 4.13 and 5.x before 5.0.4. Due to incorrect data validation, HTTP Request Splitting attacks may succeed against HTTP and HTTPS traffic. This leads to cache poisoning. This allows any client, including browser scripts, to bypass local security and poison the browser cache and any downstream caches with content from an arbitrary source. Squid uses a string search instead of parsing the Transfer-Encoding header to find chunked encoding. This allows an attacker to hide a second request inside Transfer-Encoding: it is interpreted by Squid as chunked and split out into a second request delivered upstream. Squid will then deliver two distinct responses to the client, corrupting any downstream caches."
        },
        "metrics": [],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-15842",
        "datePublished": "2020-07-20T01:06:54",
        "description": {
            "lang": "en",
            "value": "Liferay Portal before 7.3.0, and Liferay DXP 7.0 before fix pack 90, 7.1 before fix pack 17, and 7.2 before fix pack 5, allows man-in-the-middle attackers to execute arbitrary code via crafted serialized payloads, because of insecure deserialization."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.1,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-15909",
        "datePublished": "2020-10-19T12:57:26",
        "description": {
            "lang": "en",
            "value": "SolarWinds N-central through 2020.1 allows session hijacking and requires user interaction or physical access. The N-Central JSESSIONID cookie attribute is not checked against multiple sources such as sourceip, MFA claim, etc. as long as the victim stays logged in within N-Central. To take advantage of this, cookie could be stolen and the JSESSIONID can be captured. On its own this is not a surprising result; low security tools allow the cookie to roam from machine to machine. The JSESSION cookie can then be used on the attackers’ workstation by browsing to the victim’s NCentral server URL and replacing the JSESSIONID attribute value by the captured value. Expected behavior would be to check this against a second source and enforce at least a reauthentication or multi factor request as N-Central is a highly privileged service."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-15955",
        "datePublished": "2021-08-17T17:12:09",
        "description": {
            "lang": "en",
            "value": "In s/qmail through 4.0.07, an active MitM can inject arbitrary plaintext commands into a STARTTLS encrypted session between an SMTP client and s/qmail. This allows e-mail messages and user credentials to be sent to the MitM attacker."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-16143",
        "datePublished": "2020-07-29T21:48:49",
        "description": {
            "lang": "en",
            "value": "The seafile-client client 7.0.8 for Seafile is vulnerable to DLL hijacking because it loads exchndl.dll from the current working directory."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-16630",
        "datePublished": "2021-09-20T19:20:50",
        "description": {
            "lang": "en",
            "value": "TI’s BLE stack caches and reuses the LTK’s property for a bonded mobile. A LTK can be an unauthenticated-and-no-MITM-protection key created by Just Works or an authenticated-and-MITM-protection key created by Passkey Entry, Numeric Comparison or OOB. Assume that a victim mobile uses secure pairing to pair with a victim BLE device based on TI chips and generate an authenticated-and-MITM-protection LTK. If a fake mobile with the victim mobile’s MAC address uses Just Works and pairs with the victim device, the generated LTK still has the property of authenticated-and-MITM-protection. Therefore, the fake mobile can access attributes with the authenticated read/write permission."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-16873",
        "datePublished": "2020-09-11T17:08:46",
        "description": {
            "lang": "en",
            "value": "<p>A spoofing vulnerability manifests in Microsoft Xamarin.Forms due to the default settings on Android WebView version prior to 83.0.4103.106. This vulnerability could allow an attacker to execute arbitrary Javascript code on a target system.</p>\n<p>For the attack to be successful, the targeted user would need to browse to a malicious website or a website serving the malicious code through Xamarin.Forms.</p>\n<p>The security update addresses this vulnerability by preventing the malicious Javascript from running in the WebView.</p>\n"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4.7,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-16922",
        "datePublished": "2020-10-16T22:17:50",
        "description": {
            "lang": "en",
            "value": "<p>A spoofing vulnerability exists when Windows incorrectly validates file signatures. An attacker who successfully exploited this vulnerability could bypass security features and load improperly signed files.</p>\n<p>In an attack scenario, an attacker could bypass security features intended to prevent improperly signed files from being loaded.</p>\n<p>The update addresses the vulnerability by correcting how Windows validates file signatures.</p>\n"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-17015",
        "datePublished": "2020-11-11T06:48:04",
        "description": {
            "lang": "en",
            "value": "Microsoft SharePoint Server Spoofing Vulnerability"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-17016",
        "datePublished": "2020-11-11T06:48:04",
        "description": {
            "lang": "en",
            "value": "Microsoft SharePoint Server Spoofing Vulnerability"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-17060",
        "datePublished": "2020-11-11T06:48:22",
        "description": {
            "lang": "en",
            "value": "Microsoft SharePoint Server Spoofing Vulnerability"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-17063",
        "datePublished": "2020-11-11T06:48:23",
        "description": {
            "lang": "en",
            "value": "Microsoft Office Online Spoofing Vulnerability"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-17115",
        "datePublished": "2020-12-09T23:36:43",
        "description": {
            "lang": "en",
            "value": "Microsoft SharePoint Server Spoofing Vulnerability"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-17135",
        "datePublished": "2020-12-09T23:36:51",
        "description": {
            "lang": "en",
            "value": "Azure DevOps Server Spoofing Vulnerability"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-17145",
        "datePublished": "2020-12-09T23:36:56",
        "description": {
            "lang": "en",
            "value": "Azure DevOps Server and Team Foundation Services Spoofing Vulnerability"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-17153",
        "datePublished": "2020-12-09T23:36:58",
        "description": {
            "lang": "en",
            "value": "Microsoft Edge for Android Spoofing Vulnerability"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-17439",
        "datePublished": "2020-12-11T22:26:47",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in uIP 1.0, as used in Contiki 3.0 and other products. The code that parses incoming DNS packets does not validate that the incoming DNS replies match outgoing DNS queries in newdata() in resolv.c. Also, arbitrary DNS replies are parsed if there was any outgoing DNS query with a transaction ID that matches the transaction ID of an incoming reply. Provided that the default DNS cache is quite small (only four records) and that the transaction ID has a very limited set of values that is quite easy to guess, this can lead to DNS cache poisoning."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dns cache poisoning",
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-17440",
        "datePublished": "2020-12-11T22:27:58",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in uIP 1.0, as used in Contiki 3.0 and other products. The code that parses incoming DNS packets does not validate that domain names present in the DNS responses have '\\0' termination. This results in errors when calculating the offset of the pointer that jumps over domain name bytes in DNS response packets when a name lacks this termination, and eventually leads to dereferencing the pointer at an invalid/arbitrary address, within newdata() and parse_name() in resolv.c."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-17467",
        "datePublished": "2020-12-11T22:36:31",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in FNET through 4.6.4. The code for processing the hostname from an LLMNR request doesn't check for '\\0' termination. Therefore, the deduced length of the hostname doesn't reflect the correct length of the actual data. This may lead to Information Disclosure in _fnet_llmnr_poll in fnet_llmnr.c during a response to a malicious request of the DNS class IN."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-17470",
        "datePublished": "2020-12-11T22:40:55",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in FNET through 4.6.4. The code that initializes the DNS client interface structure does not set sufficiently random transaction IDs (they are always set to 1 in _fnet_dns_poll in fnet_dns.c). This significantly simplifies DNS cache poisoning attacks."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dns cache poisoning",
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-17482",
        "datePublished": "2020-10-02T08:21:09",
        "description": {
            "lang": "en",
            "value": "An issue has been found in PowerDNS Authoritative Server before 4.3.1 where an authorized user with the ability to insert crafted records into a zone might be able to leak the content of uninitialized memory."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-17509",
        "datePublished": "2021-01-11T09:40:20",
        "description": {
            "lang": "en",
            "value": "ATS negative cache option is vulnerable to a cache poisoning attack. If you have this option enabled, please upgrade or disable this feature. Apache Traffic Server versions 7.0.0 to 7.1.11 and 8.0.0 to 8.1.0 are affected."
        },
        "metrics": [],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-19860",
        "datePublished": "2022-01-21T13:40:44",
        "description": {
            "lang": "en",
            "value": "When ldns version 1.7.1 verifies a zone file, the ldns_rr_new_frm_str_internal function has a heap out of bounds read vulnerability. An attacker can leak information on the heap by constructing a zone file payload."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-19861",
        "datePublished": "2022-01-21T14:22:16",
        "description": {
            "lang": "en",
            "value": "When a zone file in ldns 1.7.1 is parsed, the function ldns_nsec3_salt_data is too trusted for the length value obtained from the zone file. When the memcpy is copied, the 0xfe - ldns_rdf_size(salt_rdf) byte data can be copied, causing heap overflow information leakage."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-1013",
        "datePublished": "2020-09-11T17:08:51",
        "description": {
            "lang": "en",
            "value": "<p>An elevation of privilege vulnerability exists when Microsoft Windows processes group policy updates. An attacker who successfully exploited this vulnerability could potentially escalate permissions or perform additional privileged actions on the target machine.</p>\n<p>To exploit this vulnerability, an attacker would need to launch a man-in-the-middle (MiTM) attack against the traffic passing between a domain controller and the target machine. An attacker could then create a group policy to grant administrator rights to a standard user.</p>\n<p>The security update addresses the vulnerability by enforcing Kerberos authentication for certain calls over LDAP.</p>\n"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-1059",
        "datePublished": "2020-05-21T22:52:52",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft Edge does not properly parse HTTP content, aka 'Microsoft Edge Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1104",
        "datePublished": "2020-05-21T22:53:08",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server, aka 'Microsoft SharePoint Spoofing Vulnerability'. This CVE ID is unique from CVE-2020-1105, CVE-2020-1107."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1105",
        "datePublished": "2020-05-21T22:53:09",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server, aka 'Microsoft SharePoint Spoofing Vulnerability'. This CVE ID is unique from CVE-2020-1104, CVE-2020-1107."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1107",
        "datePublished": "2020-05-21T22:53:09",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server, aka 'Microsoft SharePoint Spoofing Vulnerability'. This CVE ID is unique from CVE-2020-1104, CVE-2020-1105."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1148",
        "datePublished": "2020-06-09T19:43:16",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server, aka 'Microsoft SharePoint Spoofing Vulnerability'. This CVE ID is unique from CVE-2020-1289."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1173",
        "datePublished": "2020-05-21T22:53:30",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in Microsoft Power BI Report Server in the way it validates the content-type of uploaded attachments, aka 'Microsoft Power BI Report Server Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1205",
        "datePublished": "2020-09-11T17:09:07",
        "description": {
            "lang": "en",
            "value": "<p>A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server. An authenticated attacker could exploit the vulnerability by sending a specially crafted request to an affected SharePoint server.</p>\n<p>The attacker who successfully exploited the vulnerability could then perform cross-site scripting attacks on affected systems and run script in the security context of the current user. These attacks could allow the attacker to read content that the attacker is not authorized to read, use the victim's identity to take actions on the SharePoint site on behalf of the user, such as change permissions and delete content, and inject malicious content in the browser of the user.</p>\n<p>The security update addresses the vulnerability by helping to ensure that SharePoint Server properly sanitizes web requests.</p>\n"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4.6,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1220",
        "datePublished": "2020-06-09T19:43:29",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when theMicrosoft Edge (Chromium-based) in IE Mode improperly handles specific redirects, aka 'Microsoft Edge (Chromium-based) in IE Mode Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1228",
        "datePublished": "2020-09-11T17:09:09",
        "description": {
            "lang": "en",
            "value": "<p>A denial of service vulnerability exists in Windows DNS when it fails to properly handle queries. An attacker who successfully exploited this vulnerability could cause the DNS service to become nonresponsive.</p>\n<p>To exploit the vulnerability, an authenticated attacker could send malicious DNS queries to a target, resulting in a denial of service.</p>\n<p>The update addresses the vulnerability by correcting how Windows DNS processes queries.</p>\n"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-1289",
        "datePublished": "2020-06-09T19:43:54",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server, aka 'Microsoft SharePoint Spoofing Vulnerability'. This CVE ID is unique from CVE-2020-1148."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1323",
        "datePublished": "2020-06-09T19:44:09",
        "description": {
            "lang": "en",
            "value": "An open redirect vulnerability exists in Microsoft SharePoint that could lead to spoofing.To exploit the vulnerability, an attacker could send a link that has a specially crafted URL and convince the user to click the link, aka 'SharePoint Open Redirect Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1325",
        "datePublished": "2020-11-11T06:48:40",
        "description": {
            "lang": "en",
            "value": "Azure DevOps Server and Team Foundation Services Spoofing Vulnerability"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1327",
        "datePublished": "2020-06-09T19:44:10",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists in Microsoft Azure DevOps Server when it fails to properly handle web requests, aka 'Azure DevOps Server HTML Injection Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1329",
        "datePublished": "2020-06-09T19:44:10",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft Bing Search for Android improperly handles specific HTML content, aka 'Microsoft Bing Search Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1331",
        "datePublished": "2020-06-09T19:44:11",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when System Center Operations Manager (SCOM) does not properly sanitize a specially crafted web request to an affected SCOM instance, aka 'System Center Operations Manager Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1340",
        "datePublished": "2020-06-09T19:44:12",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when the NuGetGallery does not properly sanitize input on package metadata values, aka 'NuGetGallery Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1350",
        "datePublished": "2020-07-14T22:54:06",
        "description": {
            "lang": "en",
            "value": "A remote code execution vulnerability exists in Windows Domain Name System servers when they fail to properly handle requests, aka 'Windows DNS Server Remote Code Execution Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-1442",
        "datePublished": "2020-07-14T22:54:44",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when an Office Web Apps server does not properly sanitize a specially crafted request, aka 'Office Web Apps XSS Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1443",
        "datePublished": "2020-07-14T22:54:45",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server, aka 'Microsoft SharePoint Spoofing Vulnerability'."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1464",
        "datePublished": "2020-08-17T19:13:03",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Windows incorrectly validates file signatures. An attacker who successfully exploited this vulnerability could bypass security features and load improperly signed files.\nIn an attack scenario, an attacker could bypass security features intended to prevent improperly signed files from being loaded.\nThe update addresses the vulnerability by correcting how Windows validates file signatures.\n"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1499",
        "datePublished": "2020-08-17T19:13:16",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server. An authenticated attacker could exploit the vulnerability by sending a specially crafted request to an affected SharePoint server.\nThe attacker who successfully exploited the vulnerability could then perform cross-site scripting attacks on affected systems and run script in the security context of the current user. These attacks could allow the attacker to read content that the attacker is not authorized to read, use the victim's identity to take actions on the SharePoint site on behalf of the user, such as change permissions and delete content, and inject malicious content in the browser of the user.\nThe security update addresses the vulnerability by helping to ensure that SharePoint Server properly sanitizes web requests.\n"
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1500",
        "datePublished": "2020-08-17T19:13:16",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server. An authenticated attacker could exploit the vulnerability by sending a specially crafted request to an affected SharePoint server.\nThe attacker who successfully exploited the vulnerability could then perform cross-site scripting attacks on affected systems and run script in the security context of the current user. These attacks could allow the attacker to read content that the attacker is not authorized to read, use the victim's identity to take actions on the SharePoint site on behalf of the user, such as change permissions and delete content, and inject malicious content in the browser of the user.\nThe security update addresses the vulnerability by helping to ensure that SharePoint Server properly sanitizes web requests.\n"
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1501",
        "datePublished": "2020-08-17T19:13:17",
        "description": {
            "lang": "en",
            "value": "A spoofing vulnerability exists when Microsoft SharePoint Server does not properly sanitize a specially crafted web request to an affected SharePoint server. An authenticated attacker could exploit the vulnerability by sending a specially crafted request to an affected SharePoint server.\nThe attacker who successfully exploited the vulnerability could then perform cross-site scripting attacks on affected systems and run script in the security context of the current user. These attacks could allow the attacker to read content that the attacker is not authorized to read, use the victim's identity to take actions on the SharePoint site on behalf of the user, such as change permissions and delete content, and inject malicious content in the browser of the user.\nThe security update addresses the vulnerability by helping to ensure that SharePoint Server properly sanitizes web requests.\n"
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1584",
        "datePublished": "2020-08-17T19:13:51",
        "description": {
            "lang": "en",
            "value": "An elevation of privilege vulnerability exists in the way that the dnsrslvr.dll handles objects in memory. An attacker who successfully exploited the vulnerability could execute code with elevated permissions.\nTo exploit the vulnerability, a locally authenticated attacker could run a specially crafted application.\nThe security update addresses the vulnerability by ensuring the dnsrslvr.dll properly handles objects in memory.\n"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-1596",
        "datePublished": "2020-09-11T17:09:27",
        "description": {
            "lang": "en",
            "value": "<p>A information disclosure vulnerability exists when TLS components use weak hash algorithms. An attacker who successfully exploited this vulnerability could obtain information to further compromise a users's encrypted transmission channel.</p>\n<p>To exploit the vulnerability, an attacker would have to conduct a man-in-the-middle attack.</p>\n<p>The update addresses the vulnerability by correcting how TLS components use hash algorithms.</p>\n"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-1599",
        "datePublished": "2020-11-11T06:48:40",
        "description": {
            "lang": "en",
            "value": "Windows Spoofing Vulnerability"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1645",
        "datePublished": "2020-07-17T18:40:40.891125Z",
        "description": {
            "lang": "en",
            "value": "When DNS filtering is enabled on Juniper Networks Junos MX Series with one of the following cards MS-PIC, MS-MIC or MS-MPC, an incoming stream of packets processed by the Multiservices PIC Management Daemon (mspmand) process, responsible for managing \"URL Filtering service\", may crash, causing the Services PIC to restart. While the Services PIC is restarting, all PIC services including DNS filtering service (DNS sink holing) will be bypassed until the Services PIC completes its boot process. If the issue occurs, system core-dumps output will show a crash of mspmand process: root@device> show system core-dumps -rw-rw---- 1 nobody wheel 575685123 <Date> /var/tmp/pics/mspmand.core.<*>.gz This issue affects Juniper Networks Junos OS: 17.3 versions prior to 17.3R3-S8; 18.3 versions prior to 18.3R2-S4, 18.3R3-S1; 18.4 versions prior to 18.4R2-S5, 18.4R3; 19.1 versions prior to 19.1R2-S2, 19.1R3; 19.2 versions prior to 19.2R1-S5, 19.2R2; 19.3 versions prior to 19.3R2-S3, 19.3R3; 19.4 versions prior to 19.4R1-S3, 19.4R2. This issue does not affect Juniper Networks Junos OS releases prior to 17.3R2."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.3,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-1660",
        "datePublished": "2020-10-16T20:31:26.000354Z",
        "description": {
            "lang": "en",
            "value": "When DNS filtering is enabled on Juniper Networks Junos MX Series with one of the following cards MS-PIC, MS-MIC or MS-MPC, an incoming stream of packets processed by the Multiservices PIC Management Daemon (mspmand) process, responsible for managing \"URL Filtering service\", may crash, causing the Services PIC to restart. While the Services PIC is restarting, all PIC services including DNS filtering service (DNS sink holing) will be bypassed until the Services PIC completes its boot process. This vulnerability might allow an attacker to cause an extended Denial of Service (DoS) attack against the device and to cause clients to be vulnerable to DNS based attacks by malicious DNS servers when they send DNS requests through the device. As a result, devices which were once protected by the DNS Filtering service are no longer protected and at risk of exploitation. This issue affects Juniper Networks Junos OS: 17.3 versions prior to 17.3R3-S8; 18.3 versions prior to 18.3R3-S1; 18.4 versions prior to 18.4R3; 19.1 versions prior to 19.1R3; 19.2 versions prior to 19.2R2; 19.3 versions prior to 19.3R3. This issue does not affect Juniper Networks Junos OS 17.4, 18.1, and 18.2."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.3,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-1665",
        "datePublished": "2020-10-16T20:31:27.772752Z",
        "description": {
            "lang": "en",
            "value": "On Juniper Networks MX Series and EX9200 Series, in a certain condition the IPv6 Distributed Denial of Service (DDoS) protection might not take affect when it reaches the threshold condition. The DDoS protection allows the device to continue to function while it is under DDoS attack, protecting both the Routing Engine (RE) and the Flexible PIC Concentrator (FPC) during the DDoS attack. When this issue occurs, the RE and/or the FPC can become overwhelmed, which could disrupt network protocol operations and/or interrupt traffic. This issue does not affect IPv4 DDoS protection. This issue affects MX Series and EX9200 Series with Trio-based PFEs (Packet Forwarding Engines). Please refer to https://kb.juniper.net/KB25385 for the list of Trio-based PFEs. This issue affects Juniper Networks Junos OS on MX series and EX9200 Series: 17.2 versions prior to 17.2R3-S4; 17.2X75 versions prior to 17.2X75-D102, 17.2X75-D110; 17.3 versions prior to 17.3R3-S8; 17.4 versions prior to 17.4R2-S11, 17.4R3-S2; 18.2 versions prior to 18.2R2-S7, 18.2R3, 18.2R3-S3; 18.2X75 versions prior to 18.2X75-D30; 18.3 versions prior to 18.3R2-S4, 18.3R3-S2."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2020-1667",
        "datePublished": "2020-10-16T20:31:28.699294Z",
        "description": {
            "lang": "en",
            "value": "When DNS filtering is enabled on Juniper Networks Junos MX Series with one of the following cards MS-PIC, MS-MIC or MS-MPC, an incoming stream of packets processed by the Multiservices PIC Management Daemon (mspmand) process might be bypassed due to a race condition. Due to this vulnerability, mspmand process, responsible for managing \"URL Filtering service\", can crash, causing the Services PIC to restart. While the Services PIC is restarting, all PIC services including DNS filtering service (DNS sink holing) will be bypassed until the Services PIC completes its boot process. This issue affects Juniper Networks Junos OS: 17.3 versions prior to 17.3R3-S8; 18.3 versions prior to 18.3R3-S1; 18.4 versions prior to 18.4R3; 19.1 versions prior to 19.1R3; 19.2 versions prior to 19.2R2; 19.3 versions prior to 19.3R3. This issue does not affect Juniper Networks Junos OS 17.4, 18.1, and 18.2."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.3,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-1741",
        "datePublished": "2020-04-24T18:34:07",
        "description": {
            "lang": "en",
            "value": "A flaw was found in openshift-ansible. OpenShift Container Platform (OCP) 3.11 is too permissive in the way it specified CORS allowed origins during installation. An attacker, able to man-in-the-middle the connection between the user's browser and the openshift console, could use this flaw to perform a phishing attack. The main threat from this vulnerability is data confidentiality."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-1758",
        "datePublished": "2020-05-15T18:52:52",
        "description": {
            "lang": "en",
            "value": "A flaw was found in Keycloak in versions before 10.0.0, where it does not perform the TLS hostname verification while sending emails using the SMTP server. This flaw allows an attacker to perform a man-in-the-middle (MITM) attack."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-1765",
        "datePublished": "2020-01-10T15:08:55.756034Z",
        "description": {
            "lang": "en",
            "value": "An improper control of parameters allows the spoofing of the from fields of the following screens: AgentTicketCompose, AgentTicketForward, AgentTicketBounce and AgentTicketEmailOutbound. This issue affects: ((OTRS)) Community Edition 5.0.x version 5.0.39 and prior versions; 6.0.x version 6.0.24 and prior versions. OTRS 7.0.x version 7.0.13 and prior versions."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 3.5,
                "severity": "LOW"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-1864",
        "datePublished": "2020-03-20T14:58:57",
        "description": {
            "lang": "en",
            "value": "Some Huawei products have a security vulnerability due to improper authentication. A remote attacker needs to obtain some information and forge the peer device to send specific packets to the affected device. Due to the improper implementation of the authentication function, attackers can exploit the vulnerability to connect to affected devices and execute a series of commands.Affected product versions include:Secospace AntiDDoS8000 versions V500R001C00,V500R001C20,V500R001C60,V500R005C00."
        },
        "metrics": [],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2020-1887",
        "datePublished": "2020-03-12T23:50:15",
        "description": {
            "lang": "en",
            "value": "Incorrect validation of the TLS SNI hostname in osquery versions after 2.9.0 and before 4.2.0 could allow an attacker to MITM osquery traffic in the absence of a configured root chain of trust."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-1954",
        "datePublished": "2020-04-01T20:07:29",
        "description": {
            "lang": "en",
            "value": "Apache CXF has the ability to integrate with JMX by registering an InstrumentationManager extension with the CXF bus. If the ‘createMBServerConnectorFactory‘ property of the default InstrumentationManagerImpl is not disabled, then it is vulnerable to a man-in-the-middle (MITM) style attack. An attacker on the same host can connect to the registry and rebind the entry to another server, thus acting as a proxy to the original. They are then able to gain access to all of the information that is sent and received over JMX."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-1960",
        "datePublished": "2020-05-14T16:02:50",
        "description": {
            "lang": "en",
            "value": "A vulnerability in Apache Flink (1.1.0 to 1.1.5, 1.2.0 to 1.2.1, 1.3.0 to 1.3.3, 1.4.0 to 1.4.2, 1.5.0 to 1.5.6, 1.6.0 to 1.6.4, 1.7.0 to 1.7.2, 1.8.0 to 1.8.3, 1.9.0 to 1.9.2, 1.10.0) where, when running a process with an enabled JMXReporter, with a port configured via metrics.reporter.reporter_name>.port, an attacker with local access to the machine and JMX port can execute a man-in-the-middle attack using a specially crafted request to rebind the JMXRMI registry to one under the attacker's control. This compromises any connection established to the process via JMX, allowing extraction of credentials and any other transferred data."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-20093",
        "datePublished": "2022-03-23T21:27:29",
        "description": {
            "lang": "en",
            "value": "The Facebook Messenger app for iOS 227.0 and prior and Android 228.1.0.10.116 and prior user interface does not properly represent URI messages to the user, which results in URI spoofing via specially crafted messages."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-20094",
        "datePublished": "2022-03-23T21:27:46",
        "description": {
            "lang": "en",
            "value": "Instagram iOS 106.0 and prior and Android 107.0.0.11 and prior user interface does not properly represent URI messages to the user, which results in URI spoofing via specially crafted messages"
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-20095",
        "datePublished": "2022-03-23T21:28:33",
        "description": {
            "lang": "en",
            "value": "iMessage (Messages app) iOS 12.4 and prior user interface does not properly represent URI messages to the user, which results in URI spoofing via specially crafted messages."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-20096",
        "datePublished": "2022-03-23T21:28:54",
        "description": {
            "lang": "en",
            "value": "Whatsapp iOS 2.19.80 and prior and Android 2.19.222 and prior user interface does not properly represent URI messages to the user, which results in URI spoofing via specially crafted messages."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-21524",
        "datePublished": "2020-09-30T14:34:09",
        "description": {
            "lang": "en",
            "value": "There is a XML external entity (XXE) vulnerability in halo v1.1.3, The function of importing other blogs in the background(/api/admin/migrations/wordpress) needs to parse the xml file, but it is not used for security defense, This vulnerability can detect the intranet, read files, enable ddos attacks, etc. exp:https://github.com/halo-dev/halo/issues/423"
        },
        "metrics": [],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2020-21733",
        "datePublished": "2020-09-14T11:50:29",
        "description": {
            "lang": "en",
            "value": "Sagemcom F@ST3686 v1.0 HUN 3.97.0 has XSS via RgDiagnostics.asp, RgDdns.asp, RgFirewallEL.asp, RgVpnL2tpPptp.asp."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-21997",
        "datePublished": "2021-04-29T14:17:28",
        "description": {
            "lang": "en",
            "value": "Smartwares HOME easy <=1.0.9 is vulnerable to an unauthenticated database backup download and information disclosure vulnerability. An attacker could disclose sensitive and clear-text information resulting in authentication bypass, session hijacking and full system control."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-22001",
        "datePublished": "2021-04-27T17:54:07",
        "description": {
            "lang": "en",
            "value": "HomeAutomation 3.3.2 suffers from an authentication bypass vulnerability when spoofing client IP address using the X-Forwarded-For header with the local (loopback) IP address value allowing remote control of the smart home solution."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-23139",
        "datePublished": "2020-11-09T17:03:24",
        "description": {
            "lang": "en",
            "value": "Microweber 1.1.18 is affected by broken authentication and session management. Local session hijacking may occur, which could result in unauthorized access to system data or functionality, or a complete system compromise."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-24158",
        "datePublished": "2020-09-03T16:09:02",
        "description": {
            "lang": "en",
            "value": "360 Speed Browser 12.0.1247.0 has a DLL hijacking vulnerability, which can be exploited by attackers to execute malicious code. It is a dual-core browser owned by Beijing Qihoo Technology."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-24159",
        "datePublished": "2020-09-03T16:09:37",
        "description": {
            "lang": "en",
            "value": "NetEase Youdao Dictionary has a DLL hijacking vulnerability, which can be exploited by attackers to gain server permissions. This affects Guangzhou NetEase Youdao Dictionary 8.9.2.0."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-24160",
        "datePublished": "2020-09-03T16:10:07",
        "description": {
            "lang": "en",
            "value": "Shenzhen Tencent TIM Windows client 3.0.0.21315 has a DLL hijacking vulnerability, which can be exploited by attackers to execute malicious code."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-24161",
        "datePublished": "2020-09-03T16:10:37",
        "description": {
            "lang": "en",
            "value": "Guangzhou NetEase Mail Master 4.14.1.1004 on Windows has a DLL hijacking vulnerability. Attackers can use this vulnerability to execute malicious code."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-24162",
        "datePublished": "2020-09-03T16:11:19",
        "description": {
            "lang": "en",
            "value": "The Shenzhen Tencent app 5.8.2.5300 for PC platforms (from Tencent App Center) has a DLL hijacking vulnerability. Attackers can use this vulnerability to execute malicious code."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-24334",
        "datePublished": "2020-12-11T22:42:04",
        "description": {
            "lang": "en",
            "value": "The code that processes DNS responses in uIP through 1.0, as used in Contiki and Contiki-NG, does not check whether the number of responses specified in the DNS packet header corresponds to the response data available in the DNS packet, leading to an out-of-bounds read and Denial-of-Service in resolv.c."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-24335",
        "datePublished": "2021-02-02T06:13:37",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in uIP through 1.0, as used in Contiki and Contiki-NG. Domain name parsing lacks bounds checks, allowing an attacker to corrupt memory with crafted DNS packets."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-24336",
        "datePublished": "2020-12-11T22:43:01",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Contiki through 3.0 and Contiki-NG through 4.5. The code for parsing Type A domain name answers in ip64-dns64.c doesn't verify whether the address in the answer's length is sane. Therefore, when copying an address of an arbitrary length, a buffer overflow can occur. This bug can be exploited whenever NAT64 is enabled."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-24338",
        "datePublished": "2020-12-11T22:45:04",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in picoTCP through 1.7.0. The DNS domain name record decompression functionality in pico_dns_decompress_name() in pico_dns_common.c does not validate the compression pointer offset values with respect to the actual data present in a DNS response packet, causing out-of-bounds writes that lead to Denial-of-Service and Remote Code Execution."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-24339",
        "datePublished": "2020-12-11T22:53:55",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in picoTCP and picoTCP-NG through 1.7.0. The DNS domain name record decompression functionality in pico_dns_decompress_name() in pico_dns_common.c does not validate the compression pointer offset values with respect to the actual data present in a DNS response packet, causing out-of-bounds reads that lead to Denial-of-Service."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-24340",
        "datePublished": "2020-12-11T22:54:39",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in picoTCP and picoTCP-NG through 1.7.0. The code that processes DNS responses in pico_mdns_handle_data_as_answers_generic() in pico_mdns.c does not check whether the number of answers/responses specified in a DNS packet header corresponds to the response data available in the packet, leading to an out-of-bounds read, invalid pointer dereference, and Denial-of-Service."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-24374",
        "datePublished": "2020-09-16T20:00:13",
        "description": {
            "lang": "en",
            "value": "A DNS rebinding vulnerability in Freebox v5 before 1.5.29."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-24375",
        "datePublished": "2020-10-19T18:08:03",
        "description": {
            "lang": "en",
            "value": "A DNS rebinding vulnerability in the UPnP MediaServer implementation in Freebox Server before 4.2.3."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-24376",
        "datePublished": "2020-09-16T20:00:25",
        "description": {
            "lang": "en",
            "value": "A DNS rebinding vulnerability in the UPnP IGD implementations in Freebox v5 before 1.5.29 and Freebox Server before 4.2.3."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-24377",
        "datePublished": "2020-09-16T20:00:29",
        "description": {
            "lang": "en",
            "value": "A DNS rebinding vulnerability in the Freebox OS web interface in Freebox Server before 4.2.3."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-24383",
        "datePublished": "2020-12-11T22:56:22",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in FNET through 4.6.4. The code for processing resource records in mDNS queries doesn't check for proper '\\0' termination of the resource record name string, leading to an out-of-bounds read, and potentially causing information leak or Denial-or-Service."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-24392",
        "datePublished": "2021-02-19T22:42:17",
        "description": {
            "lang": "en",
            "value": "In voloko twitter-stream 0.1.10, missing TLS hostname validation allows an attacker to perform a man-in-the-middle attack against users of the library (because eventmachine is misused)."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-24393",
        "datePublished": "2021-02-19T22:44:56",
        "description": {
            "lang": "en",
            "value": "TweetStream 2.6.1 uses the library eventmachine in an insecure way that does not have TLS hostname validation. This allows an attacker to perform a man-in-the-middle attack."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-24619",
        "datePublished": "2020-09-22T11:51:44",
        "description": {
            "lang": "en",
            "value": "In mainwindow.cpp in Shotcut before 20.09.13, the upgrade check misuses TLS because of setPeerVerifyMode(QSslSocket::VerifyNone). A man-in-the-middle attacker could offer a spoofed download resource."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-24696",
        "datePublished": "2020-10-02T08:21:46",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in PowerDNS Authoritative through 4.3.0 when --enable-experimental-gss-tsig is used. A remote, unauthenticated attacker can trigger a race condition leading to a crash, or possibly arbitrary code execution, by sending crafted queries with a GSS-TSIG signature."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-24697",
        "datePublished": "2020-10-02T08:23:11",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in PowerDNS Authoritative through 4.3.0 when --enable-experimental-gss-tsig is used. A remote, unauthenticated attacker can cause a denial of service by sending crafted queries with a GSS-TSIG signature."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-24698",
        "datePublished": "2020-10-02T08:23:44",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in PowerDNS Authoritative through 4.3.0 when --enable-experimental-gss-tsig is used. A remote, unauthenticated attacker might be able to cause a double-free, leading to a crash or possibly arbitrary code execution. by sending crafted queries with a GSS-TSIG signature."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-24703",
        "datePublished": "2020-08-27T00:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in certain WSO2 products. A valid Carbon Management Console session cookie may be sent to an attacker-controlled server if the victim submits a crafted Try It request, aka Session Hijacking. This affects API Manager 2.2.0, API Manager Analytics 2.2.0, API Microgateway 2.2.0, Data Analytics Server 3.2.0, Enterprise Integrator through 6.6.0, IS as Key Manager 5.5.0, Identity Server 5.5.0 and 5.8.0, Identity Server Analytics 5.5.0, and IoT Server 3.3.0 and 3.3.1."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-24705",
        "datePublished": "2020-08-27T00:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in certain WSO2 products. A valid Carbon Management Console session cookie may be sent to an attacker-controlled server if the victim submits a crafted Try It request, aka Session Hijacking. This affects API Manager through 3.1.0, API Manager Analytics 2.5.0, IS as Key Manager through 5.10.0, Identity Server through 5.10.0, Identity Server Analytics through 5.6.0, and IoT Server 3.1.0."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-25045",
        "datePublished": "2020-09-02T19:25:10",
        "description": {
            "lang": "en",
            "value": "Installers of Kaspersky Security Center and Kaspersky Security Center Web Console prior to 12 & prior to 12 Patch A were vulnerable to a DLL hijacking attack that allowed an attacker to elevate privileges in the system."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-25079",
        "datePublished": "2020-09-02T15:33:07",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on D-Link DCS-2530L before 1.06.01 Hotfix and DCS-2670L through 2.02 devices. cgi-bin/ddns_enc.cgi allows authenticated command injection."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-25095",
        "datePublished": "2020-12-17T02:04:03",
        "description": {
            "lang": "en",
            "value": "LogRhythm Platform Manager (PM) 7.4.9 allows CSRF. The Web interface is vulnerable to Cross-site WebSocket Hijacking (CSWH). If a logged-in PM user visits a malicious site in the same browser session, that site can perform a CSRF attack to create a WebSocket from the victim client to the vulnerable PM server. Once the socket is created, the malicious site can interact with the vulnerable web server in the context of the logged-in user. This can include WebSocket payloads that result in command execution."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-25107",
        "datePublished": "2020-12-11T22:57:15",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in the DNS implementation in Ethernut in Nut/OS 5.1. There is no check on whether a domain name has '\\0' termination. This may lead to successful Denial-of-Service, and possibly Remote Code Execution."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-25108",
        "datePublished": "2020-12-11T22:58:01",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in the DNS implementation in Ethernut in Nut/OS 5.1. The DNS response data length is not checked (it can be set to an arbitrary value from a packet). This may lead to successful Denial-of-Service, and possibly Remote Code Execution."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-25109",
        "datePublished": "2020-12-11T22:58:53",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in the DNS implementation in Ethernut in Nut/OS 5.1. The number of DNS queries/responses (set in a DNS header) is not checked against the data present. This may lead to successful Denial-of-Service, and possibly Remote Code Execution."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-25110",
        "datePublished": "2020-12-11T22:59:38",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in the DNS implementation in Ethernut in Nut/OS 5.1. The length byte of a domain name in a DNS query/response is not checked, and is used for internal memory operations. This may lead to successful Denial-of-Service, and possibly Remote Code Execution."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-25174",
        "datePublished": "2020-11-06T16:08:41.727185Z",
        "description": {
            "lang": "en",
            "value": "A DLL hijacking vulnerability in the B. Braun OnlineSuite Version AP 3.0 and earlier allows local attackers to execute code on the system as a high privileged user."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-25244",
        "datePublished": "2021-04-22T20:42:19",
        "description": {
            "lang": "en",
            "value": "A vulnerability has been identified in LOGO! Soft Comfort (All versions < V8.4). The software insecurely loads libraries which makes it vulnerable to DLL hijacking.\nSuccessful exploitation by a local attacker could lead to a takeover of the system\nwhere the software is installed."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.4,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-25502",
        "datePublished": "2023-01-20T00:00:00",
        "description": {
            "lang": "en",
            "value": "Cybereason EDR version 19.1.282 and above, 19.2.182 and above, 20.1.343 and above, and 20.2.X and above has a DLL hijacking vulnerability, which could allow a local attacker to execute code with elevated privileges."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-25506",
        "datePublished": "2021-02-02T13:00:11",
        "description": {
            "lang": "en",
            "value": "D-Link DNS-320 FW v2.06B01 Revision Ax is affected by command injection in the system_mgr.cgi component, which can lead to remote arbitrary code execution."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-25577",
        "datePublished": "2021-03-29T19:53:50",
        "description": {
            "lang": "en",
            "value": "In FreeBSD 12.2-STABLE before r368250, 11.4-STABLE before r368253, 12.2-RELEASE before p1, 12.1-RELEASE before p11 and 11.4-RELEASE before p5 rtsold(8) does not verify that the RDNSS option does not extend past the end of the received packet before processing its contents. While the kernel currently ignores such malformed packets, it passes them to userspace programs. Any programs expecting the kernel to do validation may be vulnerable to an overflow."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-25583",
        "datePublished": "2021-03-29T19:53:57",
        "description": {
            "lang": "en",
            "value": "In FreeBSD 12.2-STABLE before r368250, 11.4-STABLE before r368253, 12.2-RELEASE before p1, 12.1-RELEASE before p11 and 11.4-RELEASE before p5 when processing a DNSSL option, rtsold(8) decodes domain name labels per an encoding specified in RFC 1035 in which the first octet of each label contains the label's length. rtsold(8) did not validate label lengths correctly and could overflow the destination buffer."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-25681",
        "datePublished": "2021-01-20T16:36:41",
        "description": {
            "lang": "en",
            "value": "A flaw was found in dnsmasq before version 2.83. A heap-based buffer overflow was discovered in the way RRSets are sorted before validating with DNSSEC data. An attacker on the network, who can forge DNS replies such as that they are accepted as valid, could use this flaw to cause a buffer overflow with arbitrary data in a heap memory segment, possibly executing code on the machine. The highest threat from this vulnerability is to data confidentiality and integrity as well as system availability."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2020-25682",
        "datePublished": "2021-01-20T16:28:38",
        "description": {
            "lang": "en",
            "value": "A flaw was found in dnsmasq before 2.83. A buffer overflow vulnerability was discovered in the way dnsmasq extract names from DNS packets before validating them with DNSSEC data. An attacker on the network, who can create valid DNS replies, could use this flaw to cause an overflow with arbitrary data in a heap-allocated memory, possibly executing code on the machine. The flaw is in the rfc1035.c:extract_name() function, which writes data to the memory pointed by name assuming MAXDNAME*2 bytes are available in the buffer. However, in some code execution paths, it is possible extract_name() gets passed an offset from the base buffer, thus reducing, in practice, the number of available bytes that can be written in the buffer. The highest threat from this vulnerability is to data confidentiality and integrity as well as system availability."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2020-25683",
        "datePublished": "2021-01-20T15:25:04",
        "description": {
            "lang": "en",
            "value": "A flaw was found in dnsmasq before version 2.83. A heap-based buffer overflow was discovered in dnsmasq when DNSSEC is enabled and before it validates the received DNS entries. A remote attacker, who can create valid DNS replies, could use this flaw to cause an overflow in a heap-allocated memory. This flaw is caused by the lack of length checks in rfc1035.c:extract_name(), which could be abused to make the code execute memcpy() with a negative size in get_rdata() and cause a crash in dnsmasq, resulting in a denial of service. The highest threat from this vulnerability is to system availability."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2020-25684",
        "datePublished": "2021-01-20T15:22:21",
        "description": {
            "lang": "en",
            "value": "A flaw was found in dnsmasq before version 2.83. When getting a reply from a forwarded query, dnsmasq checks in the forward.c:reply_query() if the reply destination address/port is used by the pending forwarded queries. However, it does not use the address/port to retrieve the exact forwarded query, substantially reducing the number of attempts an attacker on the network would have to perform to forge a reply and get it accepted by dnsmasq. This issue contrasts with RFC5452, which specifies a query's attributes that all must be used to match a reply. This flaw allows an attacker to perform a DNS Cache Poisoning attack. If chained with CVE-2020-25685 or CVE-2020-25686, the attack complexity of a successful attack is reduced. The highest threat from this vulnerability is to data integrity."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dns cache poisoning",
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-25685",
        "datePublished": "2021-01-20T00:00:00",
        "description": {
            "lang": "en",
            "value": "A flaw was found in dnsmasq before version 2.83. When getting a reply from a forwarded query, dnsmasq checks in forward.c:reply_query(), which is the forwarded query that matches the reply, by only using a weak hash of the query name. Due to the weak hash (CRC32 when dnsmasq is compiled without DNSSEC, SHA-1 when it is) this flaw allows an off-path attacker to find several different domains all having the same hash, substantially reducing the number of attempts they would have to perform to forge a reply and get it accepted by dnsmasq. This is in contrast with RFC5452, which specifies that the query name is one of the attributes of a query that must be used to match a reply. This flaw could be abused to perform a DNS Cache Poisoning attack. If chained with CVE-2020-25684 the attack complexity of a successful attack is reduced. The highest threat from this vulnerability is to data integrity."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dnssec",
            "dns cache poisoning",
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-25686",
        "datePublished": "2021-01-20T16:47:17",
        "description": {
            "lang": "en",
            "value": "A flaw was found in dnsmasq before version 2.83. When receiving a query, dnsmasq does not check for an existing pending request for the same name and forwards a new request. By default, a maximum of 150 pending queries can be sent to upstream servers, so there can be at most 150 queries for the same name. This flaw allows an off-path attacker on the network to substantially reduce the number of attempts that it would have to perform to forge a reply and have it accepted by dnsmasq. This issue is mentioned in the \"Birthday Attacks\" section of RFC5452. If chained with CVE-2020-25684, the attack complexity of a successful attack is reduced. The highest threat from this vulnerability is to data integrity."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-25687",
        "datePublished": "2021-01-20T16:31:41",
        "description": {
            "lang": "en",
            "value": "A flaw was found in dnsmasq before version 2.83. A heap-based buffer overflow was discovered in dnsmasq when DNSSEC is enabled and before it validates the received DNS entries. This flaw allows a remote attacker, who can create valid DNS replies, to cause an overflow in a heap-allocated memory. This flaw is caused by the lack of length checks in rfc1035.c:extract_name(), which could be abused to make the code execute memcpy() with a negative size in sort_rrset() and cause a crash in dnsmasq, resulting in a denial of service. The highest threat from this vulnerability is to system availability."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2020-25688",
        "datePublished": "2020-11-23T21:07:06",
        "description": {
            "lang": "en",
            "value": "A flaw was found in rhacm versions before 2.0.5 and before 2.1.0. Two internal service APIs were incorrectly provisioned using a test certificate from the source repository. This would result in all installations using the same certificates. If an attacker could observe network traffic internal to a cluster, they could use the private key to decode API requests that should be protected by TLS sessions, potentially obtaining information they would not otherwise be able to. These certificates are not used for service authentication, so no opportunity for impersonation or active MITM attacks were made possible."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-25692",
        "datePublished": "2020-12-08T00:06:29",
        "description": {
            "lang": "en",
            "value": "A NULL pointer dereference was found in OpenLDAP server and was fixed in openldap 2.4.55, during a request for renaming RDNs. An unauthenticated attacker could remotely crash the slapd process by sending a specially crafted request, causing a Denial of Service."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-25694",
        "datePublished": "2020-11-16T00:38:53",
        "description": {
            "lang": "en",
            "value": "A flaw was found in PostgreSQL versions before 13.1, before 12.5, before 11.10, before 10.15, before 9.6.20 and before 9.5.24. If a client application that creates additional database connections only reuses the basic connection parameters while dropping security-relevant parameters, an opportunity for a man-in-the-middle attack, or the ability to observe clear-text transmissions, could exist. The highest threat from this vulnerability is to data confidentiality and integrity as well as system availability."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-25767",
        "datePublished": "2021-08-18T18:39:26",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in HCC Embedded NicheStack IPv4 4.1. The dnc_copy_in routine for parsing DNS domain names does not check whether a domain name compression pointer is pointing within the bounds of the packet (e.g., forward compression pointer jumps are allowed), which leads to an Out-of-bounds Read, and a Denial-of-Service as a consequence."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-25829",
        "datePublished": "2020-10-16T05:07:44",
        "description": {
            "lang": "en",
            "value": "An issue has been found in PowerDNS Recursor before 4.1.18, 4.2.x before 4.2.5, and 4.3.x before 4.3.5. A remote attacker can cause the cached records for a given name to be updated to the Bogus DNSSEC validation state, instead of their actual DNSSEC Secure state, via a DNS ANY query. This results in a denial of service for installation that always validate (dnssec=validate), and for clients requesting validation when on-demand validation is enabled (dnssec=process)."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2020-25890",
        "datePublished": "2020-11-17T20:05:23",
        "description": {
            "lang": "en",
            "value": "The web application of Kyocera printer (ECOSYS M2640IDW) is affected by Stored XSS vulnerability, discovered in the addition a new contact in \"Machine Address Book\". Successful exploitation of this vulnerability can lead to session hijacking of the administrator in the web application or the execution of unwanted actions"
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-25926",
        "datePublished": "2021-08-18T18:35:28",
        "description": {
            "lang": "en",
            "value": "The DNS client in InterNiche NicheStack TCP/IP 4.0.1 is affected by: Insufficient entropy in the DNS transaction id. The impact is: DNS cache poisoning (remote). The component is: dns_query_type(). The attack vector is: a specific DNS response packet."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dns cache poisoning",
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-25927",
        "datePublished": "2021-08-18T18:37:36",
        "description": {
            "lang": "en",
            "value": "The DNS feature in InterNiche NicheStack TCP/IP 4.0.1 is affected by: Out-of-bounds Read. The impact is: a denial of service (remote). The component is: DNS response processing in function: dns_upcall(). The attack vector is: a specific DNS response packet. The code does not check whether the number of queries/responses specified in the DNS packet header corresponds to the query/response data available in the DNS packet."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-25928",
        "datePublished": "2021-08-18T18:41:00",
        "description": {
            "lang": "en",
            "value": "The DNS feature in InterNiche NicheStack TCP/IP 4.0.1 is affected by: Buffer Overflow. The impact is: execute arbitrary code (remote). The component is: DNS response processing functions: dns_upcall(), getoffset(), dnc_set_answer(). The attack vector is: a specific DNS response packet. The code does not check the \"response data length\" field of individual DNS answers, which may cause out-of-bounds read/write operations, leading to Information leak, Denial-or-Service, or Remote Code Execution, depending on the context."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-26107",
        "datePublished": "2020-09-25T05:42:25",
        "description": {
            "lang": "en",
            "value": "cPanel before 88.0.3, upon an upgrade, establishes predictable PowerDNS API keys (SEC-561)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-26110",
        "datePublished": "2020-09-25T05:40:59",
        "description": {
            "lang": "en",
            "value": "cPanel before 88.0.13 allows self XSS via DNS Zone Manager DNSSEC interfaces (SEC-564)."
        },
        "metrics": [],
        "tags": [
            "dns",
            "dnssec"
        ]
    },
    {
        "cveId": "CVE-2020-26111",
        "datePublished": "2020-09-25T05:40:50",
        "description": {
            "lang": "en",
            "value": "cPanel before 90.0.10 allows self XSS via the WHM Edit DNS Zone interface (SEC-566)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-26132",
        "datePublished": "2020-10-28T00:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Home DNS Server 0.10. Due to insufficient access restrictions in the default installation directory, an attacker can elevate privileges by replacing the HomeDNSServer.exe binary."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-26133",
        "datePublished": "2020-10-28T00:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Dual DHCP DNS Server 7.40. Due to insufficient access restrictions in the default installation directory, an attacker can elevate privileges by replacing the DualServer.exe binary."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-26155",
        "datePublished": "2021-03-18T16:17:01",
        "description": {
            "lang": "en",
            "value": "Multiple files and folders in Utimaco SecurityServer 4.20.0.4 and 4.31.1.0. are installed with Read/Write permissions for authenticated users, which allows for binaries to be manipulated by non-administrator users. Additionally, entries are made to the PATH environment variable which, in conjunction with these weak permissions, could enable an attacker to perform a DLL hijacking attack."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-26221",
        "datePublished": "2020-11-11T22:20:12",
        "description": {
            "lang": "en",
            "value": "touchbase.ai before version 2.0 is vulnerable to Cross-Site Scripting (XSS). The vulnerability allows an attacker to send malicious JavaScript code which could result in hijacking of the user's cookie/session tokens, redirecting the user to a malicious webpage and performing unintended browser action. The issue is patched in version 2.0."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-26234",
        "datePublished": "2020-12-08T22:35:13",
        "description": {
            "lang": "en",
            "value": "Opencast before versions 8.9 and 7.9 disables HTTPS hostname verification of its HTTP client used for a large portion of Opencast's HTTP requests. Hostname verification is an important part when using HTTPS to ensure that the presented certificate is valid for the host. Disabling it can allow for man-in-the-middle attacks. This problem is fixed in Opencast 7.9 and Opencast 8.8 Please be aware that fixing the problem means that Opencast will not simply accept any self-signed certificates any longer without properly importing them. If you need those, please make sure to import them into the Java key store. Better yet, get a valid certificate."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-26525",
        "datePublished": "2020-10-02T19:47:52",
        "description": {
            "lang": "en",
            "value": "Damstra Smart Asset 2020.7 has SQL injection via the API/api/Asset originator parameter. This allows forcing the database and server to initiate remote connections to third party DNS servers."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-26556",
        "datePublished": "2021-05-24T17:34:58",
        "description": {
            "lang": "en",
            "value": "Mesh Provisioning in the Bluetooth Mesh profile 1.0 and 1.0.1 may permit a nearby device, able to conduct a successful brute-force attack on an insufficiently random AuthValue before the provisioning procedure times out, to complete authentication by leveraging Malleable Commitment."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-26558",
        "datePublished": "2021-05-24T17:22:16",
        "description": {
            "lang": "en",
            "value": "Bluetooth LE and BR/EDR secure pairing in Bluetooth Core Specification 2.1 through 5.2 may permit a nearby man-in-the-middle attacker to identify the Passkey used during pairing (in the Passkey authentication procedure) by reflection of the public key and the authentication evidence of the initiating device, potentially permitting this attacker to complete authenticated pairing with the responding device using the correct Passkey for the pairing session. The attack methodology determines the Passkey value one bit at a time."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-26733",
        "datePublished": "2021-01-14T15:57:23",
        "description": {
            "lang": "en",
            "value": "Cross Site Scripting (XSS) in Configuration page in SKYWORTH GN542VF Hardware Version 2.0 and Software Version 2.0.0.16 allows authenticated attacker to inject their own script into the page via DDNS Configuration Section."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-26887",
        "datePublished": "2020-10-23T04:57:57",
        "description": {
            "lang": "en",
            "value": "FRITZ!OS before 7.21 on FRITZ!Box devices allows a bypass of a DNS Rebinding protection mechanism."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-26895",
        "datePublished": "2020-10-21T02:00:23",
        "description": {
            "lang": "en",
            "value": "Prior to 0.10.0-beta, LND (Lightning Network Daemon) would have accepted a counterparty high-S signature and broadcast tx-relay invalid local commitment/HTLC transactions. This can be exploited by any peer with an open channel regardless of the victim situation (e.g., routing node, payment-receiver, or payment-sender). The impact is a loss of funds in certain situations."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-26954",
        "datePublished": "2020-12-09T00:20:56",
        "description": {
            "lang": "en",
            "value": "When accepting a malicious intent from other installed apps, Firefox for Android accepted manifests from arbitrary file paths and allowed declaring webapp manifests for other origins. This could be used to gain fullscreen access for UI spoofing and could also lead to cross-origin attacks on targeted websites. *Note: This issue only affected Firefox for Android. Other operating systems are unaffected.*. This vulnerability affects Firefox < 83."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-26961",
        "datePublished": "2020-12-09T00:23:31",
        "description": {
            "lang": "en",
            "value": "When DNS over HTTPS is in use, it intentionally filters RFC1918 and related IP ranges from the responses as these do not make sense coming from a DoH resolver. However when an IPv4 address was mapped through IPv6, these addresses were erroneously let through, leading to a potential DNS Rebinding attack. This vulnerability affects Firefox < 83, Firefox ESR < 78.5, and Thunderbird < 78.5."
        },
        "metrics": [],
        "tags": [
            "dns",
            "rebinding attack"
        ]
    },
    {
        "cveId": "CVE-2020-26966",
        "datePublished": "2020-12-09T00:25:22",
        "description": {
            "lang": "en",
            "value": "Searching for a single word from the address bar caused an mDNS request to be sent on the local network searching for a hostname consisting of that string; resulting in an information leak. *Note: This issue only affected Windows operating systems. Other operating systems are unaffected.*. This vulnerability affects Firefox < 83, Firefox ESR < 78.5, and Thunderbird < 78.5."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-27009",
        "datePublished": "2021-04-22T20:42:19",
        "description": {
            "lang": "en",
            "value": "A vulnerability has been identified in APOGEE PXC Compact (BACnet) (All versions < V3.5.5), APOGEE PXC Compact (P2 Ethernet) (All versions < V2.8.20), APOGEE PXC Modular (BACnet) (All versions < V3.5.5), APOGEE PXC Modular (P2 Ethernet) (All versions < V2.8.20), Nucleus NET (All versions < V5.2), Nucleus Source Code (Versions including affected DNS modules), TALON TC Compact (BACnet) (All versions < V3.5.5), TALON TC Modular (BACnet) (All versions < V3.5.5). The DNS domain name record decompression functionality does not properly validate the pointer offset values. The parsing of malformed responses could result in a write past the end of an allocated structure. An attacker with a privileged position in the network could leverage this vulnerability to execute code in the context of the current process or cause a denial-of-service condition."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.1,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-27184",
        "datePublished": "2021-05-14T12:06:15",
        "description": {
            "lang": "en",
            "value": "The NPort IA5000A Series devices use Telnet as one of the network device management services. Telnet does not support the encryption of client-server communications, making it vulnerable to Man-in-the-Middle attacks."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-27414",
        "datePublished": "2021-12-02T03:08:13",
        "description": {
            "lang": "en",
            "value": "Mahavitaran android application 7.50 and prior transmit sensitive information in URL parameters. This may lead to information disclosure if unauthorized parties have access to the URLs via server logs, referrer header, MITM or browser history."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-27488",
        "datePublished": "2021-01-13T19:06:54",
        "description": {
            "lang": "en",
            "value": "Loxone Miniserver devices with firmware before 11.1 (aka 11.1.9.3) are unable to use an authentication method that is based on the \"signature of the update package.\" Therefore, these devices (or attackers who are spoofing these devices) can continue to use an unauthenticated cloud service for an indeterminate time period (possibly forever). Once an individual device's firmware is updated, and authentication occurs once, the cloud service recategorizes the device so that authentication is subsequently always required, and spoofing cannot occur."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-27648",
        "datePublished": "2020-10-29T09:00:25.133928Z",
        "description": {
            "lang": "en",
            "value": "Improper certificate validation vulnerability in OpenVPN client in Synology DiskStation Manager (DSM) before 6.2.3-25426-2 allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.3,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-27649",
        "datePublished": "2020-10-29T08:55:20.493003Z",
        "description": {
            "lang": "en",
            "value": "Improper certificate validation vulnerability in OpenVPN client in Synology Router Manager (SRM) before 1.2.4-8081 allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.3,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-27652",
        "datePublished": "2020-10-29T09:00:26.029280Z",
        "description": {
            "lang": "en",
            "value": "Algorithm downgrade vulnerability in QuickConnect in Synology DiskStation Manager (DSM) before 6.2.3-25426-2 allows man-in-the-middle attackers to spoof servers and obtain sensitive information via unspecified vectors."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.3,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-27653",
        "datePublished": "2020-10-29T08:55:21.316433Z",
        "description": {
            "lang": "en",
            "value": "Algorithm downgrade vulnerability in QuickConnect in Synology Router Manager (SRM) before 1.2.4-8081 allows man-in-the-middle attackers to spoof servers and obtain sensitive information via unspecified vectors."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.3,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-27656",
        "datePublished": "2020-10-29T09:00:26.440634Z",
        "description": {
            "lang": "en",
            "value": "Cleartext transmission of sensitive information vulnerability in DDNS in Synology DiskStation Manager (DSM) before 6.2.3-25426-2 allows man-in-the-middle attackers to eavesdrop authentication information of DNSExit via unspecified vectors."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns",
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-27657",
        "datePublished": "2020-10-29T08:55:22.868313Z",
        "description": {
            "lang": "en",
            "value": "Cleartext transmission of sensitive information vulnerability in DDNS in Synology Router Manager (SRM) before 1.2.4-8081 allows man-in-the-middle attackers to eavesdrop authentication information of DNSExit via unspecified vectors."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns",
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-27717",
        "datePublished": "2020-12-24T15:11:59",
        "description": {
            "lang": "en",
            "value": "On BIG-IP DNS 16.0.0-16.0.0.1, 15.1.0-15.1.0.5, 14.1.0-14.1.3, 13.1.0-13.1.3.4, and 12.1.0-12.1.5.2, undisclosed series of DNS requests may cause TMM to restart and generate a core file."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-27721",
        "datePublished": "2020-12-24T14:52:59",
        "description": {
            "lang": "en",
            "value": "In versions 16.0.0-16.0.0.1, 15.1.0-15.1.1, 14.1.0-14.1.3, 13.1.0-13.1.3.5, 12.1.0-12.1.5.2, and 11.6.1-11.6.5.2, in a BIG-IP DNS / BIG-IP LTM GSLB deployment, under certain circumstances, the BIG-IP DNS system may stop using a BIG-IP LTM virtual server for DNS response."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-27725",
        "datePublished": "2020-12-24T15:01:46",
        "description": {
            "lang": "en",
            "value": "In version 15.1.0-15.1.0.5, 14.1.0-14.1.3, 13.1.0-13.1.3.4, 12.1.0-12.1.5.2, and 11.6.1-11.6.5.2 of BIG-IP DNS, GTM, and Link Controller, zxfrd leaks memory when listing DNS zones. Zones can be listed via TMSH, iControl or SNMP; only users with access to those services can trigger this vulnerability."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-27736",
        "datePublished": "2021-04-22T20:42:19",
        "description": {
            "lang": "en",
            "value": "A vulnerability has been identified in APOGEE PXC Compact (BACnet) (All versions < V3.5.5), APOGEE PXC Compact (P2 Ethernet) (All versions < V2.8.20), APOGEE PXC Modular (BACnet) (All versions < V3.5.5), APOGEE PXC Modular (P2 Ethernet) (All versions < V2.8.20), Nucleus NET (All versions), Nucleus ReadyStart V3 (All versions < V2017.02.3), Nucleus ReadyStart V4 (All versions < V4.1.0), Nucleus Source Code (Versions including affected DNS modules), SIMOTICS CONNECT 400 (All versions < V0.5.0.0), TALON TC Compact (BACnet) (All versions < V3.5.5), TALON TC Modular (BACnet) (All versions < V3.5.5). The DNS domain name label parsing functionality does not properly validate the null-terminated name in DNS-responses. The parsing of malformed responses could result in a read past the end of an allocated structure. An attacker with a privileged position in the network could leverage this vulnerability to cause a denial-of-service condition or leak the read memory."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-27737",
        "datePublished": "2021-04-22T20:42:19",
        "description": {
            "lang": "en",
            "value": "A vulnerability has been identified in APOGEE PXC Compact (BACnet) (All versions < V3.5.5), APOGEE PXC Compact (P2 Ethernet) (All versions < V2.8.20), APOGEE PXC Modular (BACnet) (All versions < V3.5.5), APOGEE PXC Modular (P2 Ethernet) (All versions < V2.8.20), Nucleus NET (All versions), Nucleus ReadyStart V3 (All versions < V2017.02.3), Nucleus ReadyStart V4 (All versions < V4.1.0), Nucleus Source Code (Versions including affected DNS modules), SIMOTICS CONNECT 400 (All versions < V0.5.0.0), TALON TC Compact (BACnet) (All versions < V3.5.5), TALON TC Modular (BACnet) (All versions < V3.5.5). The DNS response parsing functionality does not properly validate various length and counts of the records. The parsing of malformed responses could result in a read past the end of an allocated structure. An attacker with a privileged position in the network could leverage this vulnerability to cause a denial-of-service condition  or leak the memory past the allocated structure."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-27738",
        "datePublished": "2021-04-22T20:42:20",
        "description": {
            "lang": "en",
            "value": "A vulnerability has been identified in APOGEE PXC Compact (BACnet) (All versions < V3.5.5), APOGEE PXC Compact (P2 Ethernet) (All versions < V2.8.20), APOGEE PXC Modular (BACnet) (All versions < V3.5.5), APOGEE PXC Modular (P2 Ethernet) (All versions < V2.8.20), Nucleus NET (All versions), Nucleus ReadyStart V3 (All versions < V2017.02.3), Nucleus ReadyStart V4 (All versions < V4.1.0), Nucleus Source Code (Versions including affected DNS modules), SIMOTICS CONNECT 400 (All versions < V0.5.0.0), TALON TC Compact (BACnet) (All versions < V3.5.5), TALON TC Modular (BACnet) (All versions < V3.5.5). The DNS domain name record decompression functionality does not properly validate the pointer offset values. The parsing of malformed responses could result in a read access past the end of an allocated structure. An attacker with a privileged position in the network could leverage this vulnerability to cause a denial-of-service condition."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-27969",
        "datePublished": "2021-09-13T11:44:01",
        "description": {
            "lang": "en",
            "value": "Yandex Browser for Android 20.8.4 allows remote attackers to perform SOP bypass and addresss bar spoofing"
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-28190",
        "datePublished": "2020-12-24T14:34:32",
        "description": {
            "lang": "en",
            "value": "TerraMaster TOS <= 4.2.06 was found to check for updates (of both system and applications) via an insecure channel (HTTP). Man-in-the-middle attackers are able to intercept these requests and serve a weaponized/infected version of applications or updates."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-28391",
        "datePublished": "2021-01-12T00:00:00",
        "description": {
            "lang": "en",
            "value": "A vulnerability has been identified in SCALANCE X-200 switch family (incl. SIPLUS NET variants) (All versions < V5.2.5), SCALANCE X-200IRT switch family (incl. SIPLUS NET variants) (All versions < V5.5.0), SCALANCE X-200RNA switch family (All versions < V3.2.7). Devices create a new unique key upon factory reset, except when used with C-PLUG. When used with C-PLUG the devices use the hardcoded private RSA-key shipped with the firmware-image. An attacker could leverage this situation to a man-in-the-middle situation and decrypt previously captured traffic."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-28395",
        "datePublished": "2021-01-12T00:00:00",
        "description": {
            "lang": "en",
            "value": "A vulnerability has been identified in SCALANCE X-200RNA switch family (All versions < V3.2.7), SCALANCE X-300 switch family (incl. X408 and SIPLUS NET variants) (All versions < V4.1.0). Devices do not create a new unique private key after factory reset. An attacker could leverage this situation to a man-in-the-middle situation and decrypt previously captured traffic."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-28473",
        "datePublished": "2021-01-18T11:15:14.918598Z",
        "description": {
            "lang": "en",
            "value": "The package bottle from 0 and before 0.12.19 are vulnerable to Web Cache Poisoning by using a vector called parameter cloaking. When the attacker can separate query parameters using a semicolon (;), they can cause a difference in the interpretation of the request between the proxy (running with default configuration) and the server. This can result in malicious requests being cached as completely safe ones, as the proxy would usually not see the semicolon as a separator, and therefore would not include it in a cache key of an unkeyed parameter."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-28912",
        "datePublished": "2020-12-24T19:49:20",
        "description": {
            "lang": "en",
            "value": "With MariaDB running on Windows, when local clients connect to the server over named pipes, it's possible for an unprivileged user with an ability to run code on the server machine to intercept the named pipe connection and act as a man-in-the-middle, gaining access to all the data passed between the client and the server, and getting the ability to run SQL commands on behalf of the connected user. This occurs because of an incorrect security descriptor. This affects MariaDB Server before 10.1.48, 10.2.x before 10.2.35, 10.3.x before 10.3.26, 10.4.x before 10.4.16, and 10.5.x before 10.5.7. NOTE: this issue exists because certain details of the MariaDB CVE-2019-2503 fix did not comprehensively address attack variants against MariaDB. This situation is specific to MariaDB, and thus CVE-2020-28912 does NOT apply to other vendors that were originally affected by CVE-2019-2503."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-28950",
        "datePublished": "2020-12-04T21:11:56",
        "description": {
            "lang": "en",
            "value": "The installer of Kaspersky Anti-Ransomware Tool (KART) prior to KART 4.0 Patch C was vulnerable to a DLL hijacking attack that allowed an attacker to elevate privileges during installation process."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-29000",
        "datePublished": "2021-01-26T01:24:59",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on Geeni GNC-CW013 doorbell 1.8.1 devices. A vulnerability exists in the RTSP service that allows a remote attacker to take full control of the device with a high-privileged account. By sending a crafted message, an attacker is able to remotely deliver a telnet session. Any attacker that has the ability to control DNS can exploit this vulnerability to remotely login to the device and gain access to the camera system."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-29022",
        "datePublished": "2021-02-16T15:08:36.021278Z",
        "description": {
            "lang": "en",
            "value": "Failure to Sanitize host header value on output in the GateManager Web server could allow an attacker to conduct web cache poisoning attacks. This issue affects Secomea GateManager all versions prior to 9.3"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-29055",
        "datePublished": "2020-11-24T21:00:57",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on CDATA 72408A, 9008A, 9016A, 92408A, 92416A, 9288, 97016, 97024P, 97028P, 97042P, 97084P, 97168P, FD1002S, FD1104, FD1104B, FD1104S, FD1104SN, FD1108S, FD1204S-R2, FD1204SN, FD1204SN-R2, FD1208S-R2, FD1216S-R1, FD1608GS, FD1608SN, FD1616GS, FD1616SN, and FD8000 devices. By default, the appliance can be managed remotely only with HTTP, telnet, and SNMP. It doesn't support SSL/TLS for HTTP or SSH. An attacker can intercept passwords sent in cleartext and conduct man-in-the-middle attacks on the management of the appliance."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-29075",
        "datePublished": "2021-02-23T03:18:50.226528Z",
        "description": {
            "lang": "en",
            "value": "Acrobat Reader DC versions 2020.013.20066 (and earlier), 2020.001.30010 (and earlier) and 2017.011.30180 (and earlier) are affected by an information exposure vulnerability, that could enable an attacker to get a DNS interaction and track if the user has opened or closed a PDF file when loaded from the filesystem without a prompt. User interaction is required to exploit this vulnerability."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.1,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-29144",
        "datePublished": "2020-11-27T03:35:38",
        "description": {
            "lang": "en",
            "value": "In Ericsson BSCS iX R18 Billing & Rating iX R18, MX is a web base module in BSCS iX that is vulnerable to stored XSS via an Alert Dashboard comment. In most test cases, session hijacking was also possible by utilizing the XSS vulnerability. This potentially allows for full account takeover, or exploiting admins' browsers by using the beef framework."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-29145",
        "datePublished": "2020-11-27T03:35:21",
        "description": {
            "lang": "en",
            "value": "In Ericsson BSCS iX R18 Billing & Rating iX R18, ADMX is a web base module in BSCS iX that is vulnerable to stored XSS via the name or description field to a solutionUnitServlet?SuName=UserReferenceDataSU Access Rights Group. In most test cases, session hijacking was also possible by utilizing the XSS vulnerability. This potentially allows for full account takeover, or exploiting admins' browsers by using the beef framework."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-29157",
        "datePublished": "2021-07-14T19:59:14",
        "description": {
            "lang": "en",
            "value": "An issue in RAONWIZ K Editor v2018.0.0.10 allows attackers to perform a DLL hijacking attack when the service or system is restarted."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-29292",
        "datePublished": "2021-12-30T16:11:55",
        "description": {
            "lang": "en",
            "value": "iBall WRD12EN 1.0.0 devices allow cross-site request forgery (CSRF) attacks as demonstrated by enabling DNS settings or modifying the range for IP addresses."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-29380",
        "datePublished": "2020-11-29T00:46:34",
        "description": {
            "lang": "en",
            "value": "An issue was discovered on V-SOL V1600D V2.03.69 and V2.03.57, V1600D4L V1.01.49, V1600D-MINI V1.01.48, V1600G1 V2.0.7 and V1.9.7, and V1600G2 V1.1.4 OLT devices. TELNET is offered by default but SSH is not always available. An attacker can intercept passwords sent in cleartext and conduct a man-in-the-middle attack on the management of the appliance."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-29654",
        "datePublished": "2020-12-11T23:46:01",
        "description": {
            "lang": "en",
            "value": "Western Digital Dashboard before 3.2.2.9 allows DLL Hijacking that leads to compromise of the SYSTEM account."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-2002",
        "datePublished": "2020-05-13T19:07:14.142942Z",
        "description": {
            "lang": "en",
            "value": "An authentication bypass by spoofing vulnerability exists in the authentication daemon and User-ID components of Palo Alto Networks PAN-OS by failing to verify the integrity of the Kerberos key distribution center (KDC) before authenticating users. This affects all forms of authentication that use a Kerberos authentication profile. A man-in-the-middle type of attacker with the ability to intercept communication between PAN-OS and KDC can login to PAN-OS as an administrator. This issue affects: PAN-OS 7.1 versions earlier than 7.1.26; PAN-OS 8.1 versions earlier than 8.1.13; PAN-OS 9.0 versions earlier than 9.0.6; All version of PAN-OS 8.0."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 8.1,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle",
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-2031",
        "datePublished": "2020-07-08T16:35:17.389144Z",
        "description": {
            "lang": "en",
            "value": "An integer underflow vulnerability in the dnsproxyd component of the PAN-OS management interface allows authenticated administrators to issue a command from the command line interface that causes the component to stop responding. Repeated attempts to send this request result in denial of service to all PAN-OS services by restarting the device and putting it into maintenance mode. This issue impacts: PAN-OS 9.1 versions earlier than PAN-OS 9.1.3. This issue does not impact PAN-OS 8.1, PAN-OS 9.0, or Prisma Access services."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-2033",
        "datePublished": "2020-06-10T17:29:41.793194Z",
        "description": {
            "lang": "en",
            "value": "When the pre-logon feature is enabled, a missing certification validation in Palo Alto Networks GlobalProtect app can disclose the pre-logon authentication cookie to a man-in-the-middle attacker on the same local area network segment with the ability to manipulate ARP or to conduct ARP spoofing attacks. This allows the attacker to access the GlobalProtect Server as allowed by configured Security rules for the 'pre-login' user. This access may be limited compared to the network access of regular users. This issue affects: GlobalProtect app 5.0 versions earlier than GlobalProtect app 5.0.10 when the prelogon feature is enabled; GlobalProtect app 5.1 versions earlier than GlobalProtect app 5.1.4 when the prelogon feature is enabled."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle",
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-2146",
        "datePublished": "2020-03-09T15:01:01",
        "description": {
            "lang": "en",
            "value": "Jenkins Mac Plugin 1.1.0 and earlier does not validate SSH host keys when connecting agents created by the plugin, enabling man-in-the-middle attacks."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-2185",
        "datePublished": "2020-05-06T12:45:24",
        "description": {
            "lang": "en",
            "value": "Jenkins Amazon EC2 Plugin 1.50.1 and earlier does not validate SSH host keys when connecting agents, enabling man-in-the-middle attacks."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-2187",
        "datePublished": "2020-05-06T12:45:25",
        "description": {
            "lang": "en",
            "value": "Jenkins Amazon EC2 Plugin 1.50.1 and earlier unconditionally accepts self-signed certificates and does not perform hostname validation, enabling man-in-the-middle attacks."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-35138",
        "datePublished": "2021-03-29T19:36:38",
        "description": {
            "lang": "en",
            "value": "The MobileIron agents through 2021-03-22 for Android and iOS contain a hardcoded encryption key, used to encrypt the submission of username/password details during the authentication process, as demonstrated by Mobile@Work (aka com.mobileiron). The key is in the com/mobileiron/common/utils/C4928m.java file. NOTE: It has been asserted that there is no causality or connection between credential encryption and the MiTM attack"
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-35145",
        "datePublished": "2021-01-29T06:49:39",
        "description": {
            "lang": "en",
            "value": "Acronis True Image for Windows prior to 2021 Update 3 allowed local privilege escalation due to a DLL hijacking vulnerability in multiple components, aka an Untrusted Search Path issue."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-35659",
        "datePublished": "2020-12-24T15:59:04",
        "description": {
            "lang": "en",
            "value": "The DNS query log in Pi-hole before 5.2.2 is vulnerable to stored XSS. An attacker with the ability to directly or indirectly query DNS with a malicious hostname can cause arbitrary JavaScript to execute when the Pi-hole administrator visits the Query Log or Long-term data Query Log page."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-35857",
        "datePublished": "2020-12-31T00:00:00",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in the trust-dns-server crate before 0.18.1 for Rust. DNS MX and SRV null targets are mishandled, causing stack consumption."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-36128",
        "datePublished": "2021-05-07T10:34:41",
        "description": {
            "lang": "en",
            "value": "Pax Technology PAXSTORE v7.0.8_20200511171508 and lower is affected by a token spoofing vulnerability. Each payment terminal has a session token (called X-Terminal-Token) to access the marketplace. This allows the store to identify the terminal and make available the applications distributed by its reseller. By intercepting HTTPS traffic from the application store, it is possible to collect the request responsible for assigning the X-Terminal-Token to the terminal, which makes it possible to craft an X-Terminal-Token pretending to be another device. An attacker can use this behavior to authenticate its own payment terminal in the application store through token impersonation."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-36232",
        "datePublished": "2021-02-22T20:46:59.290734Z",
        "description": {
            "lang": "en",
            "value": "The MessageBundleWhiteList class of atlassian-gadgets before version 4.2.37, from version 4.3.0 before 4.3.14, from version 4.3.2.0 before 4.3.2.4, from version 4.4.0 before 4.4.12, and from version 5.0.0 before 5.0.1 allowed unexpected DNS lookups and requests to arbitrary services as it incorrectly obtained application base url information from the executing http request which could be attacker controlled."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-36283",
        "datePublished": "2021-03-24T15:23:29",
        "description": {
            "lang": "en",
            "value": "HID OMNIKEY 5427 and OMNIKEY 5127 readers are vulnerable to CSRF when using the EEM driver (Ethernet Emulation Mode). By persuading an authenticated user to visit a malicious Web site, a remote attacker could send a malformed HTTP request to upload a configuration file to the device. An attacker could exploit this vulnerability to perform cross-site scripting attacks, Web cache poisoning, and other malicious activities."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 9.6,
                "severity": "CRITICAL"
            }
        ],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-36473",
        "datePublished": "2021-08-14T20:49:56",
        "description": {
            "lang": "en",
            "value": "UCWeb UC 12.12.3.1219 through 12.12.3.1226 uses cleartext HTTP, and thus man-in-the-middle attackers can discover visited URLs."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-36474",
        "datePublished": "2021-08-20T14:14:29",
        "description": {
            "lang": "en",
            "value": "SafeCurl before 0.9.2 has a DNS rebinding vulnerability."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-36517",
        "datePublished": "2022-03-07T21:08:01",
        "description": {
            "lang": "en",
            "value": "An information leak in Nabu Casa Home Assistant Operating System and Home Assistant Supervised 2022.03 allows a DNS operator to gain knowledge about internal network resources via the hardcoded DNS resolver configuration."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-36519",
        "datePublished": "2022-03-15T23:45:01",
        "description": {
            "lang": "en",
            "value": "Mimecast Email Security before 2020-01-10 allows any admin to spoof any domain, and pass DMARC alignment via SPF. This occurs through misuse of the address rewrite feature. (The domain being spoofed must be a customer in the Mimecast grid from which the spoofing occurs.)"
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-36784",
        "datePublished": "2024-02-28T08:13:05.418Z",
        "description": {
            "lang": "en",
            "value": "In the Linux kernel, the following vulnerability has been resolved:\n\ni2c: cadence: fix reference leak when pm_runtime_get_sync fails\n\nThe PM reference count is not expected to be incremented on\nreturn in functions cdns_i2c_master_xfer and cdns_reg_slave.\n\nHowever, pm_runtime_get_sync will increment pm usage counter\neven failed. Forgetting to putting operation will result in a\nreference leak here.\n\nReplace it with pm_runtime_resume_and_get to keep usage\ncounter balanced."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-3125",
        "datePublished": "2020-05-06T16:35:25.682779Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the Kerberos authentication feature of Cisco Adaptive Security Appliance (ASA) Software could allow an unauthenticated, remote attacker to impersonate the Kerberos key distribution center (KDC) and bypass authentication on an affected device that is configured to perform Kerberos authentication for VPN or local device access. The vulnerability is due to insufficient identity verification of the KDC when a successful authentication response is received. An attacker could exploit this vulnerability by spoofing the KDC server response to the ASA device. This malicious response would not have been authenticated by the KDC. A successful attack could allow an attacker to bypass Kerberos authentication."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.1,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-3153",
        "datePublished": "2020-02-19T19:15:53.412807Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the installer component of Cisco AnyConnect Secure Mobility Client for Windows could allow an authenticated local attacker to copy user-supplied files to system level directories with system level privileges. The vulnerability is due to the incorrect handling of directory paths. An attacker could exploit this vulnerability by creating a malicious file and copying the file to a system directory. An exploit could allow the attacker to copy malicious files to arbitrary locations with system level privileges. This could include DLL pre-loading, DLL hijacking, and other related attacks. To exploit this vulnerability, the attacker needs valid credentials on the Windows system."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-3155",
        "datePublished": "2020-03-04T18:40:32.322145Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the SSL implementation of the Cisco Intelligent Proximity solution could allow an unauthenticated, remote attacker to view or alter information shared on Cisco Webex video devices and Cisco collaboration endpoints if the products meet the conditions described in the Vulnerable Products section. The vulnerability is due to a lack of validation of the SSL server certificate received when establishing a connection to a Cisco Webex video device or a Cisco collaboration endpoint. An attacker could exploit this vulnerability by using man in the middle (MITM) techniques to intercept the traffic between the affected client and an endpoint, and then using a forged certificate to impersonate the endpoint. Depending on the configuration of the endpoint, an exploit could allow the attacker to view presentation content shared on it, modify any content being presented by the victim, or have access to call controls. This vulnerability does not affect cloud registered collaboration endpoints."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.4,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-3182",
        "datePublished": "2020-03-04T18:35:21.397787Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the multicast DNS (mDNS) protocol configuration of Cisco Webex Meetings Client for MacOS could allow an unauthenticated adjacent attacker to obtain sensitive information about the device on which the Webex client is running. The vulnerability exists because sensitive information is included in the mDNS reply. An attacker could exploit this vulnerability by doing an mDNS query for a particular service against an affected device. A successful exploit could allow the attacker to gain access to sensitive information."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 4.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-3191",
        "datePublished": "2020-05-06T16:41:16.093868Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in DNS over IPv6 packet processing for Cisco Adaptive Security Appliance (ASA) Software and Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to cause the device to unexpectedly reload, resulting in a denial of service (DoS) condition. The vulnerability is due to improper length validation of a field in an IPv6 DNS packet. An attacker could exploit this vulnerability by sending a crafted DNS query over IPv6, which traverses the affected device. An exploit could allow the attacker to cause the device to reload, resulting in a DoS condition. This vulnerability is specific to DNS over IPv6 traffic only."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.6,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-3220",
        "datePublished": "2020-06-03T17:41:40.234773Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the hardware crypto driver of Cisco IOS XE Software for Cisco 4300 Series Integrated Services Routers and Cisco Catalyst 9800-L Wireless Controllers could allow an unauthenticated, remote attacker to disconnect legitimate IPsec VPN sessions to an affected device. The vulnerability is due to insufficient verification of authenticity of received Encapsulating Security Payload (ESP) packets. An attacker could exploit this vulnerability by tampering with ESP cleartext values as a man-in-the-middle."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-3359",
        "datePublished": "2020-09-24T18:02:40.637372Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the multicast DNS (mDNS) feature of Cisco IOS XE Software for Cisco Catalyst 9800 Series Wireless Controllers could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition. The vulnerability is due to improper validation of mDNS packets. An attacker could exploit this vulnerability by sending a crafted mDNS packet to an affected device. A successful exploit could cause a device to reload, resulting in a DoS condition."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.6,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-3408",
        "datePublished": "2020-09-24T18:01:59.804395Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the Split DNS feature of Cisco IOS Software and Cisco IOS XE Software could allow an unauthenticated, remote attacker to cause an affected device to reload, resulting in a denial of service (DoS) condition. The vulnerability occurs because the regular expression (regex) engine that is used with the Split DNS feature of affected releases may time out when it processes the DNS name list configuration. An attacker could exploit this vulnerability by trying to resolve an address or hostname that the affected device handles. A successful exploit could allow the attacker to cause the device to reload, resulting in a DoS condition."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.6,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-3433",
        "datePublished": "2020-08-17T18:01:06.828310Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the interprocess communication (IPC) channel of Cisco AnyConnect Secure Mobility Client for Windows could allow an authenticated, local attacker to perform a DLL hijacking attack. To exploit this vulnerability, the attacker would need to have valid credentials on the Windows system. The vulnerability is due to insufficient validation of resources that are loaded by the application at run time. An attacker could exploit this vulnerability by sending a crafted IPC message to the AnyConnect process. A successful exploit could allow the attacker to execute arbitrary code on the affected machine with SYSTEM privileges. To exploit this vulnerability, the attacker would need to have valid credentials on the Windows system."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-3492",
        "datePublished": "2020-09-24T17:52:16.071802Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the Flexible NetFlow Version 9 packet processor of Cisco IOS XE Software for Cisco Catalyst 9800 Series Wireless Controllers and Cisco AireOS Software for Cisco Wireless LAN Controllers (WLC) could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device. The vulnerability is due to insufficient validation of certain parameters in a Flexible NetFlow Version 9 record. An attacker could exploit this vulnerability by spoofing the address of an existing Access Point on the network and sending a Control and Provisioning of Wireless Access Points (CAPWAP) packet that includes a crafted Flexible NetFlow Version 9 record to an affected device. A successful exploit could allow the attacker to cause a process crash that would lead to a reload of the device."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.6,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-3510",
        "datePublished": "2020-09-24T17:51:44.121872Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the Umbrella Connector component of Cisco IOS XE Software for Cisco Catalyst 9200 Series Switches could allow an unauthenticated, remote attacker to trigger a reload, resulting in a denial of service condition on an affected device. The vulnerability is due to insufficient error handling when parsing DNS requests. An attacker could exploit this vulnerability by sending a series of malicious DNS requests to an Umbrella Connector client interface of an affected device. A successful exploit could allow the attacker to cause a crash of the iosd process, which triggers a reload of the affected device."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.6,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-3549",
        "datePublished": "2020-10-21T18:35:24.890607Z",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the sftunnel functionality of Cisco Firepower Management Center (FMC) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to obtain the device registration hash. The vulnerability is due to insufficient sftunnel negotiation protection during initial device registration. An attacker in a man-in-the-middle position could exploit this vulnerability by intercepting a specific flow of the sftunnel communication between an FMC device and an FTD device. A successful exploit could allow the attacker to decrypt and modify the sftunnel communication between FMC and FTD devices, allowing the attacker to modify configuration data sent from an FMC device to an FTD device or alert data sent from an FTD device to an FMC device."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 8.1,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-3768",
        "datePublished": "2020-06-26T20:19:51",
        "description": {
            "lang": "en",
            "value": "ColdFusion versions ColdFusion 2016, and ColdFusion 2018 have a dll search-order hijacking vulnerability. Successful exploitation could lead to privilege escalation."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-3803",
        "datePublished": "2020-03-25T17:28:44",
        "description": {
            "lang": "en",
            "value": "Adobe Acrobat and Reader versions 2020.006.20034 and earlier, 2017.011.30158 and earlier, 2017.011.30158 and earlier, 2015.006.30510 and earlier, and 2015.006.30510 and earlier have an insecure library loading (dll hijacking) vulnerability. Successful exploitation could lead to privilege escalation."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-3833",
        "datePublished": "2020-02-27T20:45:04",
        "description": {
            "lang": "en",
            "value": "An inconsistent user interface issue was addressed with improved state management. This issue is fixed in Safari 13.0.5. Visiting a malicious website may lead to address bar spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-3929",
        "datePublished": "2020-06-12T08:25:23.476254Z",
        "description": {
            "lang": "en",
            "value": "GeoVision Door Access Control device family employs shared cryptographic private keys for SSH and HTTPS. Attackers may conduct MITM attack with the derived keys and plaintext recover of encrypted messages."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-3993",
        "datePublished": "2020-10-20T16:11:19",
        "description": {
            "lang": "en",
            "value": "VMware NSX-T (3.x before 3.0.2, 2.5.x before 2.5.2.2.0) contains a security vulnerability that exists in the way it allows a KVM host to download and install packages from NSX manager. A malicious actor with MITM positioning may be able to exploit this issue to compromise the transport node."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-4059",
        "datePublished": "2020-06-18T19:25:15",
        "description": {
            "lang": "en",
            "value": "In mversion before 2.0.0, there is a command injection vulnerability. This issue may lead to remote code execution if a client of the library calls the vulnerable method with untrusted input. This vulnerability is patched by version 2.0.0. Previous releases are deprecated in npm. As a workaround, make sure to escape git commit messages when using the commitMessage option for the update function."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.3,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-4329",
        "datePublished": "2020-04-28T13:30:15.230620Z",
        "description": {
            "lang": "en",
            "value": "IBM WebSphere Application Server 7.0, 8.0, 8.5, 9.0 and Liberty 17.0.0.3 through 20.0.0.4 could allow a remote, authenticated attacker to obtain sensitive information, caused by improper parameter checking. This could be exploited to conduct spoofing attacks. IBM X-Force ID: 177841."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 4.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-4471",
        "datePublished": "2020-06-15T13:25:26.806024Z",
        "description": {
            "lang": "en",
            "value": "IBM Spectrum Protect Plus 10.1.0 through 10.1.5 could allow an unauthenticated attacker to cause a denial of service or hijack DNS sessions by send a specially crafted HTTP command to the remote server. IBM X-Force ID: 181726."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 4.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-4496",
        "datePublished": "2021-12-13T18:35:29.007072Z",
        "description": {
            "lang": "en",
            "value": "The IBM Spectrum Protect Plus 10.1.0.0 through 10.1.8.x server connection to an IBM Spectrum Protect Plus workload agent is subject to a man-in-the-middle attack due to improper certificate validation. IBM X-Force ID: 182046."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-4623",
        "datePublished": "2021-07-26T12:10:32.789950Z",
        "description": {
            "lang": "en",
            "value": "IBM i2 iBase 8.9.13 could allow a local authenticated attacker to execute arbitrary code on the system, caused by a DLL search order hijacking flaw. By using a specially-crafted .DLL file, an attacker could exploit this vulnerability to execute arbitrary code on the system. IBM X-Force ID: 184984."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.7,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-4706",
        "datePublished": "2021-08-17T13:55:12.216858Z",
        "description": {
            "lang": "en",
            "value": "IBM API Connect 5.0.0.0 through 5.0.8.10 is vulnerable to HTTP header injection, caused by improper validation of input by the HOST headers. By sending a specially crafted HTTP request, a remote attacker could exploit this vulnerability to inject HTTP HOST header, which will allow the attacker to conduct various attacks against the vulnerable system, including cross-site scripting, cache poisoning or session hijacking. IBM X-Force ID: 187194."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 5.4,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning",
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-4719",
        "datePublished": "2021-03-02T16:55:18.430464Z",
        "description": {
            "lang": "en",
            "value": "The IBM Cloud APM 8.1.4 server will issue a DNS request to resolve any hostname specified in the Cloud Event Management Webhook URL configuration definition. This could enable an authenticated user with admin authorization to create DNS query strings that are not hostnames. IBM X-Force ID: 187861."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 4.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-4739",
        "datePublished": "2020-11-20T13:50:14.651408Z",
        "description": {
            "lang": "en",
            "value": "IBM DB2 Accessories Suite for Linux, UNIX, and Windows, DB2 for Linux, UNIX and Windows (includes DB2 Connect Server) 9.7, 10.1, 10.5, 11.1, and 11.5 could allow a local authenticated attacker to execute arbitrary code on the system, caused by DLL search order hijacking vulnerability in Microsoft Windows client. By placing a specially crafted file in a compromised folder, an attacker could exploit this vulnerability to execute arbitrary code on the system. IBM X-Force ID: 188149."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 7.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-4828",
        "datePublished": "2021-02-04T16:55:39.721532Z",
        "description": {
            "lang": "en",
            "value": "IBM API Connect 10.0.0.0 through 10.0.1.0 and 2018.4.1.0 through 2018.4.1.13 is vulnerable to web cache poisoning, caused by improper input validation by modifying HTTP request headers. IBM X-Force ID: 189842."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-4896",
        "datePublished": "2021-01-07T17:40:29.367042Z",
        "description": {
            "lang": "en",
            "value": "IBM Emptoris Sourcing 10.1.0, 10.1.1, and 10.1.3 is vulnerable to web cache poisoning, caused by improper input validation by modifying HTTP request headers. IBM X-Force ID: 190987."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-5019",
        "datePublished": "2021-01-08T19:10:24.331102Z",
        "description": {
            "lang": "en",
            "value": "IBM Spectrum Protect Plus 10.1.0 through 10.1.6 is vulnerable to HTTP header injection, caused by improper validation of input by the HOST headers. By sending a specially crafted HTTP request, a remote attacker could exploit this vulnerability to inject HTTP HOST header, which will allow the attacker to conduct various attacks against the vulnerable system, including cross-site scripting, cache poisoning or session hijacking. IBM X-Force ID: 193655."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.5,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning",
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-5130",
        "datePublished": "2020-07-17T17:15:14",
        "description": {
            "lang": "en",
            "value": "SonicOS SSLVPN LDAP login request allows remote attackers to cause external service interaction (DNS) due to improper validation of the request. This vulnerability impact SonicOS version 6.5.4.4-44n and earlier."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-5132",
        "datePublished": "2020-09-30T05:25:11",
        "description": {
            "lang": "en",
            "value": "SonicWall SSL-VPN products and SonicWall firewall SSL-VPN feature misconfiguration leads to possible DNS flaw known as domain name collision vulnerability. When the users publicly display their organization’s internal domain names in the SSL-VPN authentication page, an attacker with knowledge of internal domain names can potentially take advantage of this vulnerability."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-5144",
        "datePublished": "2020-10-28T10:40:15",
        "description": {
            "lang": "en",
            "value": "SonicWall Global VPN client version 4.10.4.0314 and earlier allows unprivileged windows user to elevate privileges to SYSTEM through loaded process hijacking vulnerability."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-5145",
        "datePublished": "2020-10-28T10:40:15",
        "description": {
            "lang": "en",
            "value": "SonicWall Global VPN client version 4.10.4.0314 and earlier have an insecure library loading (DLL hijacking) vulnerability. Successful exploitation could lead to remote code execution in the target system."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-5200",
        "datePublished": "2024-04-30T00:00:00",
        "description": {
            "lang": "en",
            "value": "Minerbabe through V4.16 ships with SSH host keys baked into the installation image, which allows man-in-the-middle attacks and makes identification of all public IPv4 nodes trivial with Shodan.io."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-5202",
        "datePublished": "2020-01-21T17:54:04",
        "description": {
            "lang": "en",
            "value": "apt-cacher-ng through 3.3 allows local users to obtain sensitive information by hijacking the hardcoded TCP port. The /usr/lib/apt-cacher-ng/acngtool program attempts to connect to apt-cacher-ng via TCP on localhost port 3142, even if the explicit SocketPath=/var/run/apt-cacher-ng/socket command-line option is passed. The cron job /etc/cron.daily/apt-cacher-ng (which is active by default) attempts this periodically. Because 3142 is an unprivileged port, any local user can try to bind to this port and will receive requests from acngtool. There can be sensitive data in these requests, e.g., if AdminAuth is enabled in /etc/apt-cacher-ng/security.conf. This sensitive data can leak to unprivileged local users that manage to bind to this port before the apt-cacher-ng daemon can."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-5300",
        "datePublished": "2020-04-06T16:30:14",
        "description": {
            "lang": "en",
            "value": "In Hydra (an OAuth2 Server and OpenID Certified™ OpenID Connect Provider written in Go), before version 1.4.0+oryOS.17, when using client authentication method 'private_key_jwt' [1], OpenId specification says the following about assertion `jti`: \"A unique identifier for the token, which can be used to prevent reuse of the token. These tokens MUST only be used once, unless conditions for reuse were negotiated between the parties\". Hydra does not check the uniqueness of this `jti` value. Exploiting this vulnerability is somewhat difficult because: - TLS protects against MITM which makes it difficult to intercept valid tokens for replay attacks - The expiry time of the JWT gives only a short window of opportunity where it could be replayed This has been patched in version v1.4.0+oryOS.17"
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-5347",
        "datePublished": "2020-04-03T23:20:14.052775Z",
        "description": {
            "lang": "en",
            "value": "Dell EMC Isilon OneFS versions 8.2.2 and earlier contain a denial of service vulnerability. SmartConnect had an error condition that may be triggered to loop, using CPU and potentially preventing other SmartConnect DNS responses."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.3,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-5367",
        "datePublished": "2020-06-23T20:00:17.667661Z",
        "description": {
            "lang": "en",
            "value": "Dell EMC Unisphere for PowerMax versions prior to 9.1.0.17, Dell EMC Unisphere for PowerMax Virtual Appliance versions prior to 9.1.0.17, and PowerMax OS Release 5978 contain an improper certificate validation vulnerability. An unauthenticated remote attacker may potentially exploit this vulnerability to carry out a man-in-the-middle attack by supplying a crafted certificate and intercepting the victim's traffic to view or modify a victim's data in transit."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.4,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-5415",
        "datePublished": "2020-08-12T16:40:14.465847Z",
        "description": {
            "lang": "en",
            "value": "Concourse, versions prior to 6.3.1 and 6.4.1, in installations which use the GitLab auth connector, is vulnerable to identity spoofing by way of configuring a GitLab account with the same full name as another user who is granted access to a Concourse team. GitLab groups do not have this vulnerability, so GitLab users may be moved into groups which are then configured in the Concourse team."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 10,
                "severity": "CRITICAL"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-5419",
        "datePublished": "2020-08-31T15:05:20.057877Z",
        "description": {
            "lang": "en",
            "value": "RabbitMQ versions 3.8.x prior to 3.8.7 are prone to a Windows-specific binary planting security vulnerability that allows for arbitrary code execution. An attacker with write privileges to the RabbitMQ installation directory and local access on Windows could carry out a local binary hijacking (planting) attack and execute arbitrary code."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.7,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-5520",
        "datePublished": "2020-01-27T09:35:27",
        "description": {
            "lang": "en",
            "value": "The netprint App for iOS 3.2.3 and earlier does not verify X.509 certificates from servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-5521",
        "datePublished": "2020-01-27T09:35:27",
        "description": {
            "lang": "en",
            "value": "The kantan netprint App for iOS 2.0.2 and earlier does not verify X.509 certificates from servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-5522",
        "datePublished": "2020-01-27T09:35:27",
        "description": {
            "lang": "en",
            "value": "The kantan netprint App for Android 2.0.3 and earlier does not verify X.509 certificates from servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-5523",
        "datePublished": "2020-01-28T05:25:48",
        "description": {
            "lang": "en",
            "value": "Android App 'MyPallete' and some of the Android banking applications based on 'MyPallete' do not verify X.509 certificates from servers, and also do not properly validate certificates with host-mismatch, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-5526",
        "datePublished": "2020-01-31T03:35:17",
        "description": {
            "lang": "en",
            "value": "The AWMS Mobile App for Android 2.0.0 to 2.0.5 and for iOS 2.0.0 to 2.0.8 does not verify X.509 certificates from servers, which allows man-in-the-middle attackers to spoof servers and obtain sensitive information via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-5591",
        "datePublished": "2020-06-05T10:05:15",
        "description": {
            "lang": "en",
            "value": "XACK DNS 1.11.0 to 1.11.4, 1.10.0 to 1.10.8, 1.8.0 to 1.8.23, 1.7.0 to 1.7.18, and versions before 1.7.0 allow remote attackers to cause a denial of service condition resulting in degradation of the recursive resolver's performance or compromising the recursive resolver as a reflector in a reflection attack."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-5604",
        "datePublished": "2020-07-09T01:05:20",
        "description": {
            "lang": "en",
            "value": "Android App 'Mercari' (Japan version) prior to version 3.52.0 allows arbitrary method execution of a Java object by a remote attacker via a Man-In-The-Middle attack by using Java Reflection API of JavaScript code on WebView."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-5684",
        "datePublished": "2020-12-24T01:20:20",
        "description": {
            "lang": "en",
            "value": "iSM client versions from V5.1 prior to V12.1 running on NEC Storage Manager or NEC Storage Manager Express does not verify a server certificate properly, which allows a man-in-the-middle attacker to eavesdrop on an encrypted communication or alter the communication via a crafted certificate."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-5753",
        "datePublished": "2020-05-20T13:40:19",
        "description": {
            "lang": "en",
            "value": "Signal Private Messenger Android v4.59.0 and up and iOS v3.8.1.5 and up allows a remote non-contact to ring a victim's Signal phone and disclose currently used DNS server due to ICE Candidate handling before call is answered or declined."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-5780",
        "datePublished": "2020-09-10T14:10:03",
        "description": {
            "lang": "en",
            "value": "Missing Authentication for Critical Function in Icegram Email Subscribers & Newsletters Plugin for WordPress prior to version 4.5.6 allows a remote, unauthenticated attacker to conduct unauthenticated email forgery/spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-5812",
        "datePublished": "2021-02-05T23:44:56",
        "description": {
            "lang": "en",
            "value": "Nessus AMI versions 8.12.0 and earlier were found to either not validate, or incorrectly validate, a certificate which could allow an attacker to spoof a trusted entity by using a man-in-the-middle (MITM) attack."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-5865",
        "datePublished": "2020-04-23T18:16:00",
        "description": {
            "lang": "en",
            "value": "In versions prior to 3.3.0, the NGINX Controller is configured to communicate with its Postgres database server over unencrypted channels, making the communicated data vulnerable to interception via man-in-the-middle (MiTM) attacks."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle",
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-5913",
        "datePublished": "2020-08-26T14:03:08",
        "description": {
            "lang": "en",
            "value": "In versions 15.0.0-15.1.0.1, 14.1.0-14.1.2.3, 13.1.0-13.1.3.4, 12.1.0-12.1.5.1, and 11.6.1-11.6.5.2, the BIG-IP Client or Server SSL profile ignores revoked certificates, even when a valid CRL is present. This impacts SSL/TLS connections and may result in a man-in-the-middle attack on the connections."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-5935",
        "datePublished": "2020-10-29T15:07:59",
        "description": {
            "lang": "en",
            "value": "On BIG-IP (LTM, AAM, AFM, Analytics, APM, ASM, DNS, FPS, GTM, Link Controller, PEM) versions 15.1.0-15.1.0.5, 14.1.0-14.1.2.3, and 13.1.0-13.1.3.3, when handling MQTT traffic through a BIG-IP virtual server associated with an MQTT profile and an iRule performing manipulations on that traffic, TMM may produce a core file."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-5944",
        "datePublished": "2020-11-05T19:24:40",
        "description": {
            "lang": "en",
            "value": "In BIG-IQ 7.1.0, accessing the DoS Summary events and DNS Overview pages in the BIG-IQ system interface returns an error message due to disabled Grafana reverse proxy in web service configuration. F5 has done further review of this vulnerability and has re-classified it as a defect. CVE-2020-5944 will continue to be referenced in F5 Security Advisory K57274211 and will not be assigned to other F5 vulnerabilities."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-6071",
        "datePublished": "2020-03-24T20:43:17",
        "description": {
            "lang": "en",
            "value": "An exploitable denial-of-service vulnerability exists in the resource record-parsing functionality of Videolabs libmicrodns 0.1.0. When parsing compressed labels in mDNS messages, the compression pointer is followed without checking for recursion, leading to a denial of service. An attacker can send an mDNS message to trigger this vulnerability."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-6072",
        "datePublished": "2020-03-24T20:43:25",
        "description": {
            "lang": "en",
            "value": "An exploitable code execution vulnerability exists in the label-parsing functionality of Videolabs libmicrodns 0.1.0. When parsing compressed labels in mDNS messages, the rr_decode function's return value is not checked, leading to a double free that could be exploited to execute arbitrary code. An attacker can send an mDNS message to trigger this vulnerability."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 9.8,
                "severity": "CRITICAL"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-6073",
        "datePublished": "2020-03-24T20:43:10",
        "description": {
            "lang": "en",
            "value": "An exploitable denial-of-service vulnerability exists in the TXT record-parsing functionality of Videolabs libmicrodns 0.1.0. When parsing the RDATA section in a TXT record in mDNS messages, multiple integer overflows can be triggered, leading to a denial of service. An attacker can send an mDNS message to trigger this vulnerability."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-6077",
        "datePublished": "2020-03-24T20:39:22",
        "description": {
            "lang": "en",
            "value": "An exploitable denial-of-service vulnerability exists in the message-parsing functionality of Videolabs libmicrodns 0.1.0. When parsing mDNS messages, the implementation does not properly keep track of the available data in the message, possibly leading to an out-of-bounds read that would result in a denial of service. An attacker can send an mDNS message to trigger this vulnerability."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-6078",
        "datePublished": "2020-03-24T20:39:31",
        "description": {
            "lang": "en",
            "value": "An exploitable denial-of-service vulnerability exists in the message-parsing functionality of Videolabs libmicrodns 0.1.0. When parsing mDNS messages in mdns_recv, the return value of the mdns_read_header function is not checked, leading to an uninitialized variable usage that eventually results in a null pointer dereference, leading to service crash. An attacker can send a series of mDNS messages to trigger this vulnerability."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-6079",
        "datePublished": "2020-03-24T20:49:46",
        "description": {
            "lang": "en",
            "value": "An exploitable denial-of-service vulnerability exists in the resource allocation handling of Videolabs libmicrodns 0.1.0. When encountering errors while parsing mDNS messages, some allocated data is not freed, possibly leading to a denial-of-service condition via resource exhaustion. An attacker can send one mDNS message repeatedly to trigger this vulnerability through decoding of the domain name performed by rr_decode."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-6080",
        "datePublished": "2020-03-24T20:50:24",
        "description": {
            "lang": "en",
            "value": "An exploitable denial-of-service vulnerability exists in the resource allocation handling of Videolabs libmicrodns 0.1.0. When encountering errors while parsing mDNS messages, some allocated data is not freed, possibly leading to a denial-of-service condition via resource exhaustion. An attacker can send one mDNS message repeatedly to trigger this vulnerability through the function rr_read_RR [5] reads the current resource record, except for the RDATA section. This is read by the loop at in rr_read. For each RR type, a different function is called. When the RR type is 0x10, the function rr_read_TXT is called at [6]."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.5,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-6157",
        "datePublished": "2020-11-13T19:26:16",
        "description": {
            "lang": "en",
            "value": "Opera Touch for iOS before version 2.4.5 is vulnerable to an address bar spoofing attack. The vulnerability allows a malicious page to trick the browser into showing an address of a different page. This may allow the malicious page to impersonate another page and trick a user into providing sensitive data."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-6223",
        "datePublished": "2020-04-14T18:07:00",
        "description": {
            "lang": "en",
            "value": "The open document of SAP Business Objects Business Intelligence Platform, versions 4.1, 4.2, allows an attacker to modify certain error pages to include malicious content. This can misdirect a user who is tricked into accessing these error pages rendered by the application, leading to Content Spoofing."
        },
        "metrics": [
            {
                "type": "cvssV3_0",
                "baseScore": 6.1,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-6401",
        "datePublished": "2020-02-11T14:42:11",
        "description": {
            "lang": "en",
            "value": "Insufficient validation of untrusted input in Omnibox in Google Chrome prior to 80.0.3987.87 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-6411",
        "datePublished": "2020-02-11T14:42:11",
        "description": {
            "lang": "en",
            "value": "Insufficient validation of untrusted input in Omnibox in Google Chrome prior to 80.0.3987.87 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-6412",
        "datePublished": "2020-02-11T14:42:12",
        "description": {
            "lang": "en",
            "value": "Insufficient validation of untrusted input in Omnibox in Google Chrome prior to 80.0.3987.87 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-6460",
        "datePublished": "2020-05-21T03:46:05",
        "description": {
            "lang": "en",
            "value": "Insufficient data validation in URL formatting in Google Chrome prior to 81.0.4044.122 allowed a remote attacker to perform domain spoofing via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-6481",
        "datePublished": "2020-05-21T03:46:15",
        "description": {
            "lang": "en",
            "value": "Insufficient policy enforcement in URL formatting in Google Chrome prior to 83.0.4103.61 allowed a remote attacker to perform domain spoofing via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-6497",
        "datePublished": "2020-06-03T22:50:38",
        "description": {
            "lang": "en",
            "value": "Insufficient policy enforcement in Omnibox in Google Chrome on iOS prior to 83.0.4103.88 allowed a remote attacker to perform domain spoofing via a crafted URI."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-6498",
        "datePublished": "2020-06-03T22:50:38",
        "description": {
            "lang": "en",
            "value": "Incorrect implementation in user interface in Google Chrome on iOS prior to 83.0.4103.88 allowed a remote attacker to perform domain spoofing via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-6557",
        "datePublished": "2020-11-03T02:21:49",
        "description": {
            "lang": "en",
            "value": "Inappropriate implementation in networking in Google Chrome prior to 86.0.4240.75 allowed a remote attacker to perform domain spoofing via a crafted HTML page."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-6571",
        "datePublished": "2020-09-21T19:06:54",
        "description": {
            "lang": "en",
            "value": "Insufficient data validation in Omnibox in Google Chrome prior to 85.0.4183.83 allowed a remote attacker to perform domain spoofing via IDN homographs via a crafted domain name."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-6583",
        "datePublished": "2020-01-08T19:06:46",
        "description": {
            "lang": "en",
            "value": "BigProf Online Invoicing System (OIS) through 2.6 has XSS that can be leveraged for session hijacking. An attacker can exploit the XSS vulnerability, retrieve the session cookie from the administrator login, and take over the administrator account via the Name field in an Add New Client action."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-6616",
        "datePublished": "2020-05-08T19:50:28",
        "description": {
            "lang": "en",
            "value": "Some Broadcom chips mishandle Bluetooth random-number generation because a low-entropy Pseudo Random Number Generator (PRNG) is used in situations where a Hardware Random Number Generator (HRNG) should have been used to prevent spoofing. This affects, for example, Samsung Galaxy S8, S8+, and Note8 devices with the BCM4361 chipset. The Samsung ID is SVE-2020-16882 (May 2020)."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-6654",
        "datePublished": "2020-09-30T20:36:20.513791Z",
        "description": {
            "lang": "en",
            "value": "A DLL Hijacking vulnerability in Eaton's 9000x Programming and Configuration Software v 2.0.38 and prior allows an attacker to execute arbitrary code by replacing the required DLLs with malicious DLLs when the software try to load vci11un6.DLL and cinpl.DLL."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-6781",
        "datePublished": "2020-09-16T18:10:43.568646Z",
        "description": {
            "lang": "en",
            "value": "Improper certificate validation for certain connections in the Bosch Smart Home System App for iOS prior to version 9.17.1 potentially allows to intercept video contents by performing a man-in-the-middle attack."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 6.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-6808",
        "datePublished": "2020-03-25T21:13:32",
        "description": {
            "lang": "en",
            "value": "When a JavaScript URL (javascript:) is evaluated and the result is a string, this string is parsed to create an HTML document, which is then presented. Previously, this document's URL (as reported by the document.location property, for example) was the originating javascript: URL which could lead to spoofing attacks; it is now correctly the URL of the originating document. This vulnerability affects Firefox < 74."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-6810",
        "datePublished": "2020-03-25T21:12:58",
        "description": {
            "lang": "en",
            "value": "After a website had entered fullscreen mode, it could have used a previously opened popup to obscure the notification that indicates the browser is in fullscreen mode. Combined with spoofing the browser chrome, this could have led to confusing the user about the current origin of the page and credential theft or other attacks. This vulnerability affects Firefox < 74."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-6863",
        "datePublished": "2020-02-27T16:48:05",
        "description": {
            "lang": "en",
            "value": "ZTE E8820V3 router product is impacted by a permission and access control vulnerability. Attackers could use this vulnerability to tamper with DDNS parameters and send DoS attacks on the specified URL."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-7213",
        "datePublished": "2020-01-21T16:26:36",
        "description": {
            "lang": "en",
            "value": "Parallels 13 uses cleartext HTTP as part of the update process, allowing man-in-the-middle attacks. Users of out-of-date versions are presented with a pop-up window for a parallels_updates.xml file on the http://update.parallels.com web site."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-7279",
        "datePublished": "2020-06-10T11:17:50.265499Z",
        "description": {
            "lang": "en",
            "value": "DLL Search Order Hijacking Vulnerability in the installer component of McAfee Host Intrusion Prevention System (Host IPS) for Windows prior to 8.0.0 Patch 15 Update allows attackers with local access to execute arbitrary code via execution from a compromised folder."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4.6,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-7308",
        "datePublished": "2021-04-15T07:40:19",
        "description": {
            "lang": "en",
            "value": "Cleartext Transmission of Sensitive Information between McAfee Endpoint Security (ENS) for Windows prior to 10.7.0 February 2021 Update and McAfee Global Threat Intelligence (GTI) servers using DNS allows a remote attacker to view the requests from ENS and responses from GTI over DNS. By gaining control of an intermediate DNS server or altering the network DNS configuration, it is possible for an attacker to intercept requests and send their own responses."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4.8,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-7312",
        "datePublished": "2020-09-10T09:45:15.974769Z",
        "description": {
            "lang": "en",
            "value": "DLL Search Order Hijacking Vulnerability in the installer in McAfee Agent (MA) for Windows prior to 5.6.6 allows local users to execute arbitrary code and escalate privileges via execution from a compromised folder."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.8,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-7329",
        "datePublished": "2020-11-11T09:15:15.729231Z",
        "description": {
            "lang": "en",
            "value": "Server-side request forgery vulnerability in the ePO extension in McAfee MVISION Endpoint prior to 20.11 allows remote attackers trigger server-side DNS requests to arbitrary domains via carefully constructed XML files loaded by an ePO administrator."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 7.2,
                "severity": "HIGH"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-7520",
        "datePublished": "2020-07-23T20:46:33",
        "description": {
            "lang": "en",
            "value": "A CWE-601: URL Redirection to Untrusted Site ('Open Redirect') vulnerability exists in Schneider Electric Software Update (SESU), V2.4.0 and prior, which could cause execution of malicious code on the victim's machine. In order to exploit this vulnerability, an attacker requires privileged access on the engineering workstation to modify a Windows registry key which would divert all traffic updates to go through a server in the attacker's possession. A man-in-the-middle attack is then used to complete the exploit."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-7585",
        "datePublished": "2020-06-10T16:23:39",
        "description": {
            "lang": "en",
            "value": "A vulnerability has been identified in SIMATIC PCS 7 V8.2 and earlier (All versions), SIMATIC PCS 7 V9.0 (All versions < V9.0 SP3), SIMATIC PDM (All versions < V9.2), SIMATIC STEP 7 V5.X (All versions < V5.6 SP2 HF3), SINAMICS STARTER (containing STEP 7 OEM version) (All versions < V5.4 HF2). A DLL Hijacking vulnerability could allow a local attacker to execute code with elevated privileges. The security vulnerability could be exploited by an attacker with local access to the affected systems. Successful exploitation requires user privileges but no user interaction. The vulnerability could allow an attacker to compromise the availability of the system as well as to have access to confidential information."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-7764",
        "datePublished": "2020-11-08T15:50:12.276340Z",
        "description": {
            "lang": "en",
            "value": "This affects the package find-my-way before 2.2.5, from 3.0.0 and before 3.0.5. It accepts the Accept-Version' header by default, and if versioned routes are not being used, this could lead to a denial of service. Accept-Version can be used as an unkeyed header in a cache poisoning attack."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 5.9,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "cache poisoning"
        ]
    },
    {
        "cveId": "CVE-2020-7982",
        "datePublished": "2020-03-16T21:05:49",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in OpenWrt 18.06.0 to 18.06.6 and 19.07.0, and LEDE 17.01.0 to 17.01.7. A bug in the fork of the opkg package manager before 2020-01-25 prevents correct parsing of embedded checksums in the signed repository index, allowing a man-in-the-middle attacker to inject arbitrary package payloads (which are installed without verification)."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-8169",
        "datePublished": "2020-12-14T19:41:54",
        "description": {
            "lang": "en",
            "value": "curl 7.62.0 through 7.70.0 is vulnerable to an information disclosure vulnerability that can lead to a partial password being leaked over the network and to the DNS server(s)."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-8241",
        "datePublished": "2020-10-28T12:47:07",
        "description": {
            "lang": "en",
            "value": "A vulnerability in the Pulse Secure Desktop Client < 9.1R9 could allow the attacker to perform a MITM Attack if end users are convinced to connect to a malicious server."
        },
        "metrics": [],
        "tags": [
            "mitm"
        ]
    },
    {
        "cveId": "CVE-2020-8277",
        "datePublished": "2020-11-19T00:32:13",
        "description": {
            "lang": "en",
            "value": "A Node.js application that allows an attacker to trigger a DNS request for a host of their choice could trigger a Denial of Service in versions < 15.2.1, < 14.15.1, and < 12.19.1 by getting the application to resolve a DNS record with a larger number of responses. This is fixed in 15.2.1, 14.15.1, and 12.19.1."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-8279",
        "datePublished": "2020-11-19T00:32:22",
        "description": {
            "lang": "en",
            "value": "Missing validation of server certificates for out-going connections in Nextcloud Social < 0.4.0 allowed a man-in-the-middle attack."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-8293",
        "datePublished": "2021-01-26T16:33:25",
        "description": {
            "lang": "en",
            "value": "A missing input validation in Nextcloud Server before 20.0.2, 19.0.5, 18.0.11 allows users to store unlimited data in workflow rules causing load and potential DDoS on later interactions and usage with those rules."
        },
        "metrics": [],
        "tags": [
            "ddos"
        ]
    },
    {
        "cveId": "CVE-2020-8469",
        "datePublished": "2020-03-12T23:05:15",
        "description": {
            "lang": "en",
            "value": "Trend Micro Password Manager for Windows version 5.0 is affected by a DLL hijacking vulnerability would could potentially allow an attacker privleged escalation."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-8562",
        "datePublished": "2022-02-01T10:33:00.317144Z",
        "description": {
            "lang": "en",
            "value": "As mitigations to a report from 2019 and CVE-2020-8555, Kubernetes attempts to prevent proxied connections from accessing link-local or localhost networks when making user-driven connections to Services, Pods, Nodes, or StorageClass service providers. As part of this mitigation Kubernetes does a DNS name resolution check and validates that response IPs are not in the link-local (169.254.0.0/16) or localhost (127.0.0.0/8) range. Kubernetes then performs a second DNS resolution without validation for the actual connection. If a non-standard DNS server returns different non-cached responses, a user may be able to bypass the proxy IP restriction and access private networks on the control plane."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 2.2,
                "severity": "LOW"
            }
        ],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-8809",
        "datePublished": "2020-02-25T18:57:18",
        "description": {
            "lang": "en",
            "value": "Gurux GXDLMS Director prior to 8.5.1905.1301 downloads updates to add-ins and OBIS code over an unencrypted HTTP connection. A man-in-the-middle attacker can prompt the user to download updates by modifying the contents of gurux.fi/obis/files.xml and gurux.fi/updates/updates.xml. Then, the attacker can modify the contents of downloaded files. In the case of add-ins (if the user is using those), this will lead to code execution. In case of OBIS codes (which the user is always using as they are needed to communicate with the energy meters), this can lead to code execution when combined with CVE-2020-8810."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-8838",
        "datePublished": "2020-03-23T16:05:43",
        "description": {
            "lang": "en",
            "value": "An issue was discovered in Zoho ManageEngine AssetExplorer 6.5. During an upgrade of the Windows agent, it does not validate the source and binary downloaded. This allows an attacker on an adjacent network to execute code with NT AUTHORITY/SYSTEM privileges on the agent machines by providing an arbitrary executable via a man-in-the-middle attack."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-8896",
        "datePublished": "2020-05-04T13:25:04",
        "description": {
            "lang": "en",
            "value": "A Buffer Overflow vulnerability in the khcrypt implementation in Google Earth Pro versions up to and including 7.3.2 allows an attacker to perform a Man-in-the-Middle attack using a specially crafted key to read data past the end of the buffer used to hold it. Mitigation: Update to Google Earth Pro 7.3.3."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 4.2,
                "severity": "MEDIUM"
            }
        ],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-8954",
        "datePublished": "2020-06-08T16:30:32",
        "description": {
            "lang": "en",
            "value": "OpenSearch Web browser 1.0.4.9 allows Intent Scheme Hijacking.[a link that opens another app in the browser can be manipulated]"
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-8959",
        "datePublished": "2020-02-19T16:12:36",
        "description": {
            "lang": "en",
            "value": "Western Digital WesternDigitalSSDDashboardSetup.exe before 3.0.2.0 allows DLL Hijacking."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-8984",
        "datePublished": "2020-03-24T20:12:07",
        "description": {
            "lang": "en",
            "value": "lib/NSSDropbox.php in ZendTo prior to 5.22-2 Beta allowed IP address spoofing via the X-Forwarded-For header."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-8987",
        "datePublished": "2020-03-09T16:38:32",
        "description": {
            "lang": "en",
            "value": "Avast AntiTrack before 1.5.1.172 and AVG Antitrack before 2.0.0.178 proxies traffic to HTTPS sites but does not validate certificates, and thus a man-in-the-middle can host a malicious website using a self-signed certificate. No special action necessary by the victim using AntiTrack with \"Allow filtering of HTTPS traffic for tracking detection\" enabled. (This is the default configuration.)"
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-8989",
        "datePublished": "2020-02-13T20:46:12",
        "description": {
            "lang": "en",
            "value": "In the Voatz application 2020-01-01 for Android, the amount of data transmitted during a single voter's vote depends on the different lengths of the metadata across the available voting choices, which makes it easier for remote attackers to discover this voter's choice by sniffing the network. For example, a small amount of sniffed data may indicate that a vote was cast for the candidate with the least metadata. An active man-in-the-middle attacker can leverage this behavior to disrupt voters' abilities to vote for a candidate opposed by the attacker."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-9055",
        "datePublished": "2020-03-30T20:50:27.102705Z",
        "description": {
            "lang": "en",
            "value": "Versiant LYNX Customer Service Portal (CSP), version 3.5.2, is vulnerable to stored cross-site scripting, which could allow a local, authenticated attacker to insert malicious JavaScript that is stored and displayed to the end user. This could lead to website redirects, session cookie hijacking, or information disclosure."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 3.9,
                "severity": "LOW"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-9056",
        "datePublished": "2020-04-10T18:35:23.402893Z",
        "description": {
            "lang": "en",
            "value": "Periscope BuySpeed version 14.5 is vulnerable to stored cross-site scripting, which could allow a local, authenticated attacker to store arbitrary JavaScript within the application. This JavaScript is subsequently displayed by the application without sanitization and is executed in the browser of the user, which could possibly cause website redirection, session hijacking, or information disclosure. This vulnerability has been patched in BuySpeed version 15.3."
        },
        "metrics": [
            {
                "type": "cvssV3_1",
                "baseScore": 3.9,
                "severity": "LOW"
            }
        ],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-9076",
        "datePublished": "2020-06-15T15:07:13",
        "description": {
            "lang": "en",
            "value": "HUAWEI P30;HUAWEI P30 Pro;Tony-AL00B smartphones with versions earlier than 10.1.0.135(C00E135R2P11); versions earlier than 10.1.0.135(C00E135R2P8), versions earlier than 10.1.0.135 have an improper authentication vulnerability. Due to the identity of the message sender not being properly verified, an attacker can exploit this vulnerability through man-in-the-middle attack to induce user to access malicious URL."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-9100",
        "datePublished": "2020-07-06T17:24:56",
        "description": {
            "lang": "en",
            "value": "Earlier than HiSuite 10.1.0.500 have a DLL hijacking vulnerability. This vulnerability exists due to some DLL file is loaded by HiSuite improperly. And it allows an attacker to load this DLL file of the attacker's choosing."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-9367",
        "datePublished": "2021-03-18T19:35:29",
        "description": {
            "lang": "en",
            "value": "The MPS Agent in Zoho ManageEngine Desktop Central MSP build MSP build 10.0.486 is vulnerable to DLL Hijacking: dcinventory.exe and dcconfig.exe try to load CSUNSAPI.dll without supplying the complete path. The issue is aggravated because this DLL is missing from the installation, thus making it possible to hijack the DLL and subsequently inject code, leading to an escalation of privilege to NT AUTHORITY\\SYSTEM."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-9370",
        "datePublished": "2020-03-05T12:27:54",
        "description": {
            "lang": "en",
            "value": "HUMAX HGA12R-02 BRGCAA 1.1.53 devices allow Session Hijacking."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-9418",
        "datePublished": "2020-03-05T15:23:48",
        "description": {
            "lang": "en",
            "value": "An untrusted search path vulnerability in the installer of PDFescape Desktop version 4.0.22 and earlier allows an attacker to gain privileges and execute code via DLL hijacking."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-9435",
        "datePublished": "2020-03-12T13:25:33",
        "description": {
            "lang": "en",
            "value": "PHOENIX CONTACT TC ROUTER 3002T-4G through 2.05.3, TC ROUTER 2002T-3G through 2.05.3, TC ROUTER 3002T-4G VZW through 2.05.3, TC ROUTER 3002T-4G ATT through 2.05.3, TC CLOUD CLIENT 1002-4G through 2.03.17, and TC CLOUD CLIENT 1002-TXTX through 1.03.17 devices contain a hardcoded certificate (and key) that is used by default for web-based services on the device. Impersonation, man-in-the-middle, or passive decryption attacks are possible if the generic certificate is not replaced by a device-specific certificate during installation."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-9488",
        "datePublished": "2020-04-27T15:36:10",
        "description": {
            "lang": "en",
            "value": "Improper validation of certificate with host mismatch in Apache Log4j SMTP appender. This could allow an SMTPS connection to be intercepted by a man-in-the-middle attack which could leak any log messages sent through that appender. Fixed in Apache Log4j 2.12.3 and 2.13.1"
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-9499",
        "datePublished": "2020-04-09T13:19:23",
        "description": {
            "lang": "en",
            "value": "Some Dahua products have buffer overflow vulnerabilities. After the successful login of the legal account, the attacker sends a specific DDNS test command, which may cause the device to go down."
        },
        "metrics": [],
        "tags": [
            "dns"
        ]
    },
    {
        "cveId": "CVE-2020-9525",
        "datePublished": "2020-08-10T15:21:43",
        "description": {
            "lang": "en",
            "value": "CS2 Network P2P through 3.x, as used in millions of Internet of Things devices, suffers from an authentication flaw that allows remote attackers to perform a man-in-the-middle attack, as demonstrated by eavesdropping on user video/audio streams, capturing credentials, and compromising devices."
        },
        "metrics": [],
        "tags": [
            "Man-in-the-middle"
        ]
    },
    {
        "cveId": "CVE-2020-9672",
        "datePublished": "2020-07-17T00:00:52",
        "description": {
            "lang": "en",
            "value": "Adobe ColdFusion 2016 update 15 and earlier versions, and ColdFusion 2018 update 9 and earlier versions have a dll search-order hijacking vulnerability. Successful exploitation could lead to privilege escalation."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-9673",
        "datePublished": "2020-07-17T00:01:14",
        "description": {
            "lang": "en",
            "value": "Adobe ColdFusion 2016 update 15 and earlier versions, and ColdFusion 2018 update 9 and earlier versions have a dll search-order hijacking vulnerability. Successful exploitation could lead to privilege escalation."
        },
        "metrics": [],
        "tags": [
            "hijacking"
        ]
    },
    {
        "cveId": "CVE-2020-9942",
        "datePublished": "2020-12-08T19:17:43",
        "description": {
            "lang": "en",
            "value": "An inconsistent user interface issue was addressed with improved state management. This issue is fixed in macOS Big Sur 11.0.1, Safari 13.1.2. Visiting a malicious website may lead to address bar spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-9945",
        "datePublished": "2020-12-08T19:19:39",
        "description": {
            "lang": "en",
            "value": "A spoofing issue existed in the handling of URLs. This issue was addressed with improved input validation. This issue is fixed in macOS Big Sur 11.0.1, Safari 14.0.1. Visiting a malicious website may lead to address bar spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-9987",
        "datePublished": "2020-12-08T19:29:48",
        "description": {
            "lang": "en",
            "value": "An inconsistent user interface issue was addressed with improved state management. This issue is fixed in Safari 14.0. Visiting a malicious website may lead to address bar spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    },
    {
        "cveId": "CVE-2020-9993",
        "datePublished": "2020-12-08T19:31:09",
        "description": {
            "lang": "en",
            "value": "The issue was addressed with improved UI handling. This issue is fixed in watchOS 7.0, Safari 14.0, iOS 14.0 and iPadOS 14.0. Visiting a malicious website may lead to address bar spoofing."
        },
        "metrics": [],
        "tags": [
            "spoofing"
        ]
    }
]